<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Untitled Document</title>
</head>

<body>
<table cellspacing="0" cellpadding="0">
  <tr>
    <td width="682" valign="top"><p> Groupe de travail R&eacute;seau </p></td>
    <td width="337" valign="top"><p> J. Klensin, Editor </p></td>
  </tr>
  <tr>
    <td width="682" valign="top"><p><strong> Request for Comments : 2821 </strong></p></td>
    <td width="337" valign="top"><p> AT&amp;T Laboratories </p></td>
  </tr>
  <tr>
    <td width="682" valign="top"><p> RFC rendues obsol&egrave;tes : 821, 974, 1869 </p></td>
    <td width="337" valign="top"><p> avril 2001 </p></td>
  </tr>
  <tr>
    <td width="682" valign="top"><p> RFC mises &agrave; jour : 1123 </p></td>
    <td width="337" valign="top"><p>&nbsp; </p></td>
  </tr>
  <tr>
    <td width="682" valign="top"><p> Cat&eacute;gorie : En cours de normalisation </p></td>
    <td width="337" valign="top"><p> Traduction Claude Bri&egrave;re de L&rsquo;Isle, d&eacute;cembre 2007 </p></td>
  </tr>
</table>
<p>&nbsp; </p>
<h1 align="center">Protocole simple de transfert de messagerie </h1>
<p>&nbsp; </p>
<p><strong> Statut de ce m&eacute;mo </strong></p>
<p>Le pr&eacute;sent document sp&eacute;cifie un protocole de normalisation Internet pour la communaut&eacute; de l'Internet, qui appelle &agrave; la discussion et &agrave; des suggestions pour son am&eacute;lioration. Pri&egrave;re de se reporter &agrave; l'&eacute;dition en cours des &quot;Normes de protocole officielles de l'Internet&quot; (STD 1) sur l'&eacute;tat de la normalisation et le statut de ce protocole. La distribution du pr&eacute;sent m&eacute;mo n'est soumise &agrave; aucune restriction. </p>
<p>&nbsp; </p>
<p><strong> Notice de Copyright </strong></p>
<p>Copyright (C) The Internet Society (2001). Tous droits r&eacute;serv&eacute;s </p>
<p>&nbsp; </p>
<p><strong>R&eacute;sum&eacute; </strong></p>
<p> Le pr&eacute;sent document est une sp&eacute;cification compl&egrave;te du protocole de base de transport de messagerie &eacute;lectronique Internet. Il consolide, met &agrave; jour et pr&eacute;cise, mais n&rsquo;ajoute aucune nouvelle fonctionnalit&eacute; ni ne change une fonctionnalit&eacute; existante : <br>
- de la sp&eacute;cification SMTP (protocole simple de transfert de messagerie) originale de la RFC 821 [30], <br>
- des exigences et implications du syst&egrave;me de nom de domaine pour le transport de messagerie des RFC 1035 [22] et 974 [27], <br>
- des pr&eacute;cisions et d&eacute;clarations d&rsquo;applicabilit&eacute; de la RFC 1123 [2], et <br>
- des mat&eacute;riaux tir&eacute;s des m&eacute;canismes d&rsquo;extension SMTP [19]. </p>
<p>Il rend obsol&egrave;tes les RFC 821 et RFC 974, et met &agrave; jour la RFC 1123 (il remplace les mat&eacute;riaux de transport de messagerie de la RFC 1123). Cependant, la RFC 821 sp&eacute;cifie quelques dispositifs qui n&rsquo;avaient pas une utilisation significative dans l&rsquo;Internet vers le milieu des ann&eacute;es 1990 et (dans les appendices) des mod&egrave;les de transport suppl&eacute;mentaires. Ces sections sont omises ici pour des raison de clart&eacute; et de bri&egrave;vet&eacute;&nbsp;; les lecteurs qui en ont besoin se reporteront &agrave; la RFC 821. </p>
<p>Il comporte aussi des &eacute;l&eacute;ments suppl&eacute;mentaires provenant de la RFC 1123 et qui n&eacute;cessitent quelques d&eacute;veloppements. Ces &eacute;l&eacute;ments ont &eacute;t&eacute; identifi&eacute;s de plusieurs fa&ccedil;ons, surtout par des &eacute;changes d&rsquo;id&eacute;es sur diverses listes de diffusion et groupes de nouvelles et des probl&egrave;mes de compr&eacute;hension ou d&rsquo;interpr&eacute;tation qui sont apparus lors du d&eacute;ploiement des extensions SMTP. Lorsque la pr&eacute;sente sp&eacute;cification va au-del&agrave; de la simple consolidation et diff&egrave;re effectivement des documents pr&eacute;c&eacute;dents, elle se substitue &agrave; eux techniquement aussi bien que textuellement. </p>
<p>Bien que SMTP ait &eacute;t&eacute; con&ccedil;u comme protocole de transport et livraison de messagerie, la pr&eacute;sente sp&eacute;cification contient aussi des informations qui sont importantes pour son utilisation comme protocole de &quot;pr&eacute;sentation de messagerie&quot;, tel que recommand&eacute; pour POP [3, 26] et IMAP [6]. Des questions suppl&eacute;mentaires de pr&eacute;sentation sont expos&eacute;es dans la RFC&nbsp;2476 [15]. </p>
<p>Le paragraphe 2.3 donne des d&eacute;finitions des termes sp&eacute;cifiques du pr&eacute;sent document. Except&eacute; lorsque la terminologie historique est n&eacute;cessaire pour la pr&eacute;cision, le pr&eacute;sent document utilise la terminologie actuelle de &quot;client&quot; et &quot;serveur&quot;' pour identifier respectivement le processus d&rsquo;envoi et de r&eacute;ception SMTP. </p>
<p>Un document voisin [32] discute des en-t&ecirc;tes de message, des corps et formats de message et de leurs structures, et leurs relations. </p>
<p>&nbsp; </p>
<p align="center"><strong> Table des mati&egrave;res </strong></p>
<p><a href="#_Toc186287705">1 Introduction</a><br>
<a href="#_Toc186287706">2 Le mod&egrave;le SMTP</a><br>
<a href="#_Toc186287707">2.1 Structure de base</a><br>
<a href="#_Toc186287708">2.2 Mod&egrave;le d&rsquo;extension</a><br>
<a href="#_Toc186287709">2.2.1 Fondements</a><br>
<a href="#_Toc186287710">2.2.2 D&eacute;finition et enregistrement des extensions</a><br>
<a href="#_Toc186287711">2.3 Terminologie</a><br>
<a href="#_Toc186287712">2.3.1 Objets de messagerie</a><br>
<a href="#_Toc186287713">2.3.2 Envoyeurs et receveurs</a><br>
<a href="#_Toc186287714">2.3.3 Agents de messagerie et m&eacute;morisation de message</a><br>
<a href="#_Toc186287715">2.3.4 H&ocirc;te</a><br>
<a href="#_Toc186287716">2.3.5 Domaine</a><br>
<a href="#_Toc186287717">2.3.6 M&eacute;moire tampon et tableau d&rsquo;&eacute;tat</a><br>
<a href="#_Toc186287718">2.3.7 Lignes</a><br>
<a href="#_Toc186287719">2.3.8 Syst&egrave;mes d&rsquo;origine, de livraison, de relais, et de passerelle</a><br>
<a href="#_Toc186287720">2.3.9 Contenu de message et donn&eacute;es de messagerie</a><br>
<a href="#_Toc186287721">2.3.10 Bo&icirc;te &agrave; lettres et adresse</a><br>
<a href="#_Toc186287722">2.3.11 R&eacute;ponse</a><br>
<a href="#_Toc186287723">2.4 Principes g&eacute;n&eacute;raux de syntaxe et mod&egrave;le de transaction</a><br>
<a href="#_Toc186287724">3 Proc&eacute;dures SMTP : g&eacute;n&eacute;ralit&eacute;s</a><br>
<a href="#_Toc186287725">3.1 Initiation de session</a><br>
<a href="#_Toc186287726">3.2 Initiation du client</a><br>
<a href="#_Toc186287727">3.3 Transactions de messagerie</a><br>
<a href="#_Toc186287728">3.4 Transmission de correction d&rsquo;adresse ou de mise &agrave; jour</a><br>
<a href="#_Toc186287729">3.5 Commandes pour le d&eacute;bogage d&rsquo;adresses</a><br>
<a href="#_Toc186287730">3.5.1 G&eacute;n&eacute;ralit&eacute;s</a><br>
<a href="#_Toc186287731">3.5.2 R&eacute;ponse normale VRFY</a><br>
<a href="#_Toc186287732">3.5.3 Signification de la r&eacute;ponse de succ&egrave;s VRFY ou EXPN</a><br>
<a href="#_Toc186287733">3.5.4 S&eacute;mantique et applications de EXPN</a><br>
<a href="#_Toc186287734">3.6 Domaines</a><br>
<a href="#_Toc186287735">3.7 Relais</a><br>
<a href="#_Toc186287736">3.8 Passerelles de messagerie</a><br>
<a href="#_Toc186287737">3.8.1 Champs d&rsquo;en-t&ecirc;te dans l&rsquo;utilisation de passerelles</a><br>
<a href="#_Toc186287738">3.8.2 Lignes re&ccedil;ues dans l&rsquo;utilisation de passerelles</a><br>
<a href="#_Toc186287739">3.8.3 Adresses dans l&rsquo;utilisation de passerelles</a><br>
<a href="#_Toc186287740">3.8.4 Autres champs d&rsquo;en-t&ecirc;te dans l&rsquo;utilisation de passerelles</a><br>
<a href="#_Toc186287741">3.8.5 Enveloppes dans l&rsquo;utilisation de passerelles</a><br>
<a href="#_Toc186287742">3.9 Fin des sessions et des connexions</a><br>
<a href="#_Toc186287743">3.10 Listes de messagerie et alias</a><br>
<a href="#_Toc186287744">3.10.1 Alias</a><br>
<a href="#_Toc186287745">3.10.2 Liste</a><br>
<a href="#_Toc186287746">4 Les sp&eacute;cifications SMTP</a><br>
<a href="#_Toc186287747">4.1 Commandes SMTP</a><br>
<a href="#_Toc186287748">4.1.1 S&eacute;mantique et syntaxe des commandes</a><br>
<a href="#_Toc186287749">4.1.2 Syntaxe de l&rsquo;argument de commande</a><br>
<a href="#_Toc186287750">4.1.3 Adresses litt&eacute;rales</a><br>
<a href="#_Toc186287751">4.1.4 Ordre des commandes</a><br>
<a href="#_Toc186287752">4.1.5 Commandes d&rsquo;utilisation priv&eacute;e</a><br>
<a href="#_Toc186287753">4.2 R&eacute;ponses SMTP</a><br>
<a href="#_Toc186287754">4.2.1 S&eacute;v&eacute;rit&eacute; et th&eacute;orie des codes de r&eacute;ponse</a><br>
<a href="#_Toc186287755">4.2.2 Codes de r&eacute;ponse par groupes de fonction</a><br>
<a href="#_Toc186287756">4.2.3 Codes de r&eacute;ponse par ordre num&eacute;rique</a><br>
<a href="#_Toc186287757">4.2.4 Code de r&eacute;ponse 502</a><br>
<a href="#_Toc186287758">4.2.5 Codes de r&eacute;ponse apr&egrave;s DATA et le &lt;CRLF&gt;.&lt;CRLF&gt; suivant</a><br>
<a href="#_Toc186287759">4.3 S&eacute;quen&ccedil;age des commandes et des r&eacute;ponses</a><br>
<a href="#_Toc186287760">4.3.1 G&eacute;n&eacute;ralit&eacute;s sur le s&eacute;quen&ccedil;age</a><br>
<a href="#_Toc186287761">4.3.2 S&eacute;quences de commande-r&eacute;ponse</a><br>
<a href="#_Toc186287762">4.4 Informations de trace</a><br>
<a href="#_Toc186287763">4.5 Questions de mise en &oelig;uvre suppl&eacute;mentaires</a><br>
<a href="#_Toc186287764">4.5.1 Mise en &oelig;uvre minimum</a><br>
<a href="#_Toc186287765">4.5.2 Transparence</a><br>
<a href="#_Toc186287766">4.5.3 Tailles et fin de temporisation</a><br>
<a href="#_Toc186287767">4.5.4 Strat&eacute;gies de recommencement</a><br>
<a href="#_Toc186287768">4.5.5 Messages avec un chemin inverse nul</a><br>
<a href="#_Toc186287769">5 R&eacute;solution d&rsquo;adresse et traitement de messagerie . </a><br>
<a href="#_Toc186287770">6 D&eacute;tection de probl&egrave;me et traitement</a><br>
<a href="#_Toc186287771">6.1 Livraison fiable et r&eacute;ponses par messagerie &eacute;lectronique</a><br>
<a href="#_Toc186287772">6.2 D&eacute;tection de boucle</a><br>
<a href="#_Toc186287773">6.3 Compensation des irr&eacute;gularit&eacute;s</a><br>
<a href="#_Toc186287774">7 Consid&eacute;rations pour la s&eacute;curit&eacute;</a><br>
<a href="#_Toc186287775">7.1 S&eacute;curit&eacute; de la messagerie et usurpation d&rsquo;identit&eacute;</a><br>
<a href="#_Toc186287776">7.2 Copies &quot;aveugles&quot;</a><br>
<a href="#_Toc186287777">7.3 VRFY, EXPN, et la s&eacute;curit&eacute;</a><br>
<a href="#_Toc186287778">7.4 Divulgation d&rsquo;informations dans les annonces</a><br>
<a href="#_Toc186287779">7.5 Divulgation d&rsquo;informations dans les champs Trace</a><br>
<a href="#_Toc186287780">7.6 Divulgation d&rsquo;informations dans la transmission des messages</a><br>
<a href="#_Toc186287781">7.7 Port&eacute;e du fonctionnement des serveurs SMTP</a><br>
<a href="#_Toc186287782">8 Consid&eacute;rations relatives &agrave; l&rsquo;IANA</a><br>
<a href="#_Toc186287783">9 R&eacute;f&eacute;rences</a><br>
<a href="#_Toc186287784">10 Adresse de l&rsquo;&eacute;diteur</a><br>
<a href="#_Toc186287785">11 Remerciements</a><br>
<a href="#_Toc186287786">APPENDICES</a><br>
<a href="#_Toc186287787">A Service de transport TCP</a><br>
<a href="#_Toc186287788">B G&eacute;n&eacute;rer les commandes SMTP &agrave; partir des en-t&ecirc;tes de la RFC 822</a><br>
<a href="#_Toc186287789">C Routes de source</a><br>
<a href="#_Toc186287790">D Sc&eacute;narios</a><br>
<a href="#_Toc186287791">D.1 Sc&eacute;nario de transaction SMTP typique</a><br>
<a href="#_Toc186287792">D.2 Sc&eacute;nario de transaction SMTP interrompue</a><br>
<a href="#_Toc186287793">D.3 Sc&eacute;nario de messagerie relay&eacute;e</a><br>
<a href="#_Toc186287794">D.4 Sc&eacute;nario de v&eacute;rification et d&rsquo;envoi</a><br>
<a href="#_Toc186287795">E Autres questions de passerelles</a><br>
<a href="#_Toc186287796">F Dispositifs d&eacute;conseill&eacute;s de la RFC 821</a><br>
<a href="#_Toc186287797">F.1 TURN</a><br>
<a href="#_Toc186287798">F.2 Acheminement de source</a><br>
<a href="#_Toc186287799">F.3 HELO</a><br>
<a href="#_Toc186287800">F.4 Caract&egrave;re #</a><br>
<a href="#_Toc186287801">F.5 Dates et ans</a><br>
<a href="#_Toc186287802">F.6 Envoi direct contre messagerie</a></p>
<p>&nbsp;</p>
<h1><a name="_Toc186287705"></a><a name="_Toc186079860"></a><a name="_Toc186079731"> 1 Introduction</a></h1>
<p>L&rsquo;objectif du protocole simple de transfert de messagerie (SMTP, <em>Simple Mail Transfer Protocol</em>) est de transf&eacute;rer la messagerie de fa&ccedil;on fiable et efficace. SMTP est ind&eacute;pendant du sous syst&egrave;me particulier de transmission et n&rsquo;exige qu&rsquo;un canal de flux de donn&eacute;es ordonn&eacute;es fiable. Alors que le pr&eacute;sent document expose sp&eacute;cifiquement le transport sur TCP, d&rsquo;autres modes de transport sont possibles. Les appendices &agrave; la RFC 821 en d&eacute;crivent plusieurs. </p>
<p>Une caract&eacute;ristique importante de SMTP est sa capacit&eacute; &agrave; transporter la messagerie &agrave; travers les r&eacute;seaux, appel&eacute;e habituellement le &quot;relais de messagerie SMTP&quot; (voir au paragraphe 3.8). Un r&eacute;seau consiste en h&ocirc;tes TCP mutuellement accessibles sur l&rsquo;Internet public, en h&ocirc;tes mutuellement accessibles par TCP sur un Intranet TCP/IP isol&eacute; par un pare-feu, ou en h&ocirc;tes dans un autre environnement de LAN ou WAN qui utilise un protocole de niveau transport non TCP. En utilisant SMTP, un processus peut transf&eacute;rer de la messagerie &agrave; un autre processus sur le m&ecirc;me r&eacute;seau ou &agrave; un autre r&eacute;seau via un processus de relais ou de passerelle accessible aux deux r&eacute;seaux. </p>
<p>De cette fa&ccedil;on, un message &eacute;lectronique peut passer &agrave; travers un certain nombre d&rsquo;h&ocirc;tes relais ou passerelles interm&eacute;diaires sur son chemin de l&rsquo;envoyeur au receveur ultime. Le m&eacute;canisme d&rsquo;&eacute;change de messagerie du syst&egrave;me de nom de domaine [22, 27] (et de la section 5 du pr&eacute;sent document) est utilis&eacute; pour identifier le prochain bond de destination appropri&eacute; pour un message transport&eacute;. </p>
<h1><a name="_Toc186287706"></a><a name="_Toc186079861"></a><a name="_Toc186079732"> 2 Le mod&egrave;le SMTP</a></h1>
<h2><a name="_Toc186287707"></a><a name="_Toc186079862"></a><a name="_Toc186079733"> 2.1 Structure de base</a></h2>
<p>Le concept SMTP peut &ecirc;tre figur&eacute; comme suit&nbsp;: </p>
<p><img width="661" height="162" src="file:///C|/Documents and Settings/Administrateur/Application Data/Macromedia/Dreamweaver MX 2004/OfficeImageTemp/clip_image001_0048.gif"></p>
<p> Lorsqu&rsquo;un client SMTP a un message &agrave; transmettre, il &eacute;tablit un canal de transmission bidirectionnel avec un serveur SMTP. La responsabilit&eacute; d&rsquo;un client SMTP est de transf&eacute;rer les messages &eacute;lectroniques &agrave; un ou plusieurs serveurs SMTP, ou rapporter l&rsquo;&eacute;chec de ce transfert. </p>
<p>Les moyens par lesquels un message &eacute;lectronique est pr&eacute;sent&eacute; &agrave; un client SMTP, et la fa&ccedil;on dont ce client d&eacute;termine le ou les noms de domaine auxquels les messages sont &agrave; transf&eacute;rer sont une affaire locale, et ne sont pas examin&eacute;s dans le pr&eacute;sent document. Dans certains cas, le ou les noms de domaine transf&eacute;r&eacute;s &agrave;, ou d&eacute;termin&eacute;s par, un client SMTP vont identifier la ou les destinations finales du message. Dans d&rsquo;autres cas, courants lorsque les clients SMTP sont associ&eacute;s aux mises en &oelig;uvre des protocoles POP [3, 26] ou IMAP [6], ou lorsque le client SMTP est &agrave; l&rsquo;int&eacute;rieur d&rsquo;un environnement de service de transport isol&eacute;, le nom de domaine d&eacute;termin&eacute; va identifier une destination interm&eacute;diaire &agrave; travers laquelle tous les messages vont &ecirc;tre relay&eacute;s. Les clients SMTP qui transf&egrave;rent tout le trafic, sans consid&eacute;ration des noms de domaine cibles associ&eacute;s aux messages individuels, ou qui n&rsquo;entretiennent pas de files d&rsquo;attente pour r&eacute;essayer les transmissions de message qui n&rsquo;ont pu &ecirc;tre achev&eacute;es initialement, peuvent par ailleurs se conformer &agrave; la pr&eacute;sente sp&eacute;cification mais ne sont pas consid&eacute;r&eacute;s comme en &eacute;tant pleinement capables. Les mises en &oelig;uvre SMTP de pleine capacit&eacute;, y compris les relais utilis&eacute;s par celles de moindre capacit&eacute;, et leurs destinations, sont suppos&eacute;es prendre aussi en charge toute la mise en file d&rsquo;attente, le r&eacute;essai, et les fonctions d&rsquo;adresse de remplacement expos&eacute;es dans la pr&eacute;sente sp&eacute;cification. </p>
<p>Les moyens par lesquels un client SMTP, une fois qu&rsquo;il a d&eacute;termin&eacute; un nom de domaine cible, d&eacute;termine l&rsquo;identit&eacute; d&rsquo;un serveur SMTP auquel doit &ecirc;tre transf&eacute;r&eacute;e une copie d&rsquo;un message, puis effectue ce transfert, sont trait&eacute;s par le pr&eacute;sent document. Pour effectuer un transfert de messagerie &agrave; un serveur SMTP, un client SMTP &eacute;tablit un canal de transmission bidirectionnel avec ce serveur SMTP. Un client SMTP d&eacute;termine l&rsquo;adresse d&rsquo;un h&ocirc;te appropri&eacute; qui fait fonctionner un serveur SMTP en r&eacute;solvant un nom de domaine de destination soit &agrave; un h&ocirc;te &eacute;changeur de messagerie interm&eacute;diaire soit un h&ocirc;te cible final. </p>
<p>Un serveur SMTP peut doit &ecirc;tre la destination ultime soit un &quot;relais&quot; interm&eacute;diaire (c&rsquo;est-&agrave;-dire qu&rsquo;il peut assumer le r&ocirc;le d&rsquo;un client SMTP apr&egrave;s la r&eacute;ception du message) ou &quot;passerelle&quot; (c&rsquo;est-&agrave;-dire qu&rsquo;il peut transporter plus loin le message en utilisant un protocole autre que SMTP). Les commandes SMTP sont g&eacute;n&eacute;r&eacute;es par le client SMTP et envoy&eacute;es au serveur SMTP. Les r&eacute;ponses SMTP sont envoy&eacute;es du serveur SMTP au client SMTP en r&eacute;ponse aux commandes. </p>
<p>En d&rsquo;autres termes, le transfert de message peut survenir dans une seule connexion entre l&rsquo;envoyeur SMTP original et le receveur SMTP final, ou peut intervenir dans une s&eacute;rie de bonds &agrave; travers les syst&egrave;mes interm&eacute;diaires. Dans les deux cas, un passage formel de la responsabilit&eacute; du message survient : le protocole exige qu&rsquo;un serveur accepte la responsabilit&eacute; soit de livrer un message soit de rapporter de fa&ccedil;on appropri&eacute;e l&rsquo;&eacute;chec de la livraison. </p>
<p>Une fois le canal de transmission &eacute;tabli et la prise de contact initiale termin&eacute;e, le client SMTP initie normalement une transaction de messagerie. Une telle transaction consiste en une s&eacute;rie de commandes pour sp&eacute;cifier l&rsquo;origine et la destination du message et la transmission du contenu du message (y compris tous les en-t&ecirc;tes ou autres structures) lui-m&ecirc;me. Lorsque le m&ecirc;me message est envoy&eacute; &agrave; plusieurs receveurs, ce protocole recommande la transmission d&rsquo;une seule copie des donn&eacute;es pour tous les receveurs du m&ecirc;me h&ocirc;te de destination (ou relais interm&eacute;diaire). </p>
<p>Le serveur r&eacute;pond &agrave; chaque commande par une r&eacute;ponse ; les r&eacute;ponses peuvent indiquer que la commande a &eacute;t&eacute; accept&eacute;e, que des commandes suppl&eacute;mentaires sont attendues, ou qu&rsquo;une condition d&rsquo;erreur temporaire ou permanente existe. Les commandes qui sp&eacute;cifient l&rsquo;envoyeur ou les receveurs peuvent inclure des demandes d&rsquo;extension de service SMTP permises par le serveur comme expos&eacute; au paragraphe 2.2. Le dialogue est d&eacute;lib&eacute;r&eacute;ment en mode rigide, un &agrave; la fois, bien que ceci puisse &ecirc;tre modifi&eacute; d&rsquo;accord mutuel par des demandes d&rsquo;extension comme l&rsquo;intubation de commandes [13]. </p>
<p>Une fois qu&rsquo;un message donn&eacute; a &eacute;t&eacute; transmis, le client peut demander que la connexion soit close ou peut initier d&rsquo;autres transactions de messagerie. De plus, un client SMTP peut utiliser une connexion avec un serveur SMTP pour des services auxiliaires tels que la v&eacute;rification des adresses de courrier &eacute;lectronique ou la restitution d&rsquo;adresses d&rsquo;abonn&eacute;s &agrave; des listes de diffusion. </p>
<p>Comme sugg&eacute;r&eacute; plus haut, le pr&eacute;sent protocole fournit des m&eacute;canismes pour la transmission de courrier. Cette transmission survient normalement directement &agrave; partir de l&rsquo;h&ocirc;te de l&rsquo;utilisateur qui envoie vers l&rsquo;h&ocirc;te de l&rsquo;utilisateur qui re&ccedil;oit lorsque les deux h&ocirc;tes sont connect&eacute;s au m&ecirc;me service de transport. Lorsqu&rsquo;ils ne sont pas connect&eacute;s au m&ecirc;me service de transport, la transmission se fait via un ou plusieurs serveurs relais SMTP. Un h&ocirc;te interm&eacute;diaire qui agit comme relais SMTP ou comme passerelle vers un autre environnement de transmission est habituellement choisi gr&acirc;ce &agrave; l&rsquo;utilisation du m&eacute;canisme d&rsquo;&eacute;change de messagerie (MX, <em>Mail Exchanger</em>) du service de nom de domaine (DNS). </p>
<p>Normalement, les h&ocirc;tes interm&eacute;diaires sont d&eacute;termin&eacute;s via l&rsquo;enregistrement MX DNS, et non par un acheminement explicite de &quot;source&quot; (voir la section 5 et les appendices C et F.2). </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287708"></a><a name="_Toc186079863"></a><a name="_Toc186079734"> 2.2 Mod&egrave;le d&rsquo;extension</a></h2>
<h3><a name="_Toc186287709"></a><a name="_Toc186079735"> 2.2.1 Fondements</a></h3>
<p> Gr&acirc;ce &agrave; un effort d&eacute;but&eacute; en 1990, approximativement dix apr&egrave;s l&rsquo;ach&egrave;vement de la RFC 821, le protocole a &eacute;t&eacute; modifi&eacute; par un mod&egrave;le &quot;d&rsquo;extensions de service&quot; qui permettent au client et au serveur de se mettre d&rsquo;accord pour utiliser des fonctionnalit&eacute;s partag&eacute;es allant au del&agrave; des exigences originales de SMTP. Le m&eacute;canisme d&rsquo;extension SMTP d&eacute;finit les moyens qui permettent &agrave; un client et un serveur SMTP &eacute;tendus de se reconna&icirc;tre l&rsquo;un l&rsquo;autre, et le serveur peut informer le client des extensions de service qu&rsquo;il prend en charge. </p>
<p> Les mises en &oelig;uvre SMTP contemporaines DOIVENT accepter les m&eacute;canismes de base d&rsquo;extension. Par exemple, les serveurs DOIVENT accepter la commande EHLO m&ecirc;me si ils ne mettent en &oelig;uvre aucune extension sp&eacute;cifique et les clients DEVRAIENT utiliser de pr&eacute;f&eacute;rence EHLO plut&ocirc;t que HELO. (Cependant, pour la compatibilit&eacute; avec les mises en &oelig;uvre conformes plus anciennes, les clients et les serveurs SMTP DOIVENT accepter les m&eacute;canismes du HELO original comme position de repli.) Sauf lorsque les diff&eacute;rentes caract&eacute;ristiques de HELO doivent &ecirc;tre identifi&eacute;es pour les besoins de l&rsquo;interop&eacute;rabilit&eacute;, le pr&eacute;sent document ne discute que de EHLO. </p>
<p>SMTP est largement d&eacute;velopp&eacute; et des mises en &oelig;uvre de grande qualit&eacute; se sont r&eacute;v&eacute;l&eacute;es tr&egrave;s robustes. Cependant, la communaut&eacute; de l&rsquo;Internet estime maintenant que certains services importants n&rsquo;ont pas &eacute;t&eacute; pr&eacute;vus lors de la conception du protocole. Si la prise en charge de ces services doit se faire, cela doit &ecirc;tre d&rsquo;une fa&ccedil;on qui permette aux plus anciennes mises en &oelig;uvre de continuer de fonctionner d&rsquo;une fa&ccedil;on acceptable. le cadre d&rsquo;extension consiste en : <br>
- la commande SMTP EHLO, qui se substitue &agrave; l&rsquo;ancien HELO, <br>
- un registre des extensions de service SMTP, <br>
- des param&egrave;tres suppl&eacute;mentaires pour les commandes SMTP MAIL et RCPT, et <br>
- des remplacements facultatifs pour les commandes d&eacute;finies dans ce protocole, comme pour DATA dans les transmissions non-ASCII [33]. </p>
<p>La force de SMTP vient principalement de sa simplicit&eacute;. L&rsquo;exp&eacute;rience de nombreux protocoles a montr&eacute; que les protocoles avec peu d&rsquo;options tendent &agrave; l&rsquo;omnipr&eacute;sence, alors que les protocoles avec de nombreuses options rentrent dans l&rsquo;obscurit&eacute;. </p>
<p>Chacune de ces extension, ind&eacute;pendamment de ses avantages, doit &ecirc;tre soigneusement &eacute;valu&eacute;e au regard de ses co&ucirc;ts de mise en &oelig;uvre, d&eacute;veloppement, et interop&eacute;rabilit&eacute;. Dans de nombreux cas, le co&ucirc;t de l&rsquo;extension du service SMTP sera vraisemblablement sup&eacute;rieur aux avantages retir&eacute;s. </p>
<h3><a name="_Toc186287710"></a><a name="_Toc186079736"> 2.2.2 D&eacute;finition et enregistrement des extensions</a></h3>
<p> L&rsquo;IANA tient un registre des extensions de service SMTP. Une valeur de EHLO correspondante est associ&eacute;e &agrave; chaque extension. Chaque extension de service enregistr&eacute;e aupr&egrave;s de l&rsquo;IANA doit &ecirc;tre d&eacute;finie dans un document formel de protocole exp&eacute;rimental en cours de normalisation ou approuv&eacute; par l&rsquo;IESG. La d&eacute;finition doit comporter :<br>
- le nom textuel de l&rsquo;extension de service SMTP ; <br>
- la valeur du mot cl&eacute; EHLO associ&eacute; &agrave; l&rsquo;extension ; <br>
- la syntaxe et les valeurs possibles des param&egrave;tres associ&eacute;s &agrave; la valeur du mot cl&eacute; EHLO ; <br>
- tout verbe SMTP suppl&eacute;mentaire associ&eacute; &agrave; l&rsquo;extension (les verbes suppl&eacute;mentaires auront habituellement, sans y &ecirc;tre oblig&eacute;s, la m&ecirc;me valeur que celle du mot cl&eacute; EHLO) ; <br>
- tout nouveau param&egrave;tre que l&rsquo;extension associe aux verbes MAIL ou RCPT ; <br>
- une description de la fa&ccedil;on dont la prise en charge de l&rsquo;extension affecte le comportement du serveur et client SMTP ; <br>
- l&rsquo;incr&eacute;ment avec lequel l&rsquo;extension augmente la longueur maximum des commandes MAIL et/ou RCPT, au del&agrave; de ce qui est sp&eacute;cifi&eacute; dans la pr&eacute;sente norme. </p>
<p>De plus, toute valeur de mot cl&eacute; EHLO commen&ccedil;ant par un &quot;X&quot; majuscule ou minuscule se r&eacute;f&egrave;re &agrave; une extension de service SMTP locale utilis&eacute;e exclusivement par accord bilat&eacute;ral. Les mots cl&eacute; commen&ccedil;ant par &quot;X&quot; NE DOIVENT PAS &ecirc;tre utilis&eacute;s dans une extension de service enregistr&eacute;e. Au contraire, les valeurs de mot cl&eacute; pr&eacute;sent&eacute;es dans la r&eacute;ponse EHLO qui ne commencent pas par &quot;X&quot; DOIVENT correspondre &agrave; une extension de service SMTP exp&eacute;rimentale normalis&eacute;e, en cours de normalisation, ou approuv&eacute;e par l&rsquo;IESG enregistr&eacute;e aupr&egrave;s de l&rsquo;IANA. Un serveur conforme NE DOIT PAS offrir de valeurs de mot cl&eacute; pr&eacute;fix&eacute;es par autre chose que &quot;X&quot; qui ne soient pas d&eacute;crites dans une extension enregistr&eacute;e. </p>
<p>Les verbes et noms de param&egrave;tres suppl&eacute;mentaires sont li&eacute;s par les m&ecirc;mes r&egrave;gles que les mots cl&eacute; EHLO ; en particulier, les verbes commen&ccedil;ant par &quot;X&quot; sont des extensions locales qui peuvent n&rsquo;&ecirc;tre pas enregistr&eacute;es ou normalis&eacute;es. Au contraire, les verbes qui ne commencent pas par &quot;X&quot; doivent toujours &ecirc;tre enregistr&eacute;s. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287711"></a><a name="_Toc186079864"></a><a name="_Toc186079737"> 2.3 Terminologie</a></h2>
<p>Les mots cl&eacute;s &quot;DOIT&quot;, &quot;NE DOIT PAS&quot;, &quot;EXIGE&quot;, &quot;DEVRA&quot;, &quot;NE DEVRA PAS&quot;, &quot;DEVRAIT&quot;, &quot;NE DEVRAIT PAS&quot;, &quot;RECOMMAND&Eacute;&quot;, &quot;PEUT&quot;, et &quot;FACULTATIF&quot; dans ce document sont &agrave; interpr&eacute;ter comme d&eacute;crit ci-dessous&nbsp;: </p>
<p>1. DOIT : Ce mot, ou les termes &quot;EXIGE&quot; ou &quot;DEVRA&quot;, signifie que la d&eacute;finition est une exigence absolue de la sp&eacute;cification. </p>
<p>2. NE DOIT PAS : Cette phrase, ou la phrase &quot;NE DEVRA PAS&quot;, signifie que la d&eacute;finition est une interdiction absolue de cette sp&eacute;cification. </p>
<p>3. DEVRAIT : Ce mot, ou l&rsquo;adjectif &quot;RECOMMAND&Eacute;&quot;, signifie qu&rsquo;il peut exister des raisons valides dans des circonstances particuli&egrave;res pour ignorer un &eacute;l&eacute;ment particulier, mais que les pleines implications doivent en &ecirc;tre comprises et soigneusement pes&eacute;es avant de faire un choix diff&eacute;rent. </p>
<p>4. NE DEVRAIT PAS : Cette phrase, ou la phrase &quot;NON RECOMMAND&Eacute;&quot; signifie qu&rsquo;il peut exister des raisons valides dans des circonstances particuli&egrave;res o&ugrave; le comportement particulier est acceptable ou m&ecirc;me utile, mais que les pleines implications doivent en &ecirc;tre comprises et soigneusement pes&eacute;es avant de mettre en &oelig;uvre tout comportement d&eacute;crit avec cette mention. </p>
<p>5. PEUT : Ce mot, ou l&rsquo;adjectif &quot;FACULTATIF&quot;, signifie qu&rsquo;un &eacute;l&eacute;ment est vraiment facultatif. Un fabricant peut choisir d&rsquo;inclure l&rsquo;&eacute;l&eacute;ment parce qu&rsquo;un march&eacute; particulier l&rsquo;exige ou parce que le fabricant estime que cela am&eacute;liore son produit, alors qu&rsquo;un autre fabricant peut omettre le m&ecirc;me &eacute;l&eacute;ment. Une mise en &oelig;uvre qui n&rsquo;inclut pas une option particuli&egrave;re DOIT &ecirc;tre pr&ecirc;te &agrave; interop&eacute;rer avec une autre mise en &oelig;uvre qui l&rsquo;inclut, bien que peut-&ecirc;tre avec des fonctionnalit&eacute;s r&eacute;duites. De la m&ecirc;me fa&ccedil;on, une mise en &oelig;uvre qui n&rsquo;inclut pas une option DOIT &ecirc;tre pr&ecirc;te &agrave; interop&eacute;rer avec une autre mise en &oelig;uvre qui ne l&rsquo;inclut pas (sauf bien s&ucirc;r, la caract&eacute;ristique fournie par l&rsquo;option.) </p>
<h3><a name="_Toc186287712"></a><a name="_Toc186079738"> 2.3.1 Objets de messagerie</a></h3>
<p> SMTP transporte un objet de messagerie. Un objet de messagerie contient une enveloppe et un contenu. </p>
<p>L&rsquo;enveloppe SMTP est envoy&eacute;e comme une s&eacute;rie d&rsquo;unit&eacute;s de protocole SMTP (d&eacute;crites &agrave; la Section 3). Elle consiste en une adresse d&rsquo;origine (&agrave; laquelle devraient &ecirc;tre envoy&eacute;s les rapports d&rsquo;erreur)&nbsp;; une ou plusieurs adresses de r&eacute;ception ; et du mat&eacute;riel d&rsquo;extension de protocole facultatif. Historiquement, des variantes de la commande de sp&eacute;cification d&rsquo;adresse de r&eacute;ception (RCPT TO) pourraient &ecirc;tre utilis&eacute;es pour sp&eacute;cifier des mode de livraison de remplacement, comme l&rsquo;affichage imm&eacute;diat ; ces variantes sont maintenant d&eacute;conseill&eacute;es (voir l&rsquo;appendice F, paragraphe F.6). </p>
<p>Le contenu SMTP est envoy&eacute; dans l&rsquo;unit&eacute; de protocole SMTP DATA et a deux parties : les en-t&ecirc;tes et le corps. Si le contenu se conforme aux autres normes contemporaines, les en-t&ecirc;tes forment une collection de paires champ/valeur structur&eacute;es comme dans la sp&eacute;cification de format de message [32] ; le corps, s&rsquo;il est structur&eacute;, est d&eacute;fini conform&eacute;ment &agrave; MIME [12]. Le contenu est textuel par nature, exprim&eacute; en utilisant le r&eacute;pertoire US-ASCII [1]. Bien que les extensions SMTP (comme &quot;8BITMIME&quot; [20]) puissent assouplir cette restriction pour le corps du contenu, les en-t&ecirc;tes du contenu sont toujours cod&eacute;s en utilisant le r&eacute;pertoire US-ASCII. Une extension MIME [23] d&eacute;finit un algorithme de repr&eacute;sentation des valeurs d&rsquo;en-t&ecirc;te en-dehors du r&eacute;pertoire US-ASCII, tout en les codant toujours &agrave; l&rsquo;aide de ce r&eacute;pertoire. </p>
<h3><a name="_Toc186287713"></a><a name="_Toc186079739"> 2.3.2 Envoyeurs et receveurs</a></h3>
<p> Dans la RFC 821, les deux h&ocirc;tes qui participent &agrave; une transaction SMTP &eacute;taient d&eacute;crits comme &quot;envoyeur SMTP&quot; et &quot;receveur SMTP&quot;. Ce document a &eacute;t&eacute; modifi&eacute; pour refl&eacute;ter la terminologie actuelle de l&rsquo;industrie et se r&eacute;f&egrave;re donc &agrave; eux comme respectivement le &quot;client SMTP&quot; (ou parfois juste &quot;le client&quot;) et le &quot;serveur SMTP&quot; (ou juste &quot;le serveur&quot;). Comme un h&ocirc;te donn&eacute; peut agir &agrave; la fois comme serveur et client dans une situation de relais, la terminologie &quot;receveur&quot; et &quot;envoyeur&quot; est toujours utilis&eacute;e lorsque c&rsquo;est n&eacute;cessaire &agrave; la clart&eacute; du texte. </p>
<h3><a name="_Toc186287714"></a><a name="_Toc186079740"> 2.3.3 Agents de messagerie et m&eacute;morisation de message</a></h3>
<p> Une terminologie suppl&eacute;mentaire des syst&egrave;mes de messagerie est devenue courante apr&egrave;s la publication de la RFC 821 et, lorsque c&rsquo;est utile, elle est utilis&eacute;e dans la pr&eacute;sente sp&eacute;cification. En particulier, les serveurs et clients SMTP fournissent un service de transport de messagerie et agissent donc comme &quot;Agents de transfert de messagerie&quot; (MTA,<em> Mail Transfer Agent</em>). Les &quot;agents d&rsquo;utilisateur de messagerie&quot; (MUA ou UA, <em>Mail User Agent</em>) sont normalement vus comme les sources et cibles du courrier. &Agrave; la source, un MUA peut collecter la messagerie &agrave; transmettre en provenance d&rsquo;un utilisateur et la passer &agrave; un MTA ; le MTA final (&quot;livreur&quot;) serait vu comme passant le courrier &agrave; un MUA (ou au moins lui en transf&eacute;rant la responsabilit&eacute;, par exemple, en d&eacute;posant le message dans une &quot;m&eacute;moire de messages&quot;). Cependant, alors que ces termes sont utilis&eacute;s avec au moins l&rsquo;apparence d&rsquo;une grande pr&eacute;cision dans d&rsquo;autres environnements, les fronti&egrave;res impliqu&eacute;es entre les MUA et les MTA ne correspondent souvent pas pr&eacute;cis&eacute;ment aux pratiques courantes et conformes de la messagerie Internet. Et donc, le lecteur devrait &ecirc;tre prudent dans ses d&eacute;ductions sur les fortes relations et responsabilit&eacute;s que pourraient impliquer ces termes s&rsquo;ils &eacute;taient utilis&eacute;s dans un autre environnement. </p>
<h3><a name="_Toc186287715"></a><a name="_Toc186079741"> 2.3.4 H&ocirc;te</a></h3>
<p> Pour les besoins de la pr&eacute;sente sp&eacute;cification, un h&ocirc;te est un syst&egrave;me informatique rattach&eacute; &agrave; l&rsquo;Internet (ou, dans certains cas, &agrave; un r&eacute;seau TCP/IP priv&eacute;) et qui prend en charge le protocole SMTP. Les h&ocirc;tes sont connus par des noms (voir &quot;domaine&quot;) ; les identifier par des adresses num&eacute;riques est d&eacute;conseill&eacute;. </p>
<h3><a name="_Toc186287716"></a><a name="_Toc186079742"> 2.3.5 Domaine</a></h3>
<p> Un domaine (ou nom de domaine) consiste en un ou plusieurs composants s&eacute;par&eacute;s par un point. Ces composants (&quot;&eacute;tiquettes&quot; dans la terminologie DNS [22]) sont restreints pour les besoins de SMTP &agrave; consister en une s&eacute;quence de lettres, chiffres, et tir&eacute;s extraits de l&rsquo;ensemble de caract&egrave;res ASCII [1]. Les noms de domaine sont utilis&eacute;s comme noms d&rsquo;h&ocirc;tes et d&rsquo;autres entit&eacute;s de la hi&eacute;rarchie des noms de domaine. Par exemple, un domaine peut se r&eacute;f&eacute;rer &agrave; un alias (&eacute;tiquette d&rsquo;un CNAME RR) ou &agrave; l&rsquo;&eacute;tiquette d&rsquo;enregistrements d&rsquo;&eacute;change de messagerie &agrave; utiliser pour livrer le courrier au lieu de repr&eacute;senter un nom d&rsquo;h&ocirc;te. Voir [22] et la section 5 de la pr&eacute;sente sp&eacute;cification. </p>
<p>Le nom de domaine, tel que d&eacute;crit dans le pr&eacute;sent document et en [22], est le nom entier, pleinement qualifi&eacute; (souvent d&eacute;sign&eacute; comme un &quot;FQDN&quot;). Un nom de domaine qui n&rsquo;est pas en forme FQDN n&rsquo;est rien de plus qu&rsquo;un alias local. Les alias locaux NE DOIVENT PAS appara&icirc;tre dans les transactions SMTP. </p>
<h3><a name="_Toc186287717"></a><a name="_Toc186079743"> 2.3.6 M&eacute;moire tampon et tableau d&rsquo;&eacute;tat</a></h3>
<p> Les sessions SMTP sont sans &eacute;tat, les deux parties maintenant avec soin une vision commune de l&rsquo;&eacute;tat en cours. Dans le pr&eacute;sent document nous mod&eacute;lisons cet &eacute;tat par une &quot;m&eacute;moire tampon&quot; et un &quot;tableau d&rsquo;&eacute;tat&quot; virtuels sur le serveur qui peuvent &ecirc;tre utilis&eacute;s par le client pour, par exemple, &quot;vider la m&eacute;moire tampon&quot; ou &quot;remettre le tableau d&rsquo;&eacute;tat &agrave; z&eacute;ro&quot; causant l&rsquo;&eacute;limination des informations de la m&eacute;moire tampon et le retour de l&rsquo;&eacute;tat &agrave; un stade ant&eacute;rieur. </p>
<h3><a name="_Toc186287718"></a><a name="_Toc186079744"> 2.3.7 Lignes</a></h3>
<p> Les commandes SMTP et, sauf alt&eacute;r&eacute;es par une extension de service, les donn&eacute;es du message, sont transmises en &quot;lignes&quot;. Les lignes consistent en z&eacute;ro, un ou plusieurs caract&egrave;res de donn&eacute;es termin&eacute;s par la s&eacute;quence de caract&egrave;re ASCII &quot;CR&quot; (valeur hexad&eacute;cimale de 0D) suivie imm&eacute;diatement par le caract&egrave;re ASCII &quot;LF&quot; (valeur hexad&eacute;cimale 0A). Cette s&eacute;quence de terminaison est not&eacute;e par &lt;CRLF&gt; dans le pr&eacute;sent document. Les mises en &oelig;uvre conformes NE DOIVENT PAS reconna&icirc;tre ou g&eacute;n&eacute;rer d&rsquo;autre caract&egrave;re ou s&eacute;quence de caract&egrave;re comme terminaison de ligne. Des limites PEUVENT &ecirc;tre impos&eacute;es &agrave; la longueur de ligne par les serveurs (voir au paragraphe 4.5.3). </p>
<p>De plus, l&rsquo;apparition de caract&egrave;res &quot;nus&quot; &quot;CR&quot; ou &quot;LF&quot; dans le texte (c&rsquo;est-&agrave;-dire, l&rsquo;un sans l&rsquo;autre) a une longue histoire des probl&egrave;mes caus&eacute;s dans les mises en &oelig;uvre et applications de messagerie qui utilisent le syst&egrave;me de messagerie comme outil. Les mises en &oelig;uvre de client SMTP NE DOIVENT PAS transmettre ces caract&egrave;res sauf lorsqu&rsquo;ils sont destin&eacute;e &agrave; terminer les lignes et DOIVENT alors, comme indiqu&eacute; ci-dessus, ne les transmettre que comme s&eacute;quence &lt;CRLF&gt;. </p>
<h3><a name="_Toc186287719"></a><a name="_Toc186079745"> 2.3.8 Syst&egrave;mes d&rsquo;origine, de livraison, de relais, et de passerelle</a></h3>
<p> La pr&eacute;sente sp&eacute;cification fait une distinction entre quatre types de syst&egrave;mes SMTP, sur la base du r&ocirc;le que jouent ces syst&egrave;mes dans la transmission du courrier &eacute;lectronique. Un syst&egrave;me &quot;d&rsquo;origine&quot; (parfois appel&eacute; une origine SMTP) introduit la messagerie dans l&rsquo;Internet ou, plus g&eacute;n&eacute;ralement, dans un environnement de service de transport. Un syst&egrave;me SMTP de &quot;livraison&quot; est celui qui re&ccedil;oit la messagerie d&rsquo;un environnement de service de transport et le passe &agrave; un agent d&rsquo;utilisateur de messagerie ou le d&eacute;pose dans une m&eacute;moire de messages &agrave; laquelle l&rsquo;agent d&rsquo;utilisateur de messagerie est suppos&eacute; acc&eacute;der ult&eacute;rieurement. Un syst&egrave;me SMTP &quot;relais&quot; (qu&rsquo;on appelle habituellement simplement un &quot;relais&quot;) re&ccedil;oit le courrier d&rsquo;un client SMTP et le transmet, sans modification des donn&eacute;es du message autres que l&rsquo;ajout des informations de tra&ccedil;age, &agrave; un autre serveur SMTP pour un autre relais ou livraison. </p>
<p>Un syst&egrave;me SMTP de &quot;passerelle&quot; SMTP (qu&rsquo;on appelle habituellement simplement une &quot;passerelle&quot;) re&ccedil;oit le courrier d&rsquo;un syst&egrave;me client dans un environnement de transport et le transmet &agrave; un syst&egrave;me serveur dans un autre environnement de transport. Des diff&eacute;rences de protocoles ou de la s&eacute;mantique des messages entre les environnements de transport d&rsquo;un c&ocirc;t&eacute; ou de l&rsquo;autre d&rsquo;une passerelle peuvent exiger que le syst&egrave;me de passerelle effectue des transformations du message qui ne sont pas permises aux syst&egrave;mes de relais SMTP. Pour les besoins de la pr&eacute;sente sp&eacute;cification, les pare-feu qui r&eacute;&eacute;crivent les adresses devraient &ecirc;tre consid&eacute;r&eacute;s comme des passerelles, m&ecirc;me si SMTP est utilis&eacute; des deux c&ocirc;t&eacute;s (voir [11]). </p>
<h3><a name="_Toc186287720"></a><a name="_Toc186079746"> 2.3.9 Contenu de message et donn&eacute;es de messagerie</a></h3>
<p> Les termes &quot;contenu du message&quot; et &quot;donn&eacute;es de messagerie&quot; sont interchangeables dans le pr&eacute;sent document pour d&eacute;crire le mat&eacute;riel transmis apr&egrave;s l&rsquo;acceptation de la commande DATA et avant la transmission de l&rsquo;indication de fin des donn&eacute;es. Le contenu de message inclut les en-t&ecirc;tes de message et le corps de message &eacute;ventuellement structur&eacute;. La sp&eacute;cification MIME [12] donne les m&eacute;canismes standard pour la structuration des corps de message. </p>
<h3><a name="_Toc186287721"></a><a name="_Toc186079747"> 2.3.10 Bo&icirc;te &agrave; lettres et adresse</a></h3>
<p> Telle qu&rsquo;utilis&eacute;e dans la pr&eacute;sente sp&eacute;cification, une &quot;adresse&quot; est une cha&icirc;ne de caract&egrave;res qui identifie un usager &agrave; qui du courrier sera envoy&eacute; sur une localisation &agrave; laquelle le courrier sera d&eacute;pos&eacute;. Le terme de &quot;bo&icirc;te &agrave; lettres&quot; se r&eacute;f&egrave;re &agrave; ce d&eacute;p&ocirc;t. Les deux termes sont normalement interchangeables sauf dans le cas o&ugrave; une distinction entre la localisation dans laquelle le courrier est plac&eacute; (la bo&icirc;te &agrave; lettres) et une r&eacute;f&eacute;rence &agrave; celle-ci (l&rsquo;adresse) est importante. Une adresse consiste normalement en une sp&eacute;cification d&rsquo;un usager et d&rsquo;un domaine. La convention standard de d&eacute;nomination de bo&icirc;te &agrave; lettres est d&eacute;finie comme &eacute;tant &quot;partie-locale@domaine&quot; : l&rsquo;usage actuel permet un ensemble beaucoup plus large d&rsquo;applications que le simple &quot;nom d&rsquo;usager&quot;. Par cons&eacute;quent, et du fait d&rsquo;une longue histoire de probl&egrave;mes quand des h&ocirc;tes interm&eacute;diaires ont essay&eacute; d&rsquo;optimiser le transport en les modifiant, la partie locale ne DOIT &ecirc;tre interpr&eacute;t&eacute;e et recevoir une s&eacute;mantique que par l&rsquo;h&ocirc;te sp&eacute;cifi&eacute; dans la partie domaine de l&rsquo;adresse. </p>
<h3><a name="_Toc186287722"></a><a name="_Toc186079748"> 2.3.11 R&eacute;ponse</a></h3>
<p> Une r&eacute;ponse SMTP est un accus&eacute; de r&eacute;ception (positif ou n&eacute;gatif) envoy&eacute; du receveur &agrave; l&rsquo;envoyeur via le canal de transmission en r&eacute;ponse &agrave; une commande. La forme g&eacute;n&eacute;rale d&rsquo;une r&eacute;ponse est un code num&eacute;rique d&rsquo;ach&egrave;vement (indiquant &eacute;chec ou succ&egrave;s) habituellement suivi d&rsquo;une cha&icirc;ne de texte. Les codes sont &agrave; utiliser par des programmes et le texte est normalement destin&eacute; &agrave; l&rsquo;utilisateur humain. Des travaux r&eacute;cents [34] ont sp&eacute;cifi&eacute; une &eacute;volution de la structure des cha&icirc;nes de r&eacute;ponses, incluant l&rsquo;utilisation de codes d&rsquo;ach&egrave;vement suppl&eacute;mentaires et plus sp&eacute;cifiques. </p>
<h2><a name="_Toc186287723"></a><a name="_Toc186079865"></a><a name="_Toc186079749"> 2.4 Principes g&eacute;n&eacute;raux de syntaxe et mod&egrave;le de transaction</a></h2>
<p> Les commandes SMTP et les r&eacute;ponses ont une syntaxe rigide. Toutes les commandes commencent par un verbe de commande. Toutes les r&eacute;ponses commencent par un code num&eacute;rique &agrave; trois chiffres. Dans certaines commandes et r&eacute;ponses, les arguments DOIVENT suivre le verbe ou code de r&eacute;ponse. Certaines commandes n&rsquo;acceptent pas d&rsquo;argument (apr&egrave;s le verbe), et certains codes de r&eacute;ponse sont suivis, parfois de fa&ccedil;on facultative, par du texte en forme libre. Dans les deux cas, lorsque du texte appara&icirc;t, il est s&eacute;par&eacute; du verbe ou code de r&eacute;ponse par un caract&egrave;re espace. Les d&eacute;finitions compl&egrave;tes des commandes et r&eacute;ponses figurent &agrave; la Section 4. </p>
<p>Les valeurs des verbes et d&rsquo;arguments (par exemple, &quot;TO:&quot; ou &quot;to:&quot; dans la commande RCPT et les mots cl&eacute;s de nom d&rsquo;extension) ne sont pas sensibles &agrave; la casse, avec la seule exception dans la pr&eacute;sente sp&eacute;cification de la partie locale d&rsquo;une bo&icirc;te &agrave; lettres (les extensions SMTP peuvent explicitement sp&eacute;cifier des &eacute;l&eacute;ments sensibles &agrave; la casse). C&rsquo;est &agrave; dire qu&rsquo;un verbe de commande, une valeur d&rsquo;argument autre qu&rsquo;une partie locale de bo&icirc;te &agrave; lettre, et du texte de forme libre PEUVENT &ecirc;tre cod&eacute;s en majuscule, en minuscule ou tout m&eacute;lange de majuscules et minuscules sans impact sur leur signification. Cela N&rsquo;EST PAS vrai de la partie locale d&rsquo;une bo&icirc;te &agrave; lettres. La partie locale d&rsquo;une bo&icirc;te &agrave; lettres DOIT &ecirc;tre trait&eacute;e comme sensible &agrave; la casse. Donc, les mises en &oelig;uvre SMTP DOIVENT veiller &agrave; pr&eacute;server la casse des parties locales des bo&icirc;tes &agrave; lettres. Les domaines de bo&icirc;te &agrave; lettre ne sont pas sensibles &agrave; la casse. En particulier, pour certains h&ocirc;tes, l&rsquo;usager &quot;smith&quot; est diff&eacute;rent de l&rsquo;usager &quot;Smith&quot;. Cependant, l&rsquo;exploitation de la sensibilit&eacute; &agrave; la casse de la partie locale des bo&icirc;tes &agrave; lettres entrave l&rsquo;interop&eacute;rabilit&eacute; et est d&eacute;conseill&eacute;e. </p>
<p>Quelques serveurs SMTP, en violation de la pr&eacute;sente sp&eacute;cification (et de la RFC 821) exigent que les verbes de commande soient cod&eacute;s par les clients en majuscules. Les mises en &oelig;uvre PEUVENT souhaiter employer ce codage pour arranger ces serveurs. </p>
<p>Le champ argument consiste en une cha&icirc;ne de caract&egrave;res de longueur variable qui se termine &agrave; la fin de la ligne, c&rsquo;est-&agrave;-dire, avec la s&eacute;quence de caract&egrave;res &lt;CRLF&gt;. Le receveur ne fera rien tant que cette s&eacute;quence n&rsquo;est pas re&ccedil;ue. </p>
<p>La syntaxe de chaque commande figure avec l&rsquo;expos&eacute; sur cette commande. Les &eacute;l&eacute;ments et param&egrave;tres communs figurent au paragraphe 4.1.2. </p>
<p>Les commandes et r&eacute;ponses se composent de caract&egrave;res provenant du jeu de caract&egrave;res ASCII [1]. Lorsque le service de transport fournit un canal de transmission &agrave; octets de 8 bits, chaque caract&egrave;re de 7 bits est transmis justifi&eacute; &agrave; droite dans un octet avec le bit de plus fort poids (de gauche) mis &agrave; z&eacute;ro. Plus pr&eacute;cis&eacute;ment, le service SMTP sans extension ne fournit que sept bits de transport. Un client SMTP d&rsquo;origine qui n&rsquo;a pas r&eacute;ussi &agrave; n&eacute;gocier une extension appropri&eacute;e avec un serveur particulier NE DOIT PAS transmettre des messages avec les informations dans des octets &agrave; ordre sup&eacute;rieur binaire. Si de tels messages sont transmis en violation de cette r&egrave;gle, les serveurs SMTP qui re&ccedil;oivent PEUVENT effacer le bit d&rsquo;ordre sup&eacute;rieur ou rejeter le message comme invalide. En g&eacute;n&eacute;ral, un relais SMTP DEVRAIT supposer que le contenu du message qu&rsquo;il a re&ccedil;u est valide et, en supposant que l&rsquo;enveloppe permette de le faire, le relayer sans inspecter ce contenu. Bien s&ucirc;r, si le contenu est mal marqu&eacute; et si le chemin de donn&eacute;es ne peut pas accepter le contenu r&eacute;el, il peut en r&eacute;sulter la livraison finale d&rsquo;un message s&eacute;v&egrave;rement embrouill&eacute; au receveur. Les syst&egrave;mes de livraison SMTP PEUVENT rejeter (&quot;refuser&quot;) de tels messages plut&ocirc;t que de les livrer. Aucun syst&egrave;me SMTP d&rsquo;envoi n&rsquo;est autoris&eacute; &agrave; envoyer des commandes d&rsquo;enveloppe dans un jeu de caract&egrave;res autre que US-ASCII ; les syst&egrave;mes de r&eacute;ception DEVRAIENT rejeter de telles commandes, en utilisant normalement des r&eacute;ponses &quot;500 erreur de syntaxe - caract&egrave;re invalide&quot;. </p>
<p>La transmission d&rsquo;un contenu de message &agrave; 8 bits PEUT &ecirc;tre demand&eacute;e au serveur par un client en utilisant les facilit&eacute;s de SMTP &eacute;tendu, notamment l&rsquo;extension &quot;8BITMIME&quot; [20]. 8BITMIME DEVRAIT &ecirc;tre accept&eacute;e par les serveurs SMTP. Cependant, elle NE DOIT PAS &ecirc;tre vue comme l&rsquo;autorisation de transmettre sans restriction du mat&eacute;riel &agrave; huit bits. 8BITMIME NE DOIT PAS &ecirc;tre demand&eacute; par l&rsquo;envoyeur pour un mat&eacute;riau &agrave; huit bits qui n&rsquo;est pas en format MIME avec un codage appropri&eacute; de transfert de contenu ; les serveurs PEUVENT rejeter de tels messages. </p>
<p>La notation m&eacute;talinguistique utilis&eacute;e dans le pr&eacute;sent document correspond au &quot;BNF augment&eacute;&quot; utilis&eacute; dans d&rsquo;autres documents du syst&egrave;me de messagerie Internet. Le lecteur qui n&rsquo;est pas familiaris&eacute; avec cette syntaxe devrait consulter la sp&eacute;cification ABNF [8]. Les termes du m&eacute;talangage utilis&eacute; dans le texte courant sont entour&eacute;s de crochets angulaires (par exemple, &lt;CRLF&gt;) pour plus de clart&eacute;. </p>
<p>&nbsp;</p>
<h1><a name="_Toc186287724"></a><a name="_Toc186079866"></a><a name="_Toc186079750"> 3 Proc&eacute;dures SMTP : g&eacute;n&eacute;ralit&eacute;s</a></h1>
<p>La pr&eacute;sente section contient la description des proc&eacute;dures utilis&eacute;es dans SMTP : initiation de session, transaction de messagerie, transmission de message, v&eacute;rification des noms de bo&icirc;te &agrave; lettres et d&eacute;veloppement des listes de diffusion de messagerie, ouverture et fermeture des &eacute;changes. Des commentaires sur le relais, une note sur les domaines de messagerie, et une discussion sur les changements de r&ocirc;les sont inclus &agrave; la fin de la section. Plusieurs sc&eacute;narios complets sont pr&eacute;sent&eacute;s &agrave; l&rsquo;appendice D. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287725"></a><a name="_Toc186079867"></a><a name="_Toc186079751"> 3.1 Initiation de session</a></h2>
<p> Une session SMTP est initi&eacute;e quand un client ouvre une connexion avec un serveur et que le serveur r&eacute;pond par un message d&rsquo;ouverture. </p>
<p>Les mises en &oelig;uvre de serveur SMTP PEUVENT inclure l&rsquo;identification de leurs informations de logiciel et de version dans la r&eacute;ponse d&rsquo;accueil de connexion apr&egrave;s le code 220, pratique qui permet un isolement et une r&eacute;paration plus efficaces de tous probl&egrave;mes. Les mises en &oelig;uvre PEUVENT prendre des dispositions pour que les serveurs SMTP d&eacute;sactivent l&rsquo;annonce de logiciel et de version lorsque cela cause des probl&egrave;mes de s&eacute;curit&eacute;. Bien que certains syst&egrave;mes identifient aussi leur point de contact pour les probl&egrave;mes de messagerie, cela ne peut se substituer &agrave; la fourniture exig&eacute;e de l&rsquo;adresse du &quot;ma&icirc;tre de poste&quot; (voir au paragraphe 4.5.1). </p>
<p>Le protocole SMTP permet &agrave; un serveur de rejeter formellement une transaction tout en permettant comme suit la connexion initiale : une r&eacute;ponse 554 PEUT &ecirc;tre donn&eacute;e dans le message initial d&rsquo;ouverture de la connexion au lieu de la r&eacute;ponse 220. Un serveur qui adopte cette approche DOIT quand m&ecirc;me attendre que le client envoie un QUIT (voir au paragraphe 4.1.1.10) avant de clore la connexion et DEVRAIT r&eacute;pondre &agrave; toute commande qui interviendrait par &quot;503 Mauvaise s&eacute;quence de commandes&quot;. Comme une tentative d&rsquo;&eacute;tablir une connexion SMTP avec un tel syst&egrave;me est probablement une erreur, un serveur qui retourne une r&eacute;ponse 554 &agrave; l&rsquo;ouverture d&rsquo;une connexion DEVRAIT fournir assez d&rsquo;informations dans le texte de r&eacute;ponse pour faciliter la correction d&rsquo;erreur sur le syst&egrave;me d&rsquo;envoi. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287726"></a><a name="_Toc186079868"></a><a name="_Toc186079752"> 3.2 Initiation du client</a></h2>
<p> Une fois que le serveur a envoy&eacute; le message d&rsquo;accueil et que le client l&rsquo;a re&ccedil;u, le client envoie normalement la commande EHLO au serveur, qui indique l&rsquo;identit&eacute; du client. En plus de l&rsquo;ouverture de la session, l&rsquo;utilisation du EHLO indique que le client est capable de traiter les extensions de service et demande que le serveur fournisse une liste des extensions qu&rsquo;il accepte. Les plus anciens syst&egrave;mes SMTP qui ne sont pas capables de prendre en charge les extensions de service et les clients actuels qui ne demandent pas d&rsquo;extension de service dans la session de messagerie initialis&eacute;e PEUVENT utiliser HELO &agrave; la place de EHLO. Les serveurs NE DOIVENT PAS retourner la r&eacute;ponse de style EHLO &eacute;tendu &agrave; une commande HELO. Pour un essai de connexion particulier, si le serveur retourne une r&eacute;ponse &quot;commande non reconnue&quot; &agrave; EHLO, le client DEVRAIT &ecirc;tre capable de se replier sur l&rsquo;envoi de HELO. </p>
<p>Dans la commande EHLO, l&rsquo;h&ocirc;te qui envoie la commande s&rsquo;identifie ; la commande peut &ecirc;tre interpr&eacute;t&eacute;e comme disant &quot;Hello, je suis &lt;domaine&gt;&quot; (et, dans le cas de EHLO, &quot;et je prend en charge les demandes d&rsquo;extension de service&quot;). </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287727"></a><a name="_Toc186079869"></a><a name="_Toc186079753"> 3.3 Transactions de messagerie</a></h2>
<p> Il y a trois &eacute;tapes pour les transactions de messagerie SMTP. La transaction d&eacute;bute par une commande MAIL qui donne l&rsquo;identification de l&rsquo;envoyeur. (En g&eacute;n&eacute;ral, la commande MAIL ne peut &ecirc;tre envoy&eacute;e que quand aucune transaction de messagerie n&rsquo;est en cours&nbsp;; voir au paragraphe 4.1.4.) Une s&eacute;rie d&rsquo;une ou plusieurs commandes RCPT suit, qui donne les informations sur le receveur. Puis une commande DATA initialise le transfert des donn&eacute;es de messagerie et se termine par l&rsquo;indicateur &quot;fin de message&quot;, qui confirme aussi la transaction. </p>
<p>La premi&egrave;re &eacute;tape de la proc&eacute;dure est la commande MAIL. </p>
<p>MAIL FROM:&lt;chemin inverse&gt; [SP &lt;param&egrave;tres de message&gt; ] &lt;CRLF&gt; </p>
<p>Cette commande dit au receveur SMTP qu&rsquo;une nouvelle transaction de messagerie d&eacute;bute et de remettre &agrave; z&eacute;ro tous ses tableaux d&rsquo;&eacute;tat et ses m&eacute;moires tampon, y compris toutes donn&eacute;es de r&eacute;ception ou de messagerie. La portion &lt;chemin inverse&gt; du premier ou seul argument contient la bo&icirc;te &agrave; lettres de source (entre les crochet &quot;&lt;&quot; et &quot;&gt;&quot;), qui peut &ecirc;tre utilis&eacute;e pour rapporter des erreurs (voir au paragraphe 4.2 l&rsquo;expos&eacute; sur le rapport d&rsquo;erreur). S&rsquo;il accepte, le serveur SMTP retourne une r&eacute;ponse 250 OK. Si la sp&eacute;cification de la bo&icirc;te &agrave; lettre n&rsquo;est pas acceptable pour une raison quelconque, le serveur DOIT retourner une r&eacute;ponse qui indique si la d&eacute;faillance est permanente (c&rsquo;est-&agrave;-dire, se produira &agrave; nouveau si le client essaye encore la m&ecirc;me adresse) ou temporaire (c&rsquo;est-&agrave;-dire, l&rsquo;adresse pourrait &ecirc;tre accept&eacute;e si le client r&eacute;essaye plus tard). En d&eacute;pit de la port&eacute;e apparente de cette exigence, il y a des circonstances dans lesquelles l&rsquo;acceptabilit&eacute; du chemin inverse ne peut pas &ecirc;tre d&eacute;termin&eacute;e jusqu&rsquo;&agrave; ce qu&rsquo;un ou plusieurs chemins de retour (dans les commandes RCPT) puissent &ecirc;tre examin&eacute;s. Dans de tels cas, le serveur PEUT raisonnablement accepter le chemin inverse (avec une r&eacute;ponse 250) et rapporter les probl&egrave;mes apr&egrave;s la r&eacute;ception et l&rsquo;examen des chemins de retour. Normalement, les d&eacute;faillances produisent des r&eacute;ponses 550 ou 553. </p>
<p>Historiquement, le &lt;chemin-inverse&gt; peut contenir plus d&rsquo;une bo&icirc;te &agrave; lettres, cependant, les syst&egrave;mes contemporains NE DEVRAIT PAS utiliser l&rsquo;acheminement de source (voir l&rsquo;appendice C). </p>
<p>Le &lt;param&egrave;tres de messagerie&gt; facultatif est associ&eacute; aux extensions de service SMTP n&eacute;goci&eacute;es (voir au paragraphe 2.2). </p>
<p>La seconde &eacute;tape de la proc&eacute;dure est la commande RCPT. </p>
<p>RCPT TO:&lt;chemin-de-retour&gt; [ SP &lt;param&egrave;tres-rcpt&gt; ] &lt;CRLF&gt; </p>
<p>Le premier ou seul argument pour cette commande inclut un chemin de retour (normalement une bo&icirc;te &agrave; lettres et un domaine, toujours entour&eacute;s de crochets &quot;&lt;&quot; et &quot;&gt;&quot;) identifiant un receveur. S&rsquo;il l&rsquo;accepte, le serveur SMTP retourne une r&eacute;ponse 250 OK et m&eacute;morise le chemin de retour. Si le receveur est connu pour n&rsquo;&ecirc;tre pas une adresse de livraison, le serveur SMTP retourne une r&eacute;ponse 550, normalement avec une cha&icirc;ne du genre &quot;usager inconnu&quot; et le nom de la bo&icirc;te &agrave; lettres (d&rsquo;autres circonstances et codes de r&eacute;ponse sont possibles). Cette &eacute;tape de la proc&eacute;dure peut &ecirc;tre r&eacute;p&eacute;t&eacute;e sans limitations. </p>
<p>Le &lt;chemin-de-retour&gt; peut contenir plus qu&rsquo;une seule bo&icirc;te &agrave; lettres. Dans le pass&eacute;, le &lt;chemin-de-retour&gt; pouvait &ecirc;tre une liste d&rsquo;acheminements de source des h&ocirc;tes et des bo&icirc;tes &agrave; lettres de destination, cependant, les client SMTP contemporains NE DEVRAIENT PAS utiliser les routes de source (voir l&rsquo;appendice C). Les serveurs DOIVENT &ecirc;tre pr&ecirc;ts &agrave; rencontrer une liste des routes de source dans le chemin de retour, mais DEVRAIENT ignorer les routes ou PEUVENT d&eacute;cliner la prise en charge du relais qu&rsquo;elles impliquent. De m&ecirc;me, les serveurs PEUVENT refuser d&rsquo;accepter les messages destin&eacute;s &agrave; d&rsquo;autres h&ocirc;tes ou syst&egrave;mes. Ces restrictions rendent un serveur sans utilit&eacute; comme relais pour les clients qui ne prennent pas en charge la pleine fonctionnalit&eacute; SMTP. Par cons&eacute;quent, les clients &agrave; capacit&eacute;s restreintes NE DOIVENT PAS supposer que tout serveur SMTP sur l&rsquo;Internet peut &ecirc;tre utilis&eacute; comme site de traitement (relais) de messagerie. Si une commande RCPT appara&icirc;t sans une commande MAIL ant&eacute;rieure, le serveur DOIT retourner une r&eacute;ponse 503 &quot;Mauvaise s&eacute;quence de commandes&quot;. Le &lt;param&egrave;tres-rcpt&gt; facultatif est associ&eacute; aux extensions de service SMTP n&eacute;goci&eacute;es (voir au paragraphe 2.2). </p>
<p>La troisi&egrave;me &eacute;tape de la proc&eacute;dure est la commande DATA (ou une solution de remplacement sp&eacute;cifi&eacute;e dans une extension de service). </p>
<p>DATA &lt;CRLF&gt; </p>
<p>S&rsquo;il accepte, le serveur SMTP retourne une r&eacute;ponse interm&eacute;diaire 354 et consid&egrave;re toutes les lignes suivantes jusqu&rsquo;&agrave; la fin de l&rsquo;indicateur de donn&eacute;es de messagerie, non inclus, comme le texte du message. Quand la fin du texte est bien re&ccedil;ue et m&eacute;moris&eacute;e, le receveur SMTP envoie une r&eacute;ponse 250 OK. </p>
<p>Comme les donn&eacute;es de messagerie sont envoy&eacute;es sur le canal de transmission, la fin des donn&eacute;es de messagerie doit &ecirc;tre indiqu&eacute;e de fa&ccedil;on que le dialogue de commandes et r&eacute;ponses puisse se terminer. SMTP indique la fin des donn&eacute;es de message en envoyant une ligne contenant seulement un &quot;.&quot; (point). Une proc&eacute;dure transparente est utilis&eacute;e pour emp&ecirc;cher l&rsquo;interf&eacute;rence avec le texte de l&rsquo;utilisateur (voir au paragraphe 4.5.2). </p>
<p>La fin de l&rsquo;indicateur de donn&eacute;es de messagerie confirme aussi la transaction de messagerie et dit au serveur SMTP de traiter maintenant les donn&eacute;es m&eacute;moris&eacute;es de receveur et messagerie. S&rsquo;il accepte, le serveur SMTP retourne une r&eacute;ponse 250 OK. La commande DATA ne peut &eacute;chouer qu&rsquo;en deux points de l&rsquo;&eacute;change de protocole : </p>
<p> - S&rsquo;il n&rsquo;y avait pas de commande MAIL, ou pas de RCPT, ou si toutes ces commandes ont &eacute;t&eacute; rejet&eacute;es, le serveur PEUT retourner une r&eacute;ponse &quot;commande hors s&eacute;quence&quot; (503) ou &quot;pas de receveur valide&quot; (554) en r&eacute;ponse &agrave; la commande DATA. Si une de ces r&eacute;ponses (ou toute autre r&eacute;ponse 5yz) est re&ccedil;ue, le client NE DOIT PAS envoyer les donn&eacute;es du message ; plus g&eacute;n&eacute;ralement, les donn&eacute;es de message NE DOIVENT PAS &ecirc;tre envoy&eacute;es en dehors de la r&eacute;ception d&rsquo;une r&eacute;ponse 354. </p>
<p> - Si le verbe est initialement accept&eacute; et la r&eacute;ponse 354 produite, la commande DATA ne devrait &eacute;chouer que si la transaction de messagerie est incompl&egrave;te (par exemple, pas de receveur), ou si les ressources sont indisponibles (y compris, bien s&ucirc;r, si le serveur devient inopin&eacute;ment indisponible), ou si le serveur d&eacute;termine que le message devrait &ecirc;tre rejet&eacute; pour des raisons de politique ou autre. </p>
<p>Cependant, en pratique, certains des serveurs n&rsquo;effectuent pas de v&eacute;rification du receveur avant la r&eacute;ception du texte du message. Ces serveurs DEVRAIENT traiter une d&eacute;faillance pour un ou plusieurs receveurs comme une &quot;d&eacute;faillance ult&eacute;rieure&quot; et retourner un message comme expos&eacute; &agrave; la section 6. Utiliser un code de r&eacute;ponse &quot;550 bo&icirc;te &agrave; lettre introuvable&quot; (ou &eacute;quivalent) apr&egrave;s l&rsquo;acceptation des donn&eacute;es rend difficile ou impossible pour le client de d&eacute;terminer quel r&eacute;cepteur a fait d&eacute;faut. </p>
<p>Lorsque le format de la RFC 822 [7, 32] est utilis&eacute;, les donn&eacute;es de messagerie comportent les &eacute;l&eacute;ments d&rsquo;en-t&ecirc;te de m&eacute;mo tels que Date, Sujet, To, Cc, From. Les syst&egrave;mes de serveur SMTP NE DEVRAIENT PAS rejeter de messages sur la base de d&eacute;fauts de l&rsquo;en-t&ecirc;te de message ou du corps de message par rapport &agrave; la RFC 822 ou MIME [12]. En particulier, ils NE DOIVENT PAS rejeter les messages dans lesquels les num&eacute;ros des champs Resent ne correspondent pas ou dans lesquels Resent-to appara&icirc;t sans Resent-from et/ou Resent-date. </p>
<p>Les commandes de transaction de messagerie DOIVENT &ecirc;tre utilis&eacute;es dans l&rsquo;ordre expos&eacute; ci-dessus. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287728"></a><a name="_Toc186079870"></a><a name="_Toc186079754"> 3.4 Transmission de correction d&rsquo;adresse ou de mise &agrave; jour</a></h2>
<p> La prise en charge de la transmission est exig&eacute;e le plus souvent pour confirmer et simplifier les adresses au sein de, ou par rapport &agrave; une entreprise et moins fr&eacute;quemment pour &eacute;tablir des adresses &agrave; relier l&rsquo;adresse pr&eacute;c&eacute;dente d&rsquo;une personne avec l&rsquo;adresse actuelle. La transmission silencieuse des messages (sans notification du serveur &agrave; l&rsquo;envoyeur), pour des raisons de s&eacute;curit&eacute; ou de non divulgation, est courante dans l&rsquo;Internet contemporain. </p>
<p>Aussi bien dans le cas de l&rsquo;entreprise que de la &quot;nouvelle adresse&quot;, des consid&eacute;rations touchant &agrave; la dissimulation des informations (et parfois &agrave; la s&eacute;curit&eacute;) militent contre l&rsquo;exposition de l&rsquo;adresse &quot;finale&quot; &agrave; travers le protocole SMTP comme un effet secondaire de l&rsquo;activit&eacute; de transmission. Cela peut &ecirc;tre particuli&egrave;rement important lorsque l&rsquo;adresse finale ne peut pas &ecirc;tre atteinte m&ecirc;me par l&rsquo;envoyeur. Par cons&eacute;quent, les m&eacute;canismes de &quot;transmission&quot; d&eacute;crits au paragraphe 3.2 de la RFC 821, et en particulier les codes de r&eacute;ponse 251 (destination corrig&eacute;e) et 551 provenant de RCPT doivent &ecirc;tre &eacute;valu&eacute;s avec soin par les d&eacute;veloppeurs et, quand ils sont disponibles, par ceux qui configurent les syst&egrave;mes. </p>
<p>En particulier : <br>
* Les serveurs PEUVENT transmettre les messages lorsqu&rsquo;ils sont au courant d&rsquo;un changement d&rsquo;adresse. Lorsqu&rsquo;ils le font, ils PEUVENT fournir des informations de mise &agrave; jour d&rsquo;adresse avec un code 251, ou bien transmettre &quot;en silence&quot; et retourner un code 250. Mais, si un code 251 est utilis&eacute;, ils NE DOIVENT PAS supposer que le client va r&eacute;ellement mettre &agrave; jour les informations d&rsquo;adresse ou m&ecirc;me retourner ces informations &agrave; l&rsquo;usager. </p>
<p> Autrement, <br>
* Les serveurs PEUVENT rejeter ou faire rebondir les messages quand ils ne sont pas livrables lors de l&rsquo;envoi. Quand c&rsquo;est le cas, ils PEUVENT soit fournir des informations de mise &agrave; jour d&rsquo;adresse avec un code 551, soit rejeter le message comme non d&eacute;livrable avec un code 550 et pas d&rsquo;informations sp&eacute;cifiques de l&rsquo;adresse. Mais, si un code 551 est utilis&eacute;, ils NE DOIVENT PAS supposer que le client va r&eacute;ellement mettre &agrave; jour les informations d&rsquo;adresse ou m&ecirc;me retourner ces informations &agrave; l&rsquo;usager. </p>
<p>Les mises en &oelig;uvre de serveur SMTP qui prennent en charge les codes de r&eacute;ponse 251 et/ou 551 sont vivement encourag&eacute;es &agrave; fournir des m&eacute;canismes de configuration faisant en sorte que les sites qui penseraient qu&rsquo;ils vont malencontreusement divulguer des informations puissent d&eacute;sactiver ou restreindre leur utilisation. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287729"></a><a name="_Toc186079871"></a><a name="_Toc186079755"> 3.5 Commandes pour le d&eacute;bogage d&rsquo;adresses</a></h2>
<h3><a name="_Toc186287730"></a><a name="_Toc186079756"> 3.5.1 G&eacute;n&eacute;ralit&eacute;s</a></h3>
<p> SMTP fournit des commandes pour v&eacute;rifier un nom d&rsquo;utilisateur ou obtenir le contenu d&rsquo;une liste de diffusion. Ceci est fait avec les commandes VRFY et EXPN, qui ont des arguments de cha&icirc;ne de caract&egrave;res. Les mises en &oelig;uvre DEVRAIENT prendre en charge VRFY et EXPN (cependant, voir les paragraphes 3.5.2 et 7.3). </p>
<p>Pour la commande VRFY, la cha&icirc;ne est un nom d&rsquo;utilisateur ou un nom d&rsquo;utilisateur et un domaine (voir ci-dessous). Si une r&eacute;ponse normale (c&rsquo;est-&agrave;-dire, 250) est retourn&eacute;e, la r&eacute;ponse PEUT inclure le nom d&rsquo;utilisateur complet et DOIT inclure la bo&icirc;te &agrave; lettres de l&rsquo;utilisateur. Elle DOIT &ecirc;tre de l&rsquo;une des formes suivantes : <br>
Nom-d&rsquo;utilisateur &lt;partie-locale@domaine&gt; <br>
partie-locale@domaine </p>
<p>Lorsque un nom qui est l&rsquo;argument de VRFY pourrait identifier plus d&rsquo;une bo&icirc;te &agrave; lettres, le serveur PEUT noter l&rsquo;ambigu&iuml;t&eacute; ou identifier les alternatives. En d&rsquo;autres termes, toutes les r&eacute;ponses suivantes sont l&eacute;gitimes pour VRFY :<br>
553 Usager ambigu <br>
ou <br>
553- Ambigu ; les possibilit&eacute;s sont <br>
553-Joe Smith &lt;jsmith@foo.com&gt; <br>
553-Harry Smith &lt;hsmith@foo.com&gt; <br>
553 Melvin Smith &lt;dweep@foo.com&gt; </p>
<p> ou <br>
553- Ambigu ; possibilit&eacute;s <br>
553- &lt;jsmith@foo.com&gt; <br>
553- &lt;hsmith@foo.com&gt; <br>
553 &lt;dweep@foo.com&gt; </p>
<p>Dans des circonstances normales, un client qui re&ccedil;oit une r&eacute;ponse 553 serait suppos&eacute; exposer les r&eacute;sultats &agrave; l&rsquo;usager. L&rsquo;utilisation des formes exactes donn&eacute;es, et les mots cl&eacute;s &quot;usager ambigu&quot; ou &quot;ambigu&quot;, &eacute;ventuellement accompagn&eacute;s des codes de r&eacute;ponse &eacute;tendus tels que ceux d&eacute;crits en [34], va faciliter la traduction automatique dans d&rsquo;autres langues en tant que de besoin. Bien s&ucirc;r, un client tr&egrave;s automatis&eacute; ou qui fonctionne dans une autre langue que l&rsquo;anglais, peut choisir d&rsquo;essayer de traduire la r&eacute;ponse, pour retourner &agrave; l&rsquo;usager d&rsquo;autres indications que le texte litt&eacute;ral de la r&eacute;ponse, ou prendre une action automatique comme de consulter un service d&rsquo;annuaire pour des informations suppl&eacute;mentaires avant de faire rapport &agrave; l&rsquo;usager. </p>
<p>Pour la commande EXPN, la cha&icirc;ne identifie une liste de diffusion, et la r&eacute;ponse multi ligne de succ&egrave;s (c&rsquo;est-&agrave;-dire, 250) PEUT inclure le nom complet des usagers et DOIT donner les bo&icirc;tes &agrave; lettres sur la liste de diffusion. </p>
<p>Dans certains h&ocirc;tes, la distinction entre une liste de diffusion et un alias pour une seule bo&icirc;te &agrave; lettres est un peu confuse, car une structure de donn&eacute;es commune peut d&eacute;tenir les deux types d&rsquo;entr&eacute;es, et il est possible d&rsquo;avoir des listes de diffusion qui ne contiennent qu&rsquo;une seule bo&icirc;te &agrave; lettres. Si on fait une demande d&rsquo;application de VRFY &agrave; une liste de diffusion, une r&eacute;ponse positive PEUT &ecirc;tre donn&eacute;e si un message ainsi adress&eacute; sera livr&eacute; &agrave; chacun de la liste&nbsp;; autrement, une erreur DEVRAIT &ecirc;tre rapport&eacute;e (par exemple, &quot;550 C&rsquo;est une liste de diffusion, pas un usager&quot; ou &quot;252 Incapable de v&eacute;rifier les membres de la liste de diffusion&quot;). Si on fait une demande d&rsquo;expansion d&rsquo;un nom d&rsquo;utilisateur, le serveur PEUT retourner une r&eacute;ponse positive consistant en une liste ne contenant qu&rsquo;un nom, ou PEUT rapporter une erreur (par exemple, &quot;550 C&rsquo;est un nom d&rsquo;usager, pas une liste de diffusion&quot;). </p>
<p>Dans le cas de r&eacute;ponse multi ligne de succ&egrave;s (normal pour EXPN) exactement une bo&icirc;te &agrave; lettres est &agrave; sp&eacute;cifier sur chaque ligne de la r&eacute;ponse. Le cas d&rsquo;une demande ambigu&euml; est expos&eacute; plus haut. </p>
<p>&quot;Nom d&rsquo;utilisateur&quot; est un terme flou et a &eacute;t&eacute; utilis&eacute; d&eacute;lib&eacute;r&eacute;ment. Une mise en &oelig;uvre des commandes VRFY ou EXPN DOIT inclure au moins la reconnaissance des bo&icirc;tes &agrave; lettres locales comme &quot;noms d&rsquo;utilisateur&quot;. Cependant, comme la pratique habituelle de l&rsquo;Internet r&eacute;sulte souvent en un seul h&ocirc;te traitant la messagerie pour plusieurs domaines, les h&ocirc;tes, et particuli&egrave;rement les h&ocirc;tes qui fournissent cette fonctionnalit&eacute;, DEVRAIENT accepter la forme &quot;partie-locale@domaine&quot; comme un &quot;nom d&rsquo;utilisateur&quot; ; les h&ocirc;tes PEUVENT aussi choisir de reconna&icirc;tre d&rsquo;autres cha&icirc;nes comme &quot;noms d&rsquo;utilisateur&quot;. </p>
<p>Le cas de l&rsquo;expansion d&rsquo;une liste de bo&icirc;tes &agrave; lettres exige une r&eacute;ponse multi ligne, telle que :<br>
C: EXPN Example-People <br>
S: 250-Jon Postel &lt;Postel@isi.edu&gt; <br>
S: 250-Fred Fonebone &lt;Fonebone@physics.foo-u.edu&gt; <br>
S: 250 Sam Q. Smith &lt;SQSmith@specific.generic.com&gt; </p>
<p>ou <br>
C: EXPN Executive-Washroom-List <br>
S: 550 Acc&egrave;s refus&eacute;. </p>
<p>Les arguments de la cha&icirc;ne de caract&egrave;res des commandes VRFY et EXPN ne peuvent pas &ecirc;tre plus contraints du fait de la diversit&eacute; des mises en &oelig;uvre des concepts de nom d&rsquo;utilisateur et de liste de diffusion. Dans certains syst&egrave;mes il peut &ecirc;tre appropri&eacute; pour l&rsquo;argument de la commande EXPN d&rsquo;&ecirc;tre un nom de fichier pour un fichier contenant une liste de diffusion, mais il y a aussi une grande diversit&eacute; de conventions de nommage dans l&rsquo;Internet. De m&ecirc;me, les variations historiques dans ce qui est retourn&eacute; par ces commandes sont telles que la r&eacute;ponse DEVRAIT &ecirc;tre interpr&eacute;t&eacute;e avec une grande prudence, si elle doit l&rsquo;&ecirc;tre, et ne DEVRAIT en g&eacute;n&eacute;ral &ecirc;tre utilis&eacute; que pour des diagnostics. </p>
<h3><a name="_Toc186287731"></a><a name="_Toc186079757"> 3.5.2 R&eacute;ponse normale VRFY</a></h3>
<p> Lorsque des r&eacute;ponses normales (2yz ou 551) sont retourn&eacute;es d&rsquo;une demande VRFY ou EXPN, la r&eacute;ponse comporte normalement le nom de la bo&icirc;te &agrave; lettres, c&rsquo;est-&agrave;-dire que &quot;&lt;partie-locale@domaine&gt;&quot;, o&ugrave; &quot;domaine&quot; est un nom de domaine pleinement qualifi&eacute;, DOIT appara&icirc;tre dans la syntaxe. Dans des circonstances suffisamment exceptionnelles pour justifier la violation des intentions de la pr&eacute;sente sp&eacute;cification, du texte de forme libre PEUT &ecirc;tre retourn&eacute;. Afin de faciliter l&rsquo;analyse aussi bien par les ordinateurs que par les personnes, les adresses DEVRAIENT appara&icirc;tre entre des crochets angulaires. Lorsque les adresses sont retourn&eacute;es, plut&ocirc;t que des informations de correction d&rsquo;erreur de forme libre, EXPN et VRFY DOIVENT ne retourner que des adresses de domaine valides utilisables dans les commandes RCPT de SMTP. Par cons&eacute;quent, si une adresse implique la livraison &agrave; un programme ou autre syst&egrave;me, le nom de la bo&icirc;te &agrave; lettres utilis&eacute; pour atteindre cette cible DOIT &ecirc;tre donn&eacute;. Les chemins (routes de source explicites) NE DOIVENT PAS &ecirc;tre retourn&eacute;s par VRFY ou EXPN. </p>
<p>Les mises en &oelig;uvre de serveur DEVRAIENT accepter aussi bien VRFY que EXPN. Pour des raisons de s&eacute;curit&eacute;, les mises en &oelig;uvre PEUVENT fournir &agrave; des installations locales un moyen de d&eacute;sactiver l&rsquo;une ou/et l&rsquo;autre de ces commandes par des options de configuration ou &eacute;quivalent. Lorsque ces commandes sont accept&eacute;es, il n&rsquo;est pas oblig&eacute; qu&rsquo;elles fonctionnent &agrave; travers les relais lorsque le relais est pris en charge. Comme elles &eacute;taient toutes deux facultatives dans la RFC 821, elles DOIVENT figurer dans la liste des extensions de service dans une r&eacute;ponse EHLO, si elles sont accept&eacute;es. </p>
<h3><a name="_Toc186287732"></a><a name="_Toc186079758"> 3.5.3 Signification de la r&eacute;ponse de succ&egrave;s VRFY ou EXPN</a></h3>
<p> Un serveur NE DOIT PAS retourner un code 250 en r&eacute;ponse &agrave; une commande VRFY ou EXPN tant qu&rsquo;il n&rsquo;a pas r&eacute;ellement v&eacute;rifi&eacute; l&rsquo;adresse. En particulier, un serveur NE DOIT PAS retourner 250 si tout ce qu&rsquo;il a fait a &eacute;t&eacute; de v&eacute;rifier que la syntaxe donn&eacute;e est valide. Dans ce cas, 502 (Commande non mise en &oelig;uvre) ou 500 (Erreur de syntaxe, commande non reconnue) DEVRAIT &ecirc;tre retourn&eacute;. Comme mentionn&eacute; ailleurs, la mise en &oelig;uvre (au sens de valider r&eacute;ellement les adresses et retourner les informations) de VRFY et EXPN est vivement recommand&eacute;e. Et donc, les mises en &oelig;uvre qui retournent 500 ou 502 pour VRFY ne sont pas en pleine conformit&eacute; avec la pr&eacute;sente sp&eacute;cification. </p>
<p>Il peut y avoir des circonstances dans lesquelles une adresse para&icirc;t &ecirc;tre valide mais ne peut raisonnablement &ecirc;tre v&eacute;rifi&eacute;e en temps r&eacute;el, en particulier lorsque un serveur agit comme &eacute;changeur de messagerie pour un autre serveur ou domaine. La &quot;validit&eacute; apparente&quot; devrait dans ce cas impliquer normalement au moins la v&eacute;rification de la syntaxe et pourrait comporter la v&eacute;rification que tous les domaines sp&eacute;cifi&eacute;s sont de ceux vers lesquels l&rsquo;h&ocirc;te s&rsquo;attend &agrave; &ecirc;tre capable de relayer du courrier. Dans ces situations, le code de r&eacute;ponse 252 DEVRAIT &ecirc;tre retourn&eacute;. Ces cas font un parall&egrave;le &agrave; l&rsquo;expos&eacute; sur la v&eacute;rification de RCPT au paragraphe 2.1. De m&ecirc;me, l&rsquo;expos&eacute; du paragraphe 3.4 s&rsquo;applique &agrave; l&rsquo;utilisation des codes de r&eacute;ponse 251 et 551 avec VRFY (et EXPN) pour indiquer les adresses qui sont reconnues mais qui feraient l&rsquo;objet d&rsquo;une retransmission ou d&rsquo;un rebond si du courrier &eacute;tait re&ccedil;u pour elles. Les mises en &oelig;uvre DEVRAIENT g&eacute;n&eacute;ralement &ecirc;tre plus agressives sur la v&eacute;rification d&rsquo;adresse dans le cas de VRFY que dans le cas de RCPT, m&ecirc;me si cela prend un peu plus longtemps pour le faire. </p>
<h3><a name="_Toc186287733"></a><a name="_Toc186079759"> 3.5.4 S&eacute;mantique et applications de EXPN</a></h3>
<p> EXPN est souvent tr&egrave;s utile pour corriger les erreurs et comprendre les probl&egrave;mes des listes de diffusion et des alias &agrave; plusieurs adresses cibles. Certains syst&egrave;mes ont essay&eacute; d&rsquo;utiliser l&rsquo;expansion de source des listes de diffusion comme moyen d&rsquo;&eacute;liminer les duplications. La propagation des syst&egrave;mes de nom d&rsquo;emprunt (alias) avec la messagerie sur l&rsquo;Internet, pour les h&ocirc;tes (normalement avec les enregistrements MX et CNAME DNS), pour les bo&icirc;tes &agrave; lettres (divers types d&rsquo;alias d&rsquo;h&ocirc;te local), et dans divers arrangements de mandataires, a rendu presque impossible le fonctionnement coh&eacute;rent de ces strat&eacute;gies, et les syst&egrave;mes de messagerie NE DEVRAIENT PAS les essayer. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287734"></a><a name="_Toc186079872"></a><a name="_Toc186079760"> 3.6 Domaines</a></h2>
<p> Seuls les noms de domaine pleinement qualifi&eacute;s (FQDN) solubles sont permis lorsque les noms de domaine sont utilis&eacute;s dans SMTP. En d&rsquo;autres termes, les noms qui peuvent se r&eacute;soudre en RR MX ou RR A (comme expos&eacute; &agrave; la section 5) sont permis, comme le sont les RR CNAME dont les cibles sont solubles en RR MX ou A. Les sobriquets locaux ou noms non qualifi&eacute;s NE DOIVENT PAS &ecirc;tre utilis&eacute;s. Il y a deux exceptions &agrave; la r&egrave;gle qui exige des FQDN : </p>
<p> - Le nom de domaine donn&eacute; dans la commande EHLO DOIT &ecirc;tre un nom principal d&rsquo;h&ocirc;te (nom de domaine qui se r&eacute;sout en RR A) ou, si l&rsquo;h&ocirc;te n&rsquo;a pas de nom, une adresse litt&eacute;rale comme d&eacute;crit au paragraphe 4.1.1.1. </p>
<p> - Le nom de bo&icirc;te &agrave; lettre r&eacute;serv&eacute; de &quot;postmaster&quot; peut &ecirc;tre utilis&eacute; dans une commande RCPT sans qualification de domaine (voir au paragraphe 4.1.1.3) et DOIT &ecirc;tre accept&eacute; s&rsquo;il est utilis&eacute; ainsi. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287735"></a><a name="_Toc186079873"></a><a name="_Toc186079761"> 3.7 Relais</a></h2>
<p> En g&eacute;n&eacute;ral, la disponibilit&eacute; des enregistrements de Mail eXchanger dans le syst&egrave;me de noms de domaine [22, 27] rend l&rsquo;utilisation de routes de source explicites inutile dans le syst&egrave;me de messagerie Internet. De nombreux probl&egrave;mes historiques de leur interpr&eacute;tation ont rendu leur utilisation ind&eacute;sirable. Les client SMTP NE DEVRAIENT PAS g&eacute;n&eacute;rer de routes de source explicites sauf dans des circonstances inhabituelles. Les serveurs SMTP PEUVENT refuser d&rsquo;agir comme relais de messagerie ou d&rsquo;accepter des adresses qui sp&eacute;cifient des routes de source. Lorsqu&rsquo;ils rencontrent des informations de route, les serveurs SMTP peuvent aussi ignorer les informations de route et envoyer simplement &agrave; la destination finale sp&eacute;cifi&eacute;e comme dernier &eacute;l&eacute;ment de la route et DEVRAIENT le faire. Il y a eu une pratique non valide d&rsquo;utilisation de noms qui n&rsquo;apparaissent pas dans le DNS comme noms de destination, les envoyeurs comptant sur les h&ocirc;tes interm&eacute;diaires sp&eacute;cifi&eacute;s dans l&rsquo;acheminement de source pour r&eacute;soudre tous les probl&egrave;mes. Si les routes de source sont enlev&eacute;es, cette pratique causera des d&eacute;faillances. C&rsquo;est une des raisons pour lesquelles les clients SMTP NE DOIVENT PAS g&eacute;n&eacute;rer des routes de source invalides ou d&eacute;pendantes de la r&eacute;solution d&rsquo;une s&eacute;rie de noms. </p>
<p>Lorsque les routes de source ne sont pas utilis&eacute;es, le processus d&eacute;crit dans la RFC 821 pour construire un chemin inverse &agrave; partir du chemin de retour n&rsquo;est pas applicable et le chemin inverse au moment de la livraison sera simplement l&rsquo;adresse qui appara&icirc;t dans la commande MAIL. </p>
<p>Un serveur SMTP relais est habituellement la cible d&rsquo;un enregistrement MX DNS qui le d&eacute;signe, plut&ocirc;t que le syst&egrave;me de livraison final. Le serveur relais peut accepter ou rejeter la t&acirc;che de relayer la messagerie de la m&ecirc;me fa&ccedil;on qu&rsquo;il accepte ou refuse la messagerie d&rsquo;un usager local. Si il accepte la t&acirc;che, il devient alors un client SMTP, &eacute;tablit un canal de transmission avec le prochain serveur SMTP sp&eacute;cifi&eacute; dans le DNS (conform&eacute;ment aux r&egrave;gles de la Section 5), et lui envoie le courrier. Si il refuse de relayer la messagerie &agrave; une adresse particuli&egrave;re pour des raisons de politique, une r&eacute;ponse 550 DEVRAIT &ecirc;tre retourn&eacute;e. </p>
<p>Il existe de nombreux clients qui envoient de la messagerie, en particulier en conjonction avec des dispositifs qui re&ccedil;oivent de la messagerie via POP3 ou IMAP, qui ont des capacit&eacute;s limit&eacute;s pour prendre en charge certaines des exigences de la pr&eacute;sente sp&eacute;cification, comme la capacit&eacute; &agrave; mettre en file d&rsquo;attente les messages afin de tenter ult&eacute;rieurement leur livraison. Pour ces clients, il est de pratique courante de faire des arrangements priv&eacute;s pour envoyer tous les messages &agrave; un seul serveur pour le traitement et la distribution qui s&rsquo;ensuit. SMTP, tel que sp&eacute;cifi&eacute; ici, n&rsquo;est pas con&ccedil;u id&eacute;alement pour ce r&ocirc;le, et le travail est en cours pour normaliser des protocoles de pr&eacute;sentation de messagerie qui pourraient &eacute;ventuellement remplacer les pratiques actuelles. Dans tous les cas, comme ces arrangements sont priv&eacute;s et sortent du domaine d&rsquo;application de la pr&eacute;sente sp&eacute;cification, ils ne sont pas d&eacute;crits ici. </p>
<p>Il est important de noter que les enregistrements MX peuvent pointer sur les serveurs SMTP qui agissent comme passerelles vers d&rsquo;autres environnements, et pas simplement comme relais SMTP et syst&egrave;mes de livraison finale ; voir le paragraphe 3.8 et la section 5. </p>
<p>Si un serveur SMTP a accept&eacute; la t&acirc;che de relayer la messagerie et trouve ensuite que la destination est incorrecte ou que le courrier ne peut &ecirc;tre livr&eacute; pour quelque autre raison, il DOIT alors construire un message de notification &quot;message non livrable&quot; et l&rsquo;envoyer &agrave; l&rsquo;origine du message non livrable (comme indiqu&eacute; par le chemin inverse). Les formats sp&eacute;cifi&eacute;s pour les rapports de non livraison par d&rsquo;autres normes (voir, par exemple, [24, 25]) DEVRAIENT &ecirc;tre utilis&eacute;s si possible. </p>
<p>Ce message de notification doit &ecirc;tre du serveur SMTP &agrave; l&rsquo;h&ocirc;te relais ou &agrave; l&rsquo;h&ocirc;te qui a le premier d&eacute;termin&eacute; que cette livraison ne pouvait pas &ecirc;tre r&eacute;alis&eacute;e. Bien s&ucirc;r, les serveurs SMTP NE DOIVENT PAS envoyer de messages de notification sur des probl&egrave;mes de transport de messages de notification. Une fa&ccedil;on d&rsquo;emp&ecirc;cher les boucles de rapport d&rsquo;erreur est de sp&eacute;cifier un chemin inverse nul dans la commande MAIL d&rsquo;un message de notification. Lorsqu&rsquo;un tel message est transmis, le chemin inverse DOIT &ecirc;tre r&eacute;gl&eacute; &agrave; nul (voir au paragraphe 4.5.5 pour des pr&eacute;cisions). Une commande MAIL avec un chemin inverse nul appara&icirc;t comme suit&nbsp;: </p>
<p>MAIL FROM:&lt;&gt; </p>
<p>Comme expos&eacute; au paragraphe 2.4.1, un relais SMTP n&rsquo;a pas besoin d&rsquo;inspecter les en-t&ecirc;tes ou corps des donn&eacute;es de message ou d&rsquo;agir sur elles et NE DOIT PAS le faire sauf pour y ajouter son propre en-t&ecirc;te &quot;Received:&quot; (paragraphe 4.4) et, facultativement, pour essayer de d&eacute;tecter une boucle dans le syst&egrave;me de messagerie (voir au paragraphe 6.2). </p>
<p>&nbsp;</p>
<h2><a name="_Toc186287736"></a><a name="_Toc186079874"></a><a name="_Toc186079762"> 3.8 Passerelles de messagerie</a></h2>
<p> Alors que la fonction de relais expos&eacute;e ci-dessus op&egrave;re au sein de l&rsquo;environnement SMTP de service de transport Internet, les enregistrements MX ou diverses formes d&rsquo;acheminement explicite peuvent exiger qu&rsquo;un serveur SMTP interm&eacute;diaire effectue une fonction de traduction entre un service de transport et un autre. Comme expos&eacute; au paragraphe 2.3.8, lorsqu&rsquo;un tel syst&egrave;me est &agrave; la fronti&egrave;re entre deux environnements de service de transport, nous l&rsquo;appelons une &quot;passerelle&quot; ou &quot;passerelle SMTP&quot;. </p>
<p>&Eacute;tablir des passerelles de messagerie entre des environnements de messagerie diff&eacute;rents, comme des formats et protocoles de message diff&eacute;rents est complexe et ne se pr&ecirc;te pas facilement &agrave; normalisation. Cependant, quelques exigences g&eacute;n&eacute;rales peuvent &ecirc;tre donn&eacute;es pour une passerelle entre l&rsquo;Internet et un autre environnement de messagerie. </p>
<h3><a name="_Toc186287737"></a><a name="_Toc186079763"> 3.8.1 Champs d&rsquo;en-t&ecirc;te dans l&rsquo;utilisation de passerelles</a></h3>
<p> Des champs d&rsquo;en-t&ecirc;te PEUVENT &ecirc;tre r&eacute;&eacute;crits quand n&eacute;cessaire lorsque les messages sont pass&eacute;s par une passerelle &agrave; travers des fronti&egrave;res d&rsquo;environnement de messagerie. Cela peut impliquer d&rsquo;inspecter le corps de message ou d&rsquo;interpr&eacute;ter la partie locale de l&rsquo;adresse de destination en d&eacute;pit des interdictions du paragraphe 2.4.1. </p>
<p>D&rsquo;autres syst&egrave;mes de messagerie pass&eacute;s par passerelle &agrave; l&rsquo;Internet utilisent souvent un sous-ensemble des en-t&ecirc;tes de la RFC&nbsp;822 ou fournissent des fonctionnalit&eacute;s similaires avec une syntaxe diff&eacute;rente, mais certains de ces syst&egrave;mes de messagerie n&rsquo;ont pas l&rsquo;&eacute;quivalent de l&rsquo;enveloppe SMTP. Donc, lorsque un message quitte l&rsquo;environnement Internet, il peut &ecirc;tre n&eacute;cessaire de replier les informations de l&rsquo;enveloppe SMTP dans l&rsquo;en-t&ecirc;te du message. Une solution possible serait de cr&eacute;er de nouveaux champs d&rsquo;en-t&ecirc;te pour porter les informations d&rsquo;enveloppe (par exemple, &quot;X-SMTP-MAIL:&quot; et &quot;X-SMTP-RCPT:&quot;); cependant, cela exigerait des changements des programmes de messagerie dans des environnements &eacute;trangers et pourrait risquer de divulguer des informations priv&eacute;es (voir au paragraphe 7.2). </p>
<h3><a name="_Toc186287738"></a><a name="_Toc186079764"> 3.8.2 Lignes re&ccedil;ues dans l&rsquo;utilisation de passerelles</a></h3>
<p> Lors de la transmission d&rsquo;un message dans ou vers l&rsquo;environnement Internet, une passerelle DOIT ajouter une ligne Received:, mais elle NE DOIT alt&eacute;rer en aucune fa&ccedil;on une ligne Received: qui serait d&eacute;j&agrave; dans l&rsquo;en-t&ecirc;te. </p>
<p>Les champs &quot;Received:&quot; des messages provenant d&rsquo;autres environnements peuvent n&rsquo;&ecirc;tre pas exactement conformes &agrave; la pr&eacute;sente sp&eacute;cification. Cependant, l&rsquo;utilisation la plus importante des lignes Received: est pour corriger les fautes de messagerie, et ce d&eacute;bogage peut &ecirc;tre s&eacute;v&egrave;rement entrav&eacute; par des passerelles aux bonnes intentions qui essayent de &quot;corriger&quot; une ligne Received:. Comme autre cons&eacute;quence de l&rsquo;apparition de champs trace dans des environnements non SMTP, les syst&egrave;mes r&eacute;cepteurs NE DOIVENT PAS rejeter du courrier sur la base du format d&rsquo;un champ de trace et DEVRAIENT &ecirc;tre extr&ecirc;mement robustes en pr&eacute;sence d&rsquo;informations ou formats inattendus dans ces champs. </p>
<p>La passerelle DEVRAIT indiquer l&rsquo;environnement et le protocole dans les clauses &quot;via&quot; du ou des champs Received qu&rsquo;elle fournit. </p>
<h3><a name="_Toc186287739"></a><a name="_Toc186079765"> 3.8.3 Adresses dans l&rsquo;utilisation de passerelles</a></h3>
<p> Du c&ocirc;t&eacute; Internet, la passerelle DEVRAIT accepter tous les formats d&rsquo;adresse valides dans les commandes SMTP et dans les en-t&ecirc;tes de la RFC 822, et tous les messages RFC 822 valides. Les adresses et en-t&ecirc;tes g&eacute;n&eacute;r&eacute;s par des passerelles DOIVENT se conformer aux normes applicables de l&rsquo;Internet (y compris celle-ci et la RFC 822). Les passerelles sont, bien s&ucirc;r, soumises aux m&ecirc;mes r&egrave;gles de traitement des routes de source que d&eacute;crites pour les autres syst&egrave;mes SMTP au paragraphe 3.3</p>
<h3><a name="_Toc186287740"></a><a name="_Toc186079766"> 3.8.4 Autres champs d&rsquo;en-t&ecirc;te dans l&rsquo;utilisation de passerelles</a></h3>
<p> La passerelle DOIT s&rsquo;assurer que tous les champs d&rsquo;en-t&ecirc;te d&rsquo;un message qu&rsquo;elle transmet dans l&rsquo;environnement de messagerie de l&rsquo;Internet satisfont aux exigences de la messagerie Internet. En particulier, toutes les adresses dans les champs &quot;From:&quot;, &quot;To:&quot;, &quot;Cc:&quot;, etc., DOIVENT &ecirc;tre transform&eacute;es (si n&eacute;cessaire) pour satisfaire &agrave; la syntaxe de la RFC&nbsp;822, DOIVENT ne faire r&eacute;f&eacute;rence qu&rsquo;&agrave; des noms de domaine pleinement qualifi&eacute;s, et DOIVENT &ecirc;tre efficaces et utiles pour l&rsquo;envoi des r&eacute;ponses. L&rsquo;algorithme de traduction utilis&eacute; pour convertir les messages des protocoles Internet en protocoles d&rsquo;un autre environnement DEVRAIT garantir que les messages d&rsquo;erreur provenant de l&rsquo;environnement de messagerie &eacute;tranger sont livr&eacute;s au chemin de retour tir&eacute; de l&rsquo;enveloppe SMTP, et non &agrave; l&rsquo;envoyeur figurant dans le champ &quot;From:&quot; (ou autres champs) du message RFC 822. </p>
<p>&nbsp; </p>
<h3><a name="_Toc186287741"></a><a name="_Toc186079767"> 3.8.5 Enveloppes dans l&rsquo;utilisation de passerelles</a></h3>
<p> De m&ecirc;me, lors de la transmission d&rsquo;un message provenant d&rsquo;un autre environnement vers l&rsquo;Internet, la passerelle DEVRAIT r&eacute;gler le chemin de retour de l&rsquo;enveloppe en accord avec l&rsquo;adresse de retour de message d&rsquo;erreur, si elle est fournie par l&rsquo;environnement &eacute;tranger. Si l&rsquo;environnement &eacute;tranger n&rsquo;a pas de concept &eacute;quivalent, la passerelle doit choisir et utiliser la meilleure approximation, avec l&rsquo;adresse d&rsquo;origine du message par d&eacute;faut en dernier ressort. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287742"></a><a name="_Toc186079875"></a><a name="_Toc186079768"> 3.9 Fin des sessions et des connexions</a></h2>
<p> Une connexion SMTP se termine lorsque le client envoie une commande QUIT. Le serveur r&eacute;pond par un code de r&eacute;ponse positif, apr&egrave;s quoi il ferme la connexion. </p>
<p>Un serveur SMTP NE DOIT PAS clore intentionnellement la connexion sauf : </p>
<p> - Apr&egrave;s avoir re&ccedil;u une commande QUIT et avoir r&eacute;pondu par une r&eacute;ponse 221. </p>
<p> - Apr&egrave;s avoir d&eacute;tect&eacute; la n&eacute;cessit&eacute; de fermer le service SMTP et avoir retourn&eacute; un code de r&eacute;ponse 421. Ce code de r&eacute;ponse peut &ecirc;tre produit apr&egrave;s que le serveur a re&ccedil;u une commande quelconque ou, si n&eacute;cessaire, sans coordination avec la r&eacute;ception de la commande (en supposant que le client la recevra apr&egrave;s la production de la prochaine commande). </p>
<p>En particulier, un serveur qui ferme les connexions en r&eacute;ponse &agrave; des commandes qu&rsquo;il ne comprend pas viole la pr&eacute;sente sp&eacute;cification. On attend des serveurs qu&rsquo;ils soient tol&eacute;rants &agrave; l&rsquo;&eacute;gard des commandes inconnues, qu&rsquo;ils produisent une r&eacute;ponse 500 et attendent d&rsquo;autres instructions de la part du client. </p>
<p>Un serveur SMTP qui est contraint de clore via des moyens externes DEVRAIT tenter d&rsquo;envoyer une ligne contenant un code de r&eacute;ponse 421 au client SMTP avant de quitter. Le client SMTP va normalement lire le code de r&eacute;ponse 421 apr&egrave;s l&rsquo;envoi de sa prochaine commande. </p>
<p>Les clients SMTP qui font face &agrave; la cl&ocirc;ture, r&eacute;initialisation ou autre d&eacute;faut de communication d&rsquo;une connexion, due &agrave; des circonstances qui &eacute;chappent &agrave; leur contr&ocirc;le (en violation des intentions de la pr&eacute;sente sp&eacute;cification mais parfois in&eacute;vitables) DEVRAIENT, pour conserver la robustesse du syst&egrave;me de messagerie, traiter la transaction de messagerie comme si une r&eacute;ponse 451 avait &eacute;t&eacute; re&ccedil;ue et agir en cons&eacute;quence. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287743"></a><a name="_Toc186079876"></a><a name="_Toc186079769"> 3.10 Listes de messagerie et alias</a></h2>
<p>Un h&ocirc;te disposant de la capacit&eacute; SMTP DEVRAIT prendre en charge aussi bien les alias que les mod&egrave;les de liste d&rsquo;expansion d&rsquo;adresse pour les livraisons multiples. Lorsque un message est d&eacute;livr&eacute; ou transmis &agrave; chaque adresse d&rsquo;une forme de liste &eacute;tendue, l&rsquo;adresse de retour dans l&rsquo;enveloppe (&quot;MAIL FROM:&quot;) DOIT &ecirc;tre chang&eacute;e pour l&rsquo;adresse d&rsquo;une personne ou autre entit&eacute; qui administre la liste. Cependant, dans ce cas, l&rsquo;en-t&ecirc;te de message [32] DOIT rester inchang&eacute; ; en particulier, le champ &quot;From&quot; de l&rsquo;en-t&ecirc;te du message n&rsquo;est pas affect&eacute;. </p>
<p>Un dispositif important pour la messagerie est le m&eacute;canisme de livraison multi destinations dans un seul message, en transformant (ou &quot;&eacute;clatant&quot; ou &quot;explosant&quot;) une adresse de pseudo bo&icirc;te &agrave; lettres en une liste d&rsquo;adresses de bo&icirc;tes &agrave; lettres de destination. Lorsque un message est envoy&eacute; &agrave; une telle pseudo bo&icirc;te &agrave; lettres (parfois appel&eacute;e un &quot;exploseur&quot;), des copies sont transmises ou redistribu&eacute;es &agrave; chaque bo&icirc;te &agrave; lettres dans la liste &eacute;clat&eacute;e. Les serveurs DEVRAIENT simplement utiliser les adresses de la liste ; l&rsquo;application de r&egrave;gles d&rsquo;heuristique ou autres r&egrave;gles de correspondance pour &eacute;liminer certaines adresses, comme celle de l&rsquo;origine, est fortement d&eacute;conseill&eacute;e. On classe de telles pseudo bo&icirc;tes &agrave; lettres dans la cat&eacute;gorie des &quot;alias&quot; ou des &quot;listes&quot;, selon les r&egrave;gles d&rsquo;expansion. </p>
<h3><a name="_Toc186287744"></a><a name="_Toc186079770"> 3.10.1 Alias</a></h3>
<p> Pour &eacute;tendre un alias, le messageur receveur remplace simplement tout &agrave; tour dans l&rsquo;enveloppe l&rsquo;adresse de la pseudo bo&icirc;te &agrave; lettres par chaque adresse issue de l&rsquo;&eacute;clatement ; le reste de l&rsquo;enveloppe et le corps de message restent inchang&eacute;s. Le message est alors d&eacute;livr&eacute; ou transmis &agrave; chaque adresse issue de l&rsquo;&eacute;clatement de la pseudo bo&icirc;te &agrave; lettres. </p>
<h3><a name="_Toc186287745"></a><a name="_Toc186079771"> 3.10.2 Liste</a></h3>
<p> Une liste de diffusion peut &ecirc;tre dite fonctionner par &quot;redistribution&quot; plut&ocirc;t que par &quot;transmission&quot;. Pour &eacute;clater une liste, le messageur de r&eacute;ception remplace dans l&rsquo;enveloppe les adresses de la pseudo bo&icirc;te &agrave; lettres par toutes les adresses &eacute;clat&eacute;es. L&rsquo;adresse de retour dans l&rsquo;enveloppe est chang&eacute;e de sorte que tous les messages d&rsquo;erreur g&eacute;n&eacute;r&eacute;s par les livraisons finales soient retourn&eacute;s &agrave; l&rsquo;administrateur de la liste, et non &agrave; l&rsquo;origine du message, qui n&rsquo;a g&eacute;n&eacute;ralement aucun contr&ocirc;le sur le contenu de la liste et va normalement trouver f&acirc;cheux ces messages d&rsquo;erreur. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287746"></a><a name="_Toc186079877"></a><a name="_Toc186079772"> 4 Les sp&eacute;cifications SMTP</a></h1>
<h2><a name="_Toc186287747"></a><a name="_Toc186079878"></a><a name="_Toc186079773"> 4.1 Commandes SMTP</a></h2>
<h3><a name="_Toc186287748"></a><a name="_Toc186079774"> 4.1.1 S&eacute;mantique et syntaxe des commandes</a></h3>
<p> Les commandes SMTP d&eacute;finissent le transfert de messagerie ou la fonction de syst&egrave;me de messagerie requis par l&rsquo;usager. Les commandes SMTP sont des cha&icirc;nes de caract&egrave;res termin&eacute;es par &lt;CRLF&gt;. Les commandes elles-m&ecirc;mes sont des caract&egrave;res alphab&eacute;tiques termin&eacute;s par &lt;SP&gt; si des param&egrave;tres suivent et &lt;CRLF&gt; autrement. (Dans l&rsquo;int&eacute;r&ecirc;t de l&rsquo;interop&eacute;rabilit&eacute;, il est conseill&eacute; aux receveur SMTP de tol&eacute;rer l&rsquo;espace blanche en queue avant le &lt;CRLF&gt; de terminaison.) La syntaxe de la partie locale d&rsquo;une bo&icirc;te &agrave; lettres doit se conformer aux conventions de site du receveur et &agrave; la syntaxe sp&eacute;cifi&eacute;e au paragraphe 4.1.2. Les commandes SMTP sont expos&eacute;es plus loin. Les r&eacute;ponses SMTP sont expos&eacute;es au paragraphe 4.2. Une transaction de messagerie implique plusieurs objets de donn&eacute;es qui sont communiqu&eacute;s comme arguments pour diff&eacute;rentes commandes. Le chemin inverse est l&rsquo;argument de la commande MAIL, le chemin de transmission est l&rsquo;argument de la commande RCTP, et les donn&eacute;es de messagerie sont l&rsquo;argument de la commande DATA. Ces arguments ou objets de donn&eacute;es doivent &ecirc;tre transmis et conserv&eacute;s en attendant la confirmation communiqu&eacute;e par l&rsquo;indication de fin des donn&eacute;es de messagerie qui finalise la transaction. Le mod&egrave;le de ce comportement est que des m&eacute;moires tampon distinctes sont fournies pour d&eacute;tenir les types d&rsquo;objets de donn&eacute;es, c&rsquo;est-&agrave;-dire qu&rsquo;il y a une m&eacute;moire tampon de chemin inverse, une m&eacute;moire tampon de chemin de transmission, et une m&eacute;moire tampon de donn&eacute;es de messagerie. Des commandes sp&eacute;cifiques provoquent l&rsquo;ajout des informations &agrave; une m&eacute;moire tampon sp&eacute;cifique, ou causent le vidage d&rsquo;une ou plusieurs m&eacute;moires tampon. </p>
<p>Plusieurs commandes (RSET, DATA, QUIT) sont sp&eacute;cifi&eacute;es comme ne permettant pas de param&egrave;tres. En l&rsquo;absence d&rsquo;extensions sp&eacute;cifiques offertes par le serveur et accept&eacute;es par le client, les clients NE DOIVENT PAS envoyer de tels param&egrave;tres et les serveurs DEVRAIENT rejeter les commandes qui les contiennent comme ayant une syntaxe invalide. </p>
<p><strong> 4.1.1.1 Extension de HELLO (EHLO) ou HELLO (HELO) </strong></p>
<p> Ces commandes sont utilis&eacute;es pour identifier le client SMTP aupr&egrave;s du serveur SMTP. Le champ d&rsquo;argument contient le nom de domaine pleinement qualifi&eacute; du client SMTP s&rsquo;il en est un disponible. Dans les situations dans lesquelles le syst&egrave;me SMTP client n&rsquo;a pas de nom de domaine significatif (par exemple, quand son adresse est allou&eacute;e de fa&ccedil;on dynamique et qu&rsquo;aucun enregistrement de chemin inverse n&rsquo;est disponible), le client DEVRAIT envoyer une adresse litt&eacute;rale (voir au paragraphe 4.1.3), facultativement suivie par des informations qui aideront &agrave; identifier le syst&egrave;me client. Le serveur SMTP s&rsquo;identifie lui-m&ecirc;me aupr&egrave;s du client SMTP dans la r&eacute;ponse d&rsquo;accueil de connexion et dans la r&eacute;ponse &agrave; cette commande. </p>
<p>Un client SMTP DEVRAIT commencer une session SMTP par la production de la commande EHLO. Si le serveur SMTP accepte les extensions de service SMTP, il donnera une r&eacute;ponse de succ&egrave;s, une r&eacute;ponse d&rsquo;&eacute;chec, ou une r&eacute;ponse d&rsquo;erreur. Si le serveur SMTP, en violation de la pr&eacute;sente sp&eacute;cification, ne prend en charge aucune extension de service SMTP, il g&eacute;n&eacute;rera une r&eacute;ponse d&rsquo;erreur. Les vieux syst&egrave;mes clients SMTP PEUVENT, comme expos&eacute; ci-dessus, utiliser HELO (qui &eacute;tait sp&eacute;cifi&eacute; dans la RFC 821) au lieu de EHLO, et les serveurs DOIVENT accepter la commande HELO et y r&eacute;pondre de fa&ccedil;on appropri&eacute;e. Dans tous les cas, un client DOIT produire un HELO ou EHLO avant de commencer une transaction de messagerie. </p>
<p>Ces commandes, et une r&eacute;ponse &quot;250 OK&quot; &agrave; l&rsquo;une d&rsquo;elles, confirment que le client SMTP et le serveur SMTP sont tous deux dans l&rsquo;&eacute;tat initial, c&rsquo;est-&agrave;-dire qu&rsquo;il n&rsquo;y a pas de transaction en cours et que tous les tableaux d&rsquo;&eacute;tat et toutes les m&eacute;moires tampon ont &eacute;t&eacute; vid&eacute;s. </p>
<p>Syntaxe : <br>
  ehlo = &quot;EHLO&quot; SP Domaine CRLF <br>
helo = &quot;HELO&quot; SP Domaine CRLF </p>
<p>Normalement, la r&eacute;ponse &agrave; EHLO sera une r&eacute;ponse multi ligne. Chaque ligne de la r&eacute;ponse contient un mot cl&eacute; et, facultativement, un ou plusieurs param&egrave;tres. Suivant la syntaxe normale pour les r&eacute;ponses multi lignes, ces mots cl&eacute;s suivent le code (250) et un trait d&rsquo;union pour toutes sauf la derni&egrave;re ligne, et le code et une espace pour la derni&egrave;re ligne. La syntaxe pour une r&eacute;ponse positive, en utilisant la notation ABNF et les symboles terminaux de [8], est&nbsp;: <br>
  ehlo-ok-rsp = ( &quot;250&quot; domain [ SP ehlo-greet ] CRLF ) <br>
  / ( &quot;250-&quot; domain [ SP ehlo-greet ] CRLF <br>
  *( &quot;250-&quot; ehlo-line CRLF ) <br>
&quot;250&quot; SP ehlo-line CRLF ) <br>
ehlo-greet = 1*(%d0-9 / %d11-12 / %d14-127) <br>
; cha&icirc;ne de tous caract&egrave;res autres que CR ou LF <br>
ehlo-line = ehlo-keyword *( SP ehlo-param ) <br>
ehlo-keyword = (ALPHA / DIGIT) *(ALPHA / DIGIT / &quot;-&quot;) <br>
; la syntaxe suppl&eacute;mentaire de ehlo-params d&eacute;pend de ehlo-keyword <br>
ehlo-param = 1*(%d33-127) <br>
; tout caract&egrave;re sauf &lt;SP&gt; et tout caract&egrave;re de contr&ocirc;le (US-ASCII 0 &agrave; 31 inclus) </p>
<p>Bien que le mot cl&eacute; EHLO puisse &ecirc;tre sp&eacute;cifi&eacute; en majuscules, minuscules ou en casse mixte, il DOIT toujours &ecirc;tre reconnu et trait&eacute; de fa&ccedil;on insensible &agrave; la casse. Ceci est simplement une extension des pratiques sp&eacute;cifi&eacute;es dans la RFC 821 et au paragraphe 2.4.1. </p>
<p><strong> 4.1.1.2 MAIL (MAIL) </strong></p>
<p> Cette commande est utilis&eacute;e pour initier une transaction de messagerie dans laquelle les donn&eacute;es de messagerie sont livr&eacute;es &agrave; un serveur SMTP qui peut &agrave; son tour, les livrer &agrave; une ou plusieurs bo&icirc;tes &agrave; lettres ou les passer &agrave; un autre syst&egrave;me (&eacute;ventuellement en utilisant SMTP). Le champ d&rsquo;argument contient un chemin inverse et peut contenir des param&egrave;tres facultatifs. En g&eacute;n&eacute;ral, la commande MAIL ne peut &ecirc;tre envoy&eacute;e que quand aucune transaction de messagerie n&rsquo;est en cours, voir au paragraphe 4.1.4. </p>
<p>Le chemin inverse est la bo&icirc;te &agrave; lettres de l&rsquo;envoyeur. Historiquement, cette bo&icirc;te &agrave; lettres pouvait facultativement &ecirc;tre pr&eacute;c&eacute;d&eacute;e d&rsquo;une liste d&rsquo;h&ocirc;tes, mais ce comportement est maintenant d&eacute;conseill&eacute; (voir l&rsquo;appendice C). Dans certains types de messages de rapport pour lesquels une r&eacute;ponse va vraisemblablement causer une boucle (par exemple, notifications de livraison de message et de non livraisons), le chemin inverse peut &ecirc;tre nul (voir au paragraphe 3.7). </p>
<p>Cette commande vide la m&eacute;moire tampon de chemin inverse, la m&eacute;moire tampon de chemin de transmission, et la m&eacute;moire tampon de donn&eacute;es de messagerie, et ins&egrave;re les informations de chemin inverse &agrave; partir de cette commande dans la m&eacute;moire tampon de chemin inverse. </p>
<p>Si des extensions de service ont &eacute;t&eacute; n&eacute;goci&eacute;es, la commande MAIL peut aussi porter des param&egrave;tres associ&eacute;s &agrave; une extension de service particuli&egrave;re. </p>
<p>Syntaxe : <br>
&quot;MAIL FROM:&quot; (&quot;&lt;&gt;&quot; / Chemin-inverse) [SP param&egrave;tres de messagerie] CRLF </p>
<p><strong> 4.1.1.3 RECEVEUR (RCPT) </strong></p>
<p> Cette commande est utilis&eacute;e pour identifier un receveur individuel des donn&eacute;es de messagerie ; plusieurs receveurs sont sp&eacute;cifi&eacute;s par plusieurs utilisations de cette commande. Le champ d&rsquo;argument contient un chemin de transmission et peut contenir des param&egrave;tres facultatifs. </p>
<p>Le chemin de transmission comporte normalement les bo&icirc;tes &agrave; lettres de destination requises. Les syst&egrave;mes d&rsquo;envoi NE DEVRAIENT PAS g&eacute;n&eacute;rer la liste facultative des h&ocirc;tes connus comme une route de source. Les syst&egrave;mes de r&eacute;ception DOIVENT reconna&icirc;tre la syntaxe de route de source mais DEVRAIENT effacer la sp&eacute;cification de la route de source et utiliser le nom de domaine associ&eacute; &agrave; la bo&icirc;te &agrave; lettres comme si la route de source n&rsquo;avait pas &eacute;t&eacute; fournie. </p>
<p>De m&ecirc;me, les h&ocirc;tes relais DEVRAIENT effacer ou ignorer les routes de source, et les noms NE DOIVENT PAS &ecirc;tre copi&eacute;s dans le chemin inverse. Lorsque le message atteint sa destination ultime (le chemin de transmission contient seulement une bo&icirc;te &agrave; lettres de destination), le serveur SMTP l&rsquo;ins&egrave;re dans la bo&icirc;te &agrave; lettres de destination conform&eacute;ment aux conventions de messagerie de son h&ocirc;te. </p>
<p>Par exemple, la messagerie re&ccedil;ue &agrave; l&rsquo;h&ocirc;te relais xyz.com avec des commandes d&rsquo;enveloppe <br>
MAIL FROM:&lt;userx@y.foo.org&gt; <br>
RCPT TO:&lt;@hosta.int,@jkl.org:userc@d.bar.org&gt; </p>
<p> sera normalement envoy&eacute;e directement &agrave; l&rsquo;h&ocirc;te d.bar.org avec des commandes d&rsquo;enveloppe <br>
MAIL FROM:&lt;userx@y.foo.org&gt; <br>
RCPT TO:&lt;userc@d.bar.org&gt; </p>
<p>Comme indiqu&eacute; ) l&rsquo;appendice C, xyz.com PEUT aussi choisir de relayer le message &agrave; hosta.int, en utilisant les commandes d&rsquo;enveloppe <br>
  MAIL FROM:&lt;userx@y.foo.org&gt; <br>
  RCPT TO:&lt;@hosta.int,@jkl.org:userc@d.bar.org&gt; <br>
  ou &agrave; jkl.org, en utilisant les commandes d&rsquo;enveloppe <br>
  MAIL FROM:&lt;userx@y.foo.org&gt; <br>
RCPT TO:&lt;@jkl.org:userc@d.bar.org&gt; </p>
<p>Bien s&ucirc;r, comme les h&ocirc;tes ne sont pas oblig&eacute;s de relayer du tout la messagerie, xyz.com peut aussi rejeter le message enti&egrave;rement &agrave; r&eacute;ception de la commande RCTP, en utilisant un code 550 (car c&rsquo;est une &quot;raison de politique&quot;). </p>
<p>Si des extensions de service ont &eacute;t&eacute; n&eacute;goci&eacute;es, la commande RCTP peut aussi porter des param&egrave;tres associ&eacute;s &agrave; une extension de service particuli&egrave;re offerte par le serveur. Le client NE DOIT PAS transmettre de param&egrave;tres autres que ceux associ&eacute;s &agrave; une extension de service offerte par le serveur dans sa r&eacute;ponse EHLO. </p>
<p>Syntaxe :<br>
&quot;RCPT TO:&quot; (&quot;&lt;Postmaster@&quot; domaine &quot;&gt;&quot; / &quot;&lt;Postmaster&gt;&quot; / Chemin de transmission) [SP param&egrave;tres-Rcpt] CRLF </p>
<p><strong> 4.1.1.4 DONN&Eacute;ES (DATA) </strong></p>
<p> Le receveur envoie normalement une r&eacute;ponse 354 &agrave; DATA, et traite ensuite les lignes (les cha&icirc;nes se terminant par une s&eacute;quence &lt;CRLF&gt;, comme d&eacute;crit au paragraphe 2.3.7) qui suivent la commande comme donn&eacute;es de messagerie provenant de l&rsquo;envoyeur. Cette commande provoque l&rsquo;ajout des donn&eacute;es de messagerie &agrave; la m&eacute;moire tampon de donn&eacute;es de messagerie. Les donn&eacute;es de messagerie peuvent contenir tous les 128 codes de caract&egrave;re ASCII, bien que l&rsquo;exp&eacute;rience ait montr&eacute; que l&rsquo;utilisation des caract&egrave;res de contr&ocirc;le autres que SP, HT, CR, et LF puisse causer des probl&egrave;mes et DEVRAIT &ecirc;tre &eacute;vit&eacute;e autant que possible. </p>
<p>Les donn&eacute;es de messagerie sont termin&eacute;es par une ligne qui contient seulement un point, c&rsquo;est-&agrave;-dire, la s&eacute;quence de caract&egrave;res &quot;&lt;CRLF&gt;.&lt;CRLF&gt;&quot; (voir au paragraphe 4.5.2). C&rsquo;est l&rsquo;indication de la fin des donn&eacute;es de messagerie. Noter que le premier &lt;CRLF&gt; de cette s&eacute;quence de fin est aussi le &lt;CRLF&gt; qui termine la ligne finale des donn&eacute;es (texte du message) ou, si il n&rsquo;y avait pas de donn&eacute;es, termine la commande DATA elle-m&ecirc;me. Un &lt;CRLF&gt; suppl&eacute;mentaire NE DOIT PAS &ecirc;tre ajout&eacute;, cars cela causerait l&rsquo;ajout d&rsquo;une ligne vide au message. La seule exception &agrave; cette r&egrave;gle surviendrait si le corps de message &eacute;tait pass&eacute; &agrave; l&rsquo;envoyeur SMTP d&rsquo;origine avec une &quot;ligne&quot; finale qui ne se terminerait pas par un &lt;CRLF&gt; ; dans ce cas, le syst&egrave;me SMTP d&rsquo;origine DOIT rejeter le message comme invalide ou ajouter le &lt;CRLF&gt; afin que le serveur SMTP receveur reconnaisse la condition &quot;fin des donn&eacute;es&quot;. </p>
<p>La coutume d&rsquo;accepter des lignes se terminant seulement par un &lt;LF&gt;, concession au comportement non-conformiste de la part de certains syst&egrave;mes UNIX, s&rsquo;est r&eacute;v&eacute;l&eacute;e causer plus de probl&egrave;mes d&rsquo;interop&eacute;rabilit&eacute; qu&rsquo;elle n&rsquo;en r&eacute;sout, et les syst&egrave;mes serveurs SMTP NE DOIVENT PAS le faire, m&ecirc;me au nom d&rsquo;une robustesse am&eacute;lior&eacute;e. En particulier, la s&eacute;quence &quot;&lt;LF&gt;.&lt;LF&gt;&quot; (sauts &agrave; la ligne nus, sans retour chariot) NE DOIT PAS &ecirc;tre trait&eacute;e comme &eacute;quivalente &agrave; &lt;CRLF&gt;.&lt;CRLF&gt; comme indication de fin des donn&eacute;es de messagerie. </p>
<p>La r&eacute;ception de l&rsquo;indication de fin des donn&eacute;es de messagerie oblige le serveur &agrave; traiter les informations de transaction de messagerie m&eacute;moris&eacute;es. Ce traitement consomme les informations qui sont dans la m&eacute;moire tampon de chemin inverse, dans la m&eacute;moire tampon de chemin de transmission, et dans la m&eacute;moire tampon de donn&eacute;es de messagerie, et &agrave; l&rsquo;ach&egrave;vement de cette commande, ces m&eacute;moires tampon sont vid&eacute;es. Si le traitement est r&eacute;ussi, le receveur DOIT envoyer une r&eacute;ponse OK. Si le traitement &eacute;choue, le receveur DOIT envoyer une r&eacute;ponse d&rsquo;&eacute;chec. Le mod&egrave;le SMTP ne permet pas d&rsquo;&eacute;checs partiels &agrave; ce point : soit le message est accept&eacute; par le serveur pour livraison et une r&eacute;ponse positive est retourn&eacute;e, soit il n&rsquo;est pas accept&eacute; et une r&eacute;ponse d&rsquo;&eacute;chec est retourn&eacute;e. En envoyant une r&eacute;ponse d&rsquo;ach&egrave;vement positive &agrave; l&rsquo;indication de fin des donn&eacute;es, le receveur prend la pleine responsabilit&eacute; du message (voir au paragraphe 6.1). Les erreurs qui sont diagnostiqu&eacute;es ult&eacute;rieurement DOIVENT &ecirc;tre rapport&eacute;es dans un message, comme expos&eacute; au paragraphe 4.4. </p>
<p>Lorsque le serveur SMTP accepte un message &agrave; relayer ou pour livraison finale, il ins&egrave;re un enregistrement de trace (aussi appel&eacute; de fa&ccedil;on interchangeable une &quot;ligne d&rsquo;horodatage&quot; ou ligne &quot;Received&quot;) au sommet des donn&eacute;es de messagerie. Cet enregistrement de trace indique l&rsquo;identit&eacute; de l&rsquo;h&ocirc;te qui envoie le message, l&rsquo;identit&eacute; de l&rsquo;h&ocirc;te qui re&ccedil;oit le message (et qui ins&egrave;re l&rsquo;horodatage), et la date et l&rsquo;heure de r&eacute;ception du message. Les messages relay&eacute;s auront plusieurs lignes d&rsquo;horodatage. Des pr&eacute;cisons sur la formation de ces lignes, y compris leur syntaxe, figurent au paragraphe 4.4. </p>
<p>Un expos&eacute; suppl&eacute;mentaire sur le fonctionnement de la commande DATA figure au paragraphe 3.3. </p>
<p>Syntaxe :<br>
&quot;DATA&quot; CRLF </p>
<p><strong> 4.1.1.5 REINITIALISER (RSET) </strong></p>
<p> Cette commande sp&eacute;cifie que la transaction de messagerie en cours va &ecirc;tre interrompue. Tout envoyeur, receveur, et donn&eacute;es de messagerie m&eacute;moris&eacute;s DOIVENT &ecirc;tre &eacute;limin&eacute;s, et toutes les m&eacute;moires tampon et tableaux d&rsquo;&eacute;tat vid&eacute;s. Le receveur DOIT envoyer une r&eacute;ponse &quot;250 OK&quot; &agrave; une commande RSET sans argument. Une commande de r&eacute;initialisation peut &ecirc;tre produite par le client &agrave; tout moment. Elle est effectivement &eacute;quivalente &agrave; un NOOP (c&rsquo;est-&agrave;-dire, si elle n&rsquo;a pas d&rsquo;effet) si elle est produite imm&eacute;diatement apr&egrave;s EHLO, avant que EHLO soit produit dans la session, apr&egrave;s l&rsquo;envoi et l&rsquo;accus&eacute; de r&eacute;ception d&rsquo;un indicateur de fin de donn&eacute;es, ou imm&eacute;diatement avant un QUIT. Un serveur SMTP NE DOIT PAS clore la connexion en r&eacute;sultat de la r&eacute;ception d&rsquo;un RSET ; cette action est r&eacute;serv&eacute;e pour QUIT (voir le paragraphe&nbsp;4.1.1.10). </p>
<p>Comme EHLO implique un traitement et une r&eacute;ponse suppl&eacute;mentaires du serveur, RSET sera normalement plus efficace que de reproduire cette commande, m&ecirc;me si leur s&eacute;mantique formelle est identique. </p>
<p>Il y a des circonstances, contraires aux intentions de la pr&eacute;sente sp&eacute;cification, dans lesquelles un serveur SMTP peut recevoir l&rsquo;indication que la connexion TCP sous-jacente a &eacute;t&eacute; close ou r&eacute;initialis&eacute;e. Pour pr&eacute;server la robustesse du syst&egrave;me de messagerie, les serveurs SMTP DEVRAIENT &ecirc;tre pr&ecirc;ts pour cette condition et DEVRAIENT la traiter comme si un QUIT avait &eacute;t&eacute; re&ccedil;u avant que la connexion ne disparaisse. </p>
<p>Syntaxe : <br>
&quot;RSET&quot; CRLF </p>
<p><strong> 4.1.1.6 V&Eacute;RIFIER (VRFY) </strong></p>
<p> Cette commande demande au receveur de confirmer que l&rsquo;argument identifie un usager ou une bo&icirc;te &agrave; lettres. Si c&rsquo;est un nom d&rsquo;utilisateur, l&rsquo;information est retourn&eacute;e comme sp&eacute;cifi&eacute; au paragraphe 3.5. </p>
<p>Cette commande n&rsquo;a pas d&rsquo;effet sur la m&eacute;moire tampon de chemin inverse, la m&eacute;moire tampon de chemin de transmission, ni sur la m&eacute;moire tampon de donn&eacute;es de messagerie. </p>
<p>Syntaxe : <br>
&quot;VRFY&quot; SP Cha&icirc;ne CRLF </p>
<p><strong> 4.1.1.7 EXPAND (EXPN) </strong></p>
<p> Cette commande demande au receveur de confirmer que l&rsquo;argument identifie une liste de diffusion, et s&rsquo;il en est ainsi, de retourner les adh&eacute;rents de cette liste. Si la commande r&eacute;ussit, une r&eacute;ponse est retourn&eacute;e qui contient les informations telles que d&eacute;crites au paragraphe 3.5. Cette r&eacute;ponse aura plusieurs lignes except&eacute; dans le cas trivial d&rsquo;une liste d&rsquo;un seul membre. </p>
<p>Cette commande n&rsquo;a pas d&rsquo;effet sur la m&eacute;moire tampon de chemin inverse, la m&eacute;moire tampon de chemin de transmission, ni sur la m&eacute;moire tampon de donn&eacute;es de messagerie et peut &ecirc;tre produite &agrave; tout moment. </p>
<p>Syntaxe : <br>
&quot;EXPN&quot; SP String CRLF </p>
<p><strong> 4.1.1.8 AIDE (HELP) </strong></p>
<p> Cette commande am&egrave;ne le serveur &agrave; envoyer des informations utiles au client. La commande PEUT prendre un argument (par exemple, tout nom de commande) et retourner en r&eacute;ponse des informations plus sp&eacute;cifiques. </p>
<p>Cette commande n&rsquo;a pas d&rsquo;effet sur la m&eacute;moire tampon de chemin inverse, la m&eacute;moire tampon de chemin de transmission, ni sur la m&eacute;moire tampon de donn&eacute;es de messagerie et peut &ecirc;tre produite &agrave; tout moment. </p>
<p>Les serveurs SMTP DEVRAIENT accepter HELP sans arguments et PEUVENT l&rsquo;accepter avec des arguments. </p>
<p>Syntaxe : <br>
&quot;HELP&quot; [ SP String ] CRLF </p>
<p><strong> 4.1.1.9 NOOP (NOOP) </strong></p>
<p> Cette commande n&rsquo;affecte aucun param&egrave;tre ou commande faite pr&eacute;c&eacute;demment. Elle ne sp&eacute;cifie aucune action autre que l'envoi d&rsquo;une r&eacute;ponse OK par le receveur. </p>
<p>Cette commande n&rsquo;a pas d&rsquo;effet sur la m&eacute;moire tampon de chemin inverse, la m&eacute;moire tampon de chemin de transmission, ni sur la m&eacute;moire tampon de donn&eacute;es de messagerie et peut &ecirc;tre produite &agrave; tout moment. Si une cha&icirc;ne de param&egrave;tres est sp&eacute;cifi&eacute;e, les serveurs DEVRAIT l'ignorer. </p>
<p>Syntaxe : <br>
&quot;NOOP&quot; [ SP String ] CRLF </p>
<p><strong> 4.1.1.10 QUITTER (QUIT) </strong></p>
<p> Cette commande sp&eacute;cifie que le receveur DOIT envoyer une r&eacute;ponse OK, puis clore le canal de transmission. </p>
<p>Le receveur NE DOIT PAS clore intentionnellement le canal de transmission avant de recevoir une commande QUIT et y avoir r&eacute;pondu (m&ecirc;me si c&rsquo;&eacute;tait une erreur). L&rsquo;envoyeur NE DOIT PAS clore intentionnellement le canal de transmission avant d&rsquo;avoir envoy&eacute; une commande QUIT et DEVRAIT attendre jusqu&rsquo;&agrave; recevoir la r&eacute;ponse (m&ecirc;me si c&rsquo;&eacute;tait une r&eacute;ponse d&rsquo;erreur &agrave; une commande pr&eacute;c&eacute;dente). Si la connexion est close pr&eacute;matur&eacute;ment &agrave; cause d&rsquo;une violation de ce qui figure ci-dessus ou d&rsquo;une d&eacute;faillance du syst&egrave;me ou du r&eacute;seau, le serveur DOIT annuler toute transaction en cours, mais ne doit pas d&eacute;faire une transaction pr&eacute;c&eacute;demment achev&eacute;e, et DOIT g&eacute;n&eacute;ralement agir comme si la commande ou transaction en cours avait re&ccedil;u une erreur temporaire (c&rsquo;est-&agrave;-dire, une r&eacute;ponse 4yz). </p>
<p>La commande QUIT peut &ecirc;tre produite &agrave; tout moment. </p>
<p>Syntaxe : <br>
&quot;QUIT&quot; CRLF </p>
<h3><a name="_Toc186287749"></a><a name="_Toc186079775"> 4.1.2 Syntaxe de l&rsquo;argument de commande</a></h3>
<p> La syntaxe des champs d&rsquo;argument des commandes ci-dessus (en utilisant la syntaxe sp&eacute;cifi&eacute;e en [8] le cas &eacute;ch&eacute;ant) est donn&eacute;e ci-dessous. Certaines des constructions donn&eacute;es ci-dessous ne sont utilis&eacute;es qu&rsquo;en conjonction avec les routes de source, comme d&eacute;crit &agrave; l&rsquo;appendice C. Les caract&egrave;res terminaux non d&eacute;finis dans le pr&eacute;sent document, comme ALPHA, DIGIT, SP, CR, LF, CRLF, sont d&eacute;finis dans le &quot;c&oelig;ur&quot; de la syntaxe [8 (section 6)] ou dans la syntaxe de format de message [32]. </p>
<p>Reverse-path = Path <br>
Forward-path = Path <br>
Path = &quot;&lt;&quot; [ A-d-l &quot;:&quot; ] Mailbox &quot;&gt;&quot; <br>
A-d-l = At-domain *( &quot;,&quot; A-d-l ) <br>
; Noter que cette forme, ce qu&rsquo;on appelle la &quot;route de source&quot;, DOIT &ecirc;tre accept&eacute;e, NE DEVRAIT PAS &ecirc;tre g&eacute;n&eacute;r&eacute;e, et DEVRAIT &ecirc;tre ignor&eacute;e. <br>
At-domain = &quot;@&quot; domaine <br>
Mail-parameters = esmtp-param *(SP esmtp-param) <br>
Rcpt-parameters = esmtp-param *(SP esmtp-param) <br>
esmtp-param = esmtp-keyword [&quot;=&quot; esmtp-value] <br>
esmtp-keyword = (ALPHA / DIGIT) *(ALPHA / DIGIT / &quot;-&quot;) <br>
esmtp-value = 1*(%d33-60 / %d62-127) <br>
; tout caract&egrave;re sauf &quot;=&quot;, SP, et caract&egrave;res de contr&ocirc;le <br>
Keyword = Ldh-str <br>
Argument = Atom <br>
Domain = (sub-domain 1*(&quot;.&quot; sub-domain)) / address-literal <br>
sub-domain = Let-dig [Ldh-str] <br>
address-literal = &quot;[&quot; IPv4-address-literal / IPv6-address-literal / General-address-literal &quot;]&quot; <br>
; voir le paragraphe 4.1.3 <br>
Mailbox = Local-part &quot;@&quot; Domain <br>
Local-part = Dot-string / Quoted-string <br>
; PEUT &ecirc;tre sensible &agrave; la casse <br>
Dot-string = Atom *(&quot;.&quot; Atom) <br>
Atom = 1*atext <br>
Quoted-string = DQUOTE *qcontent DQUOTE <br>
String = Atom / Quoted-string </p>
<p>Bien que la d&eacute;finition ci-dessus pour partie-locale soit relativement permissive, pour une interop&eacute;rabilit&eacute; maximale, un h&ocirc;te qui s&rsquo;attend &agrave; recevoir des messages DEVRAIT &eacute;viter de d&eacute;finir des bo&icirc;tes &agrave; lettres o&ugrave; la partie locale aurait besoin de (ou utiliserait) la forme Cha&icirc;ne entre guillemets <em>(Quoted-string)</em> ou o&ugrave; la partie locale serait sensible &agrave; la casse. Pour tout ce qui est de g&eacute;n&eacute;rer ou comparer des parties locales (par exemple, &agrave; la recherche de noms de bo&icirc;te &agrave; lettres sp&eacute;cifiques), toutes les formes entre guillemets DOIVENT &ecirc;tre trait&eacute;es comme &eacute;quivalentes et le syst&egrave;me d&rsquo;envoi DEVRAIT transmettre la forme qui utilise le minimum de citations possible. </p>
<p>Les syst&egrave;mes NE DOIVENT PAS d&eacute;finir de bo&icirc;tes &agrave; lettres d&rsquo;une fa&ccedil;on qui exige l&rsquo;utilisation de caract&egrave;res non ASCII en SMTP (octets avec le bit de plus fort poids mis &agrave; un) ou &quot;de caract&egrave;res de contr&ocirc;le&quot; ASCII (valeur d&eacute;cimale de 0 &agrave; 31 et 127). Ces caract&egrave;res NE DOIVENT PAS &ecirc;tre utilis&eacute;s dans les commandes MAIL ou RCTP ou dans d&rsquo;autres commandes qui r&eacute;clament des noms de bo&icirc;te &agrave; lettres. </p>
<p>Noter que la barre oblique inverse, &quot;\&quot;, est un caract&egrave;re d&eacute;claratif, qui est utilis&eacute; pour indiquer que le prochain caract&egrave;re est &agrave; utiliser litt&eacute;ralement (au lieu de son interpr&eacute;tation normale). Par exemple, &quot;Joe\,Smith&quot; indique un seul champ d&rsquo;utilisateur de neuf caract&egrave;res o&ugrave; la virgule est le quatri&egrave;me caract&egrave;re du champs. </p>
<p>Pour promouvoir l&rsquo;interop&eacute;rabilit&eacute; et en coh&eacute;rence avec les plus anciennes directives pour une utilisation prudente du syst&egrave;me DNS dans les d&eacute;nominations et les applications (par exemple, voir le paragraphe 2.3.1 du document de base DNS, la RFC 1035 [22]), les caract&egrave;res en dehors de l&rsquo;ensemble de l&rsquo;alphabet, des chiffres, et des tirets NE DOIVENT PAS appara&icirc;tre dans les marqueurs de nom de domaine pour les clients ou les serveurs SMTP. En particulier, le caract&egrave;re soulign&eacute; <em>(underscore)</em> n&rsquo;est pas permis. Les serveurs SMTP qui re&ccedil;oivent une commande dans laquelle des codes de caract&egrave;re invalides ont &eacute;t&eacute; utilis&eacute;s, et pour lesquels il n&rsquo;y aurait pas d&rsquo;autres raisons de rejet, DOIVENT rejeter cette commande avec une r&eacute;ponse 501. </p>
<h3><a name="_Toc186287750"></a><a name="_Toc186079776"> 4.1.3 Adresses litt&eacute;rales</a></h3>
<p> Parfois, un h&ocirc;te n&rsquo;est pas connu du syst&egrave;me de nom de domaine et la communication (et, en particulier, la communication pour rapporter et r&eacute;parer l&rsquo;erreur) est bloqu&eacute;e. Pour franchir cette barri&egrave;re, une forme litt&eacute;rale particuli&egrave;re de l&rsquo;adresse est permise comme solution de remplacement pour un nom de domaine. Pour les adresses IPv4, cette forme utilise quatre petits entiers d&eacute;cimaux s&eacute;par&eacute;s par des points et entour&eacute;s de crochets tels que [123.255.37.2], qui indique une adresse Internet (IPv4) en forme de s&eacute;quence d&rsquo;octets. Pour IPv6 et autres formes d&rsquo;adressage qui pourraient &eacute;ventuellement &ecirc;tre normalis&eacute;es, la forme consiste en un &quot;marqueur&quot; normalis&eacute; qui identifie la syntaxe de l&rsquo;adresse, deux points, et l&rsquo;adresse elle-m&ecirc;me, dans un format sp&eacute;cifi&eacute; au titre de la norme IPv6 [17]. </p>
<p>Pr&eacute;cis&eacute;ment : <br>
IPv4-address-literal = Snum 3(&quot;.&quot; Snum) <br>
IPv6-address-literal = &quot;IPv6:&quot; IPv6-addr <br>
General-address-literal = Standardized-tag &quot;:&quot; 1*dcontent <br>
Standardized-tag = Ldh-str <br>
; DOIT &ecirc;tre sp&eacute;cifi&eacute; dans une RFC en cours de normalisation et enregistr&eacute; aupr&egrave;s de l&rsquo;IANA </p>
<p>Snum = 1*3DIGIT ; repr&eacute;sentant une valeur d&rsquo;entier d&eacute;cimal dans la gamme de 0 &agrave; 255 <br>
Let-dig = ALPHA / DIGIT <br>
Ldh-str = *( ALPHA / DIGIT / &quot;-&quot; ) Let-dig </p>
<p>IPv6-addr = IPv6-full / IPv6-comp / IPv6v4-full / IPv6v4-comp <br>
IPv6-hex = 1*4HEXDIG <br>
IPv6-full = IPv6-hex 7(&quot;:&quot; IPv6-hex) <br>
IPv6-comp = [IPv6-hex *5(&quot;:&quot; IPv6-hex)] &quot;::&quot; [IPv6-hex *5(&quot;:&quot; IPv6-hex)] <br>
; Le &quot;::&quot; repr&eacute;sente au moins deux groupes de 16 bits de z&eacute;ros. Pas plus de 6 groupes en plus de &quot;::&quot; ne peuvent &ecirc;tre pr&eacute;sents <br>
IPv6v4-full = IPv6-hex 5(&quot;:&quot; IPv6-hex) &quot;:&quot; IPv4-address-literal <br>
IPv6v4-comp = [IPv6-hex *3(&quot;:&quot; IPv6-hex)] &quot;::&quot; [IPv6-hex *3(&quot;:&quot; IPv6-hex) &quot;:&quot;] IPv4-address-literal <br>
; Le &quot;::&quot; repr&eacute;sente au moins deux groupes de 16 bits de z&eacute;ros. Pas plus de 4 groupes en plus de &quot;::&quot; et de l&rsquo;adresse litt&eacute;rale IPv4 ne peuvent &ecirc;tre pr&eacute;sents. </p>
<h3><a name="_Toc186287751"></a><a name="_Toc186079777"> 4.1.4 Ordre des commandes</a></h3>
<p> Il y a des restrictions sur l&rsquo;ordre dans lequel ces commandes peuvent &ecirc;tre utilis&eacute;es. </p>
<p>Une session qui va contenir des transactions de messagerie DOIT d&rsquo;abord &ecirc;tre initialis&eacute;e par l&rsquo;utilisation de la commande EHLO. Un serveur SMTP DEVRAIT accepter des commandes pour des non-transactions de messagerie (par exemple, VRFY ou EXPN) sans cette initialisation. </p>
<p>Une commande EHLO PEUT &ecirc;tre produite par un client plus tard dans la session. Si elle est produite apr&egrave;s le d&eacute;but de la session, le serveur SMTP DOIT vider toutes les m&eacute;moires tampon et r&eacute;initialiser l&rsquo;&eacute;tat exactement comme si une commande RSET avait &eacute;t&eacute; produite. En d&rsquo;autres termes, la s&eacute;quence de RSET suivie imm&eacute;diatement par EHLO est redondantes, mais sans dommage autre que dans le co&ucirc;t en performances de l&rsquo;ex&eacute;cution de commandes inutiles. </p>
<p>Si la commande EHLO n&rsquo;est pas acceptable pour le serveur SMTP, des r&eacute;ponses d&rsquo;&eacute;chec 501, 500, ou 502 DOIVENT &ecirc;tre retourn&eacute;e selon le cas appropri&eacute;. Le serveur SMTP DOIT rester dans le m&ecirc;me &eacute;tat apr&egrave;s la transmission de ces r&eacute;ponses que celui o&ugrave; il &eacute;tait avant la r&eacute;ception du EHLO. </p>
<p>Le client SMTP DOIT, si possible, s&rsquo;assurer que le param&egrave;tre domaine pour la commande EHLO est un nom d&rsquo;h&ocirc;te principal valide (pas un CNAME ou un nom MX) pour son h&ocirc;te. Si ce n&rsquo;est pas possible (par exemple, lorsque l&rsquo;adresse du client est allou&eacute;e de fa&ccedil;on dynamique et que le client n&rsquo;a pas un nom &eacute;vident), une adresse litt&eacute;rale DEVRAIT &ecirc;tre substitu&eacute;e au nom de domaine et des informations suppl&eacute;mentaires fournies pour aider &agrave; l&rsquo;identification du client. </p>
<p> Un serveur SMTP PEUT v&eacute;rifier que le param&egrave;tre de nom de domaine dans la commande EHLO correspond r&eacute;ellement &agrave; l&rsquo;adresse IP du client. Cependant, le serveur NE DOIT PAS refuser d&rsquo;accepter un message pour cette raison si la v&eacute;rification &eacute;choue : l&rsquo;information sur l&rsquo;&eacute;chec de la v&eacute;rification n&rsquo;est que pour la journalisation et le tra&ccedil;age. </p>
<p>Les commandes NOOP, HELP, EXPN, VRFY, et RSET peuvent &ecirc;tre utilis&eacute;es &agrave; tout moment durant une session, ou sans avoir pr&eacute;alablement initialis&eacute; une session. Les serveurs SMTP DEVRAIENT les traiter normalement (c&rsquo;est-&agrave;-dire, ne pas retourner un code 503) m&ecirc;me si aucune commande EHLO n&rsquo;a encore &eacute;t&eacute; re&ccedil;ue ; les clients DEVRAIENT ouvrir une session avec EHLO avant d&rsquo;envoyer ces commandes. </p>
<p>Si ces r&egrave;gles sont suivies, l&rsquo;exemple de la RFC 821 qui donne &quot;550 L&rsquo;acc&egrave;s vous est refus&eacute;&quot; en r&eacute;ponse &agrave; une commande EXPN est incorrect sauf si une commande EHLO pr&eacute;c&egrave;de le EXPN ou si le refus d&rsquo;acc&egrave;s se fonde sur l&rsquo;adresse IP du client ou autre m&eacute;canisme d&rsquo;authentification ou de d&eacute;termination d&rsquo;autorisation. </p>
<p>La commande MAIL (ou les commandes obsol&egrave;tes SEND, SOML, ou SAML) commence une transaction de messagerie. Une fois commenc&eacute;e, une transaction de messagerie consiste en une commande de d&eacute;but de transaction, une ou plusieurs commandes RCTP, et une commande DATA, dans cet ordre. une transaction de messagerie peut &ecirc;tre interrompue par une commande RSET (ou une nouvelle commande EHLO). Il peut y avoir z&eacute;ro, une, ou plusieurs transactions dans une session. MAIL (ou SEND, SOML, ou SAML) NE DOIT PAS &ecirc;tre envoy&eacute; si une transaction de messagerie est d&eacute;j&agrave; ouverte, c&rsquo;est-&agrave;-dire qu&rsquo;elle ne devrait &ecirc;tre envoy&eacute;e que si aucune transaction de messagerie n&rsquo;a d&eacute;but&eacute; dans la session, ou si la pr&eacute;c&eacute;dente s&rsquo;est bien termin&eacute;e avec la r&eacute;ussite d&rsquo;une commande DATA, ou si la pr&eacute;c&eacute;dente a &eacute;t&eacute; interrompue avec un RSET. </p>
<p>Si l&rsquo;argument de commande de d&eacute;but de transaction n&rsquo;est pas acceptable, une r&eacute;ponse d&rsquo;&eacute;chec 501 DOIT &ecirc;tre retourn&eacute;e et le serveur SMTP DOIT rester dans le m&ecirc;me &eacute;tat. Si les commandes d&rsquo;une transaction sont dans un tel d&eacute;sordre qu&rsquo;elles ne puissent &ecirc;tre trait&eacute;es par le serveur, une r&eacute;ponse d&rsquo;&eacute;chec 503 DOIT &ecirc;tre retourn&eacute;e et le serveur SMTP DOIT rester dans le m&ecirc;me &eacute;tat. </p>
<p>La derni&egrave;re commande dans une session DOIT &ecirc;tre la commande QUIT. La commande QUIT ne peut pas &ecirc;tre utilis&eacute;e &agrave; un autre moment de la session, mais DEVRAIT &ecirc;tre utilis&eacute;e par le client SMTP pour demander la cl&ocirc;ture de connexion, m&ecirc;me lorsque aucune commande d&rsquo;ouverture de session n&rsquo;avait &eacute;t&eacute; envoy&eacute;e ni accept&eacute;e. </p>
<h3><a name="_Toc186287752"></a><a name="_Toc186079778"> 4.1.5 Commandes d&rsquo;utilisation priv&eacute;e</a></h3>
<p> Comme sp&eacute;cifi&eacute; au paragraphe 2.2.2, les commandes qui commencent par &quot;X&quot; peuvent &ecirc;tre utilis&eacute;es par accord bilat&eacute;ral entre les agents SMTP client (envoyeur) et serveur (receveur). Un serveur SMTP qui ne reconna&icirc;t pas de telles commandes est cens&eacute; r&eacute;pondre par &quot;500 Commande non reconnue&quot;. Un serveur SMTP avec extensions PEUT faire la liste des noms des dispositifs associ&eacute;s &agrave; ces commandes priv&eacute;es dans la r&eacute;ponse &agrave; la commande EHLO. </p>
<p>Les commandes envoy&eacute;es ou accept&eacute;es par les syst&egrave;mes SMTP, qui ne commencent pas par &quot;X&quot; DOIVENT se conformer aux exigences du paragraphe 2.2.2. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287753"></a><a name="_Toc186079879"></a><a name="_Toc186079779"> 4.2 R&eacute;ponses SMTP</a></h2>
<p> Les r&eacute;ponses aux commandes SMTP servent &agrave; s&rsquo;assurer de la synchronisation des demandes et des actions dans le processus de transfert de messagerie et &agrave; garantir que le client SMTP conna&icirc;t toujours l&rsquo;&eacute;tat du serveur SMTP. Chaque commande DOIT g&eacute;n&eacute;rer exactement une r&eacute;ponse. </p>
<p>Les d&eacute;tails de la s&eacute;quence commande-r&eacute;ponse sont d&eacute;crits au paragraphe 4.3. </p>
<p>Une r&eacute;ponse SMTP consiste en un nombre de trois chiffres (transmis comme trois caract&egrave;res num&eacute;riques) suivi par du texte, sauf sp&eacute;cification contraire dans le pr&eacute;sent document. Le nombre est utilis&eacute; par un automate pour d&eacute;terminer dans quel &eacute;tat entrer ensuite ; le texte est destin&eacute; &agrave; l&rsquo;utilisateur humain. Les trois chiffres contiennent assez d&rsquo;information cod&eacute;e pour que le client SMTP n&rsquo;ait pas besoin d&rsquo;examiner le texte et puisse soit l&rsquo;&eacute;liminer soit le passer &agrave; l&rsquo;usager, en tant que de besoin. Les exceptions sont celles not&eacute;es par ailleurs dans le pr&eacute;sent document. En particulier, les codes de r&eacute;ponse 220, 221, 251, 421, et 551 sont associ&eacute;s au texte du message qui doit &ecirc;tre analys&eacute; et interpr&eacute;t&eacute; par les machines. Dans le cas g&eacute;n&eacute;ral, le texte peut d&eacute;pendre du receveur et du contexte, aussi y aura-t-il vraisemblablement des textes diff&eacute;rents pour chaque code de r&eacute;ponse. Un expos&eacute; sur la th&eacute;orie des codes de r&eacute;ponse figure au paragraphe 4.2.1. Formellement, une r&eacute;ponse est d&eacute;finie comme la s&eacute;quence : un code &agrave; trois chiffres, &lt;SP&gt;, une ligne de texte, et &lt;CRLF&gt;, ou une r&eacute;ponse multi lignes (comme d&eacute;fini au paragraphe 4.2.1). Comme, en violation de la pr&eacute;sente sp&eacute;cification, le texte n&rsquo;est parfois pas envoy&eacute;, les clients qui ne le re&ccedil;oivent pas DEVRAIENT &ecirc;tre pr&ecirc;ts &agrave; traiter le code seul (avec ou sans caract&egrave;re espace en queue). Seules les commandes EHLO, EXPN, et HELP sont suppos&eacute;es r&eacute;sulter en r&eacute;ponses multi lignes dans des circonstances normales, cependant, des r&eacute;ponses multi lignes sont permises pour toutes les commandes. </p>
<p>En ABNF, les r&eacute;ponses de serveur sont : <br>
Accueil = &quot;220 &quot; Domaine [ SP texte ] CRLF <br>
Ligne de r&eacute;ponse = Code-de-r&eacute;ponse [ SP texte ] CRLF </p>
<p> o&ugrave; &quot;Accueil&quot; n&rsquo;appara&icirc;t que dans la r&eacute;ponse 220 qui annonce que le serveur ouvre sa partie de la connexion. </p>
<p>Un serveur SMTP DEVRAIT n&rsquo;envoyer que les codes de r&eacute;ponse dont la liste figure dans le pr&eacute;sent document. Un serveur SMTP DEVRAIT utiliser le texte donn&eacute; dans les exemples chaque fois que c&rsquo;est appropri&eacute;. </p>
<p>Un client SMTP ne DOIT d&eacute;terminer ses actions que par le code de r&eacute;ponse, et non par le texte (except&eacute; pour le &quot;changement d&rsquo;adresse&quot; 251 et 551 et, si n&eacute;cessaire, les r&eacute;ponses 220, 221, et 421) ; dans le cas g&eacute;n&eacute;ral, tout texte, y compris pas de texte du tout (bien que les envoyeurs NE DEVRAIENT PAS envoyer de codes nus) DOIT &ecirc;tre acceptable. L&rsquo;espace (blanche) qui suit le code de r&eacute;ponse est consid&eacute;r&eacute;e comme partie du texte. Chaque fois que possible, un receveur- SMTP DEVRAIT v&eacute;rifier le premier chiffre (indication de s&eacute;v&eacute;rit&eacute;) du code de r&eacute;ponse. </p>
<p>La liste des codes qui est donn&eacute;e ci-dessous NE DOIT PAS &ecirc;tre une construction permanente. Bien que l&rsquo;ajout de nouveaux codes devrait &ecirc;tre une activit&eacute; rare et significative, des informations suppl&eacute;mentaires dans la partie textuelle de la r&eacute;ponse &eacute;tant pr&eacute;f&eacute;r&eacute;es, de nouveaux codes peuvent &ecirc;tre ajout&eacute;s par suite de nouvelles sp&eacute;cifications normalis&eacute;es ou en cours de normalisations. Par cons&eacute;quent, un envoyeur SMTP DOIT &ecirc;tre pr&ecirc;t &agrave; traiter des codes non sp&eacute;cifi&eacute;s dans le pr&eacute;sent document et DOIT le faire en interpr&eacute;tant seulement le premier chiffre. </p>
<h3><a name="_Toc186287754"></a><a name="_Toc186079780"> 4.2.1 S&eacute;v&eacute;rit&eacute; et th&eacute;orie des codes de r&eacute;ponse</a></h3>
<p> Les trois chiffres de la r&eacute;ponse ont chacun une signification particuli&egrave;re. Le premier chiffre note si la r&eacute;ponse est bonne, mauvaise ou incompl&egrave;te. Un client SMTP non sophistiqu&eacute; , ou qui re&ccedil;oit un code inattendu, sera capable de d&eacute;terminer sa prochaine action (proc&eacute;der comme pr&eacute;vu, refaire, retrancher, etc.) en examinant ce premier chiffre. Un client SMTP qui veut savoir approximativement quel type d&rsquo;erreur est survenu (par exemple, erreur du syst&egrave;me de messagerie, erreur de commande, erreur de syntaxe) peut examiner le second chiffre. Le troisi&egrave;me chiffre et toutes les informations suppl&eacute;mentaires qui peuvent &ecirc;tre pr&eacute;sentes sont r&eacute;serv&eacute;es au plus fin degr&eacute; d&rsquo;information. </p>
<p>Il y a cinq valeurs pour le premier chiffre de code de r&eacute;ponse : </p>
<p> 1yz R&eacute;ponse pr&eacute;liminaire positive <br>
La commande a &eacute;t&eacute; accept&eacute;e, mais l&rsquo;action demand&eacute;e est gard&eacute;e en suspens, en attendant confirmation des informations contenues dans cette r&eacute;ponse. Le client SMTP devrait envoyer une autre commande pour sp&eacute;cifier de continuer ou d&rsquo;interrompre l&rsquo;action. Note : SMTP sans extension n&rsquo;a aucune commande qui permette ce type de r&eacute;ponse, et n&rsquo;a donc pas de commande pour continuer ou interrompre. </p>
<p> 2yz R&eacute;ponse d&rsquo;ach&egrave;vement positif <br>
L&rsquo;action demand&eacute;e a &eacute;t&eacute; termin&eacute;e avec succ&egrave;s. Une nouvelle demande peut &ecirc;tre initi&eacute;e. </p>
<p> 3yz R&eacute;ponse interm&eacute;diaire positive <br>
La commande a &eacute;t&eacute; accept&eacute;e, mais l&rsquo;action demand&eacute;e est gard&eacute;e en suspens, en attendant la r&eacute;ception d&rsquo;informations ult&eacute;rieures. Le client SMTP devrait envoyer une autre commande sp&eacute;cifiant cette information. Cette r&eacute;ponse est utilis&eacute;e dans des groupes de s&eacute;quences de commandes (c&rsquo;est-&agrave;-dire, dans DATA). </p>
<p> 4yz R&eacute;ponse provisoire d&rsquo;ach&egrave;vement n&eacute;gative <br>
La commande n&rsquo;a pas &eacute;t&eacute; accept&eacute;e, et l&rsquo;action demand&eacute;e ne s&rsquo;est pas produite. Cependant, la condition d&rsquo;erreur est temporaire et l&rsquo;action peut &ecirc;tre demand&eacute;e &agrave; nouveau. L&rsquo;envoyeur devrait retourner au d&eacute;but de la s&eacute;quence de commande (s&rsquo;il en est). Il est difficile d&rsquo;allouer une signification &agrave; &quot;provisoire&quot; lorsque deux sites diff&eacute;rents (agents SMTP receveur et envoyeur) doivent se mettre d&rsquo;accord sur son interpr&eacute;tation. Chaque r&eacute;ponse de cette cat&eacute;gorie peut avoir une valeur temporelle diff&eacute;rente, mais le client SMTP est encourag&eacute; &agrave; r&eacute;essayer. Une r&egrave;gle approximative pour d&eacute;terminer si une r&eacute;ponse va dans la cat&eacute;gorie 4yz ou 5yz (voir ci-dessous) est que les r&eacute;ponses sont 4yz si elles peuvent r&eacute;ussir en &eacute;tant r&eacute;p&eacute;t&eacute;es sans aucun changement de la forme de la commande ou dans les propri&eacute;t&eacute;s de l&rsquo;envoyeur ou du receveur (c&rsquo;est-&agrave;-dire que la commande est r&eacute;p&eacute;t&eacute;e &agrave; l&rsquo;identique et que le receveur ne lance pas une nouvelle mise en &oelig;uvre.) </p>
<p> 5yz R&eacute;ponse permanente d&rsquo;ach&egrave;vement n&eacute;gative <br>
La commande n&rsquo;a pas &eacute;t&eacute; accept&eacute;e et l&rsquo;action demand&eacute;e ne s&rsquo;est pas produite. Il est d&eacute;conseill&eacute; au client SMTP de r&eacute;p&eacute;ter exactement la m&ecirc;me demande (dans la m&ecirc;me s&eacute;quence). M&ecirc;me certaines conditions d&rsquo;erreur &quot;permanentes&quot; peuvent &ecirc;tre corrig&eacute;es, aussi l&rsquo;utilisateur humain peut vouloir indiquer au client SMTP de r&eacute;initialiser la commande par une action directe dans un moment (par exemple, apr&egrave;s avoir chang&eacute; la r&eacute;daction, ou que l&rsquo;utilisateur ait chang&eacute; l&rsquo;&eacute;tat du compte). </p>
<p>Le second chiffre code les r&eacute;ponses dans des cat&eacute;gories sp&eacute;cifiques : <br>
x0z Syntaxe : Ces r&eacute;ponses se r&eacute;f&egrave;rent &agrave; des erreurs de syntaxe, &agrave; des commandes syntaxiquement correctes qui ne correspondent &agrave; aucune cat&eacute;gorie fonctionnelle, et &agrave; des commandes non mises en &oelig;uvre ou superflues. <br>
x1z Information : Ce sont des r&eacute;ponses &agrave; des demandes d&rsquo;information, comme sur l&rsquo;&eacute;tat ou pour de l&rsquo;aide. <br>
x2z Connexions : Ce sont des r&eacute;ponses qui se rapportent au canal de transmission. <br>
x3z Non sp&eacute;cifi&eacute;. <br>
x4z Non sp&eacute;cifi&eacute;. <br>
x5z Syst&egrave;me de messagerie : Ces r&eacute;ponses indiquent le statut du syst&egrave;me de messagerie du receveur vis &agrave; vis du transfert demand&eacute; ou autre action du syst&egrave;me de messagerie. </p>
<p>Le troisi&egrave;me chiffre donne une gradation plus fine de la signification dans chaque cat&eacute;gorie sp&eacute;cifi&eacute;e apr&egrave;s le second chiffre. La liste des r&eacute;ponses illustre cela. Chaque texte de r&eacute;ponse est recommand&eacute; plut&ocirc;t qu&rsquo;obligatoire, et peut m&ecirc;me changer selon la commande &agrave; laquelle il est associ&eacute;. D&rsquo;un autre c&ocirc;t&eacute;, les codes de r&eacute;ponse doivent suivre strictement les sp&eacute;cifications de ce paragraphe. Les mises en &oelig;uvre de receveur ne devraient pas inventer de nouveaux codes pour des situations l&eacute;g&egrave;rement diff&eacute;rentes de celles d&eacute;crites ici, mais plut&ocirc;t adapter les codes d&eacute;j&agrave; d&eacute;finis. </p>
<p>Par exemple, une commande telle que NOOP, dont la bonne ex&eacute;cution n&rsquo;offre au client SMTP aucune nouvelle information, va retourner une r&eacute;ponse 250. La r&eacute;ponse est 502 lorsque la commande demande une action non sp&eacute;cifique du site non mise en &oelig;uvre. Un raffinement est la r&eacute;ponse 504 pour une commande qui est mise en &oelig;uvre, mais demande un param&egrave;tre non mis en &oelig;uvre. </p>
<p>Le texte de la r&eacute;ponse peut &ecirc;tre sur plus d&rsquo;une ligne ; dans ce cas, le texte complet doit &ecirc;tre marqu&eacute; comme tel pour que le client SMTP sache quand il peut cesser de lire la r&eacute;ponse. Cela exige un format sp&eacute;cial pour indiquer une r&eacute;ponse multi lignes. </p>
<p>Le format des r&eacute;ponses multi lignes exige que chaque ligne, sauf la derni&egrave;re, commence par le code de r&eacute;ponse, suivi imm&eacute;diatement par un tiret, &quot;-&quot; (appel&eacute;s aussi moins), suivi par le texte. La derni&egrave;re ligne commencera par le code de r&eacute;ponse, suivi imm&eacute;diatement par &lt;SP&gt;, du teste facultatif, et &lt;CRLF&gt;. Comme not&eacute; ci-dessus, les serveurs DEVRAIENT envoyer le &lt;SP&gt; si du texte ne suit pas, mais les clients DOIVENT &ecirc;tre pr&ecirc;ts s&rsquo;il est omis. </p>
<p>Par exemple: <br>
123-Premi&egrave;re ligne <br>
123-Seconde ligne <br>
123-234 Texte commen&ccedil;ant par des nombres <br>
123 Derni&egrave;re ligne </p>
<p>Dans de nombreux cas, le client SMTP a simplement alors besoin de chercher une ligne commen&ccedil;ant par le code de r&eacute;ponse suivi par &lt;SP&gt; ou &lt;CRLF&gt; et d&rsquo;ignorer toutes les lignes pr&eacute;c&eacute;dentes. Dans quelques cas, il y a des donn&eacute;es importantes pour le client dans le &quot;texte&quot; de r&eacute;ponse. Le client sera capable d&rsquo;identifier ces cas d&rsquo;apr&egrave;s le contexte. </p>
<h3><a name="_Toc186287755"></a><a name="_Toc186079781"> 4.2.2 Codes de r&eacute;ponse par groupes de fonction</a></h3>
<p> 500 Erreur de syntaxe, commande non reconnue (Cela peut inclure des erreurs telles que Ligne de commande trop longue) <br>
501 Erreur de syntaxe dans les param&egrave;tres ou les arguments <br>
502 Commande non mise en &oelig;uvre (voir au paragraphe 4.2.4) <br>
503 Mauvaise s&eacute;quence de commandes <br>
504 Param&egrave;tre de commande non mis en &oelig;uvre <br>
211 &Eacute;tat du syst&egrave;me, ou r&eacute;ponse d&rsquo;aide au syst&egrave;me <br>
214 Message d&rsquo;appel au secours (Informations sur la fa&ccedil;on d&rsquo;utiliser le receveur ou sur la signification d&rsquo;une commande particuli&egrave;re non standard ; cette r&eacute;ponse n&rsquo;est utile que pour l&rsquo;usager humain) <br>
220 Service &lt;domaine&gt; pr&ecirc;t <br>
221 Service&lt;domaine&gt; ferme le canal de transmission <br>
421 Service&lt;domaine&gt; non disponible, ferme le canal de transmission (Ce peut &ecirc;tre une r&eacute;ponse &agrave; toute commande si le service sait qu&rsquo;il doit fermer) <br>
250 Action de messagerie demand&eacute;e correcte, termin&eacute;e <br>
251 Usager non local ; sera transmis &agrave; &lt;chemin de transmission&gt; (Voir au paragraphe 3.4) <br>
252 Impossible de v&eacute;rifier (VRFY) l&rsquo;usager, mais acceptera le message et tente la livraison (Voir au paragraphe 3.5.3) <br>
450 Action de messagerie demand&eacute;e non effectu&eacute;e : bo&icirc;te &agrave; lettres indisponible (par exemple, bo&icirc;te &agrave; lettres occup&eacute;e) <br>
550 Action de messagerie demand&eacute;e non effectu&eacute;e : bo&icirc;te &agrave; lettres indisponible (par exemple, bo&icirc;te &agrave; lettres introuvable, pas d&rsquo;acc&egrave;s, ou commande rejet&eacute;e pour des raisons de politique) <br>
451 Action demand&eacute;e interrompue : erreur locale de traitement <br>
551 Usager non local ; pri&egrave;re d&rsquo;essayer &lt;chemin de transmission&gt; (Voir au paragraphe 3.4) <br>
452 Action demand&eacute;e non effectu&eacute;e : m&eacute;moire syst&egrave;me insuffisante <br>
552 Action de messagerie demand&eacute;e interrompue : allocation de m&eacute;moire d&eacute;pass&eacute;e <br>
553 Action demand&eacute;e non effectu&eacute;e : nom de bo&icirc;te &agrave; lettres interdit (par exemple, syntaxe de bo&icirc;te &agrave; lettres incorrecte) <br>
354 D&eacute;but d&rsquo;entr&eacute;e de messagerie ; fin avec &lt;CRLF&gt;.&lt;CRLF&gt; <br>
554 &Eacute;chec de transaction (Ou, dans le cas de r&eacute;ponse &agrave; ouverture de connexion, &quot;Pas de service SMTP ici&quot;) </p>
<h3><a name="_Toc186287756"></a><a name="_Toc186079782"> 4.2.3 Codes de r&eacute;ponse par ordre num&eacute;rique</a></h3>
<p> 211 &Eacute;tat du syst&egrave;me, ou r&eacute;ponse d&rsquo;aide au syst&egrave;me <br>
214 Message d&rsquo;appel au secours (Informations sur la fa&ccedil;on d&rsquo;utiliser le receveur ou sur la signification d&rsquo;une commande particuli&egrave;re non standard ; cette r&eacute;ponse n&rsquo;est utile que pour l&rsquo;usager humain) <br>
220 Service &lt;domaine&gt; pr&ecirc;t <br>
221 Service&lt;domaine&gt; ferme le canal de transmission <br>
250 Action de messagerie demand&eacute;e correcte, termin&eacute;e <br>
251 Usager non local ; sera transmis &agrave; &lt;chemin de transmission&gt; (Voir au paragraphe 3.4) <br>
252 Impossible de v&eacute;rifier (VRFY) l&rsquo;usager, mais acceptera le message et tente la livraison (Voir au paragraphe 3.5.3) <br>
354 D&eacute;but d&rsquo;entr&eacute;e de messagerie ; fin avec &lt;CRLF&gt;.&lt;CRLF&gt; <br>
421 Service&lt;domaine&gt; non disponible, ferme le canal de transmission (Ce peut &ecirc;tre une r&eacute;ponse &agrave; toute commande si le service sait qu&rsquo;il doit fermer) <br>
450 Action de messagerie demand&eacute;e non effectu&eacute;e : bo&icirc;te &agrave; lettres indisponible (par exemple, bo&icirc;te &agrave; lettres occup&eacute;e) <br>
451 Action demand&eacute;e interrompue : erreur locale de traitement <br>
452 Action demand&eacute;e non effectu&eacute;e : m&eacute;moire syst&egrave;me insuffisante <br>
500 Erreur de syntaxe, commande non reconnue (Cela peut inclure des erreurs telles que ligne de commande trop longue) <br>
501 Erreur de syntaxe dans les param&egrave;tres ou les arguments <br>
502 Commande non mise en &oelig;uvre (Voir au paragraphe 4.2.4) <br>
503 Mauvaise s&eacute;quence de commandes <br>
504 Param&egrave;tre de commande non mis en &oelig;uvre <br>
550 Action demand&eacute;e non effectu&eacute;e : bo&icirc;te &agrave; lettres indisponible (par exemple, bo&icirc;te &agrave; lettres introuvable, pas d&rsquo;acc&egrave;s, ou commande rejet&eacute;e pour des raisons de politique) <br>
551 Usager non local ; pri&egrave;re de r&eacute;essayer &lt;chemin de transmission&gt; (Voir au paragraphe 3.4) <br>
552 Action de messagerie demand&eacute;e interrompue : allocation de m&eacute;moire d&eacute;pass&eacute;e <br>
553 Action demand&eacute;e non effectu&eacute;e : nom de bo&icirc;te &agrave; lettres interdit (par exemple, syntaxe de bo&icirc;te &agrave; lettres incorrecte) <br>
554 &Eacute;chec de transaction (ou, dans le cas de r&eacute;ponse &agrave; ouverture de connexion, &quot;Pas de service SMTP ici&quot;) </p>
<h3><a name="_Toc186287757"></a><a name="_Toc186079783"> 4.2.4 Code de r&eacute;ponse 502</a></h3>
<p> Des questions se sont pos&eacute;es sur le moment o&ugrave; le code de r&eacute;ponse 502 (Commande non mise en &oelig;uvre) DEVRAIT &ecirc;tre retourn&eacute; de pr&eacute;f&eacute;rence &agrave; d&rsquo;autres codes. 502 DEVRAIT &ecirc;tre utilis&eacute; quand la commande est effectivement reconnue par le serveur SMTP, mais pas mise en &oelig;uvre. Si la commande n&rsquo;est pas reconnue, le code 500 DEVRAIT &ecirc;tre retourn&eacute;. Les syst&egrave;mes SMTP avec extensions NE DOIVENT PAS faire la liste des capacit&eacute;s en r&eacute;ponse &agrave; EHLO pour lesquelles ils retourneront des r&eacute;ponses 502 (ou 500). </p>
<h3><a name="_Toc186287758"></a><a name="_Toc186079784"> 4.2.5 Codes de r&eacute;ponse apr&egrave;s DATA et le &lt;CRLF&gt;.&lt;CRLF&gt; suivant</a></h3>
<p> Lorsque un serveur SMTP retourne un &eacute;tat d'ach&egrave;vement positif (code 2yz) apr&egrave;s que la commande DATA est termin&eacute;e par &lt;CRLF&gt;.&lt;CRLF&gt;, il accepte la responsabilit&eacute; : <br>
- de livrer le message (si la bo&icirc;te &agrave; lettres receveuse existe), ou <br>
- si les tentatives de livrer le message &eacute;chouent &agrave; cause de conditions transitoires, de r&eacute;essayer la livraison un nombre de fois raisonnable &agrave; des intervalles sp&eacute;cifi&eacute;s au paragraphe 4.5.4. <br>
- si les tentatives de livrer le message &eacute;chouent &agrave; cause de conditions permanentes, ou si des tentatives r&eacute;p&eacute;t&eacute;es de livrer le message &eacute;chouent &agrave; cause de conditions transitoires, de retourner la notification appropri&eacute;e &agrave; l&rsquo;envoyeur du message original (en utilisant l&rsquo;adresse dans la commande MAIL de SMTP). </p>
<p>Lorsque un serveur SMTP retourne un code d&rsquo;&eacute;tat d&rsquo;erreur permanent (5yz) apr&egrave;s que la commande DATA est termin&eacute;e par &lt;CRLF&gt;.&lt;CRLF&gt;, il NE DOIT PAS faire de tentative ult&eacute;rieur pour d&eacute;livrer ce message. Le client SMTP conserve la responsabilit&eacute; de la livraison de ce message et peut soit le retourner &agrave; l&rsquo;usager soit le remettre en file d&rsquo;attente pour une tentative ult&eacute;rieure (voir au paragraphe 4.5.4.1). </p>
<p>L&rsquo;usager qui est &agrave; l&rsquo;origine du message DEVRAIT &ecirc;tre capable d&rsquo;interpr&eacute;ter le retour d&rsquo;un &eacute;tat d&rsquo;&eacute;chec transitoire (par un message &eacute;lectronique ou autrement) comme une indication de non livraison, comme un &eacute;chec permanent serait &eacute;galement interpr&eacute;t&eacute;. C&rsquo;est-&agrave;-dire que si le client SMTP r&eacute;ussit &agrave; traiter ces conditions, l&rsquo;usager ne recevra pas une telle r&eacute;ponse. </p>
<p>Lorsque un serveur SMTP retourne un code d&rsquo;&eacute;tat d&rsquo;erreur permanent (5yz) apr&egrave;s que la commande DATA est termin&eacute;e par &lt;CRLF&gt;.&lt;CRLF&gt;, il NE DOIT PAS faire de tentative ult&eacute;rieure de livraison du message. Comme avec les codes d&rsquo;&eacute;tat d&rsquo;erreur temporaire, le client SMTP garde la responsabilit&eacute; du message, mais NE DEVRAIT PAS essayer &agrave; nouveau de livrer au m&ecirc;me serveur sans que l&rsquo;usager r&eacute;vise et intervienne sur le message. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287759"></a><a name="_Toc186079880"></a><a name="_Toc186079785"> 4.3 S&eacute;quen&ccedil;age des commandes et des r&eacute;ponses</a></h2>
<h3><a name="_Toc186287760"></a><a name="_Toc186079786"> 4.3.1 G&eacute;n&eacute;ralit&eacute;s sur le s&eacute;quen&ccedil;age</a></h3>
<p> La communication entre l&rsquo;envoyeur et le receveur est un dialogue altern&eacute;, contr&ocirc;l&eacute; par l&rsquo;envoyeur. Comme tel, l&rsquo;envoyeur produit une commande et le receveur y r&eacute;pond. Sauf si d&rsquo;autres arrangements sont n&eacute;goci&eacute;s &agrave; travers des extensions de service, l&rsquo;envoyeur DOIT attendre la r&eacute;ponse avant d&rsquo;envoyer d&rsquo;autres commandes. </p>
<p>Une r&eacute;ponse importante est l&rsquo;accueil de connexion. Normalement, un receveur enverra une r&eacute;ponse 220 &quot;Service pr&ecirc;t&quot; lorsque la connexion est r&eacute;alis&eacute;e. L&rsquo;envoyeur DEVRAIT attendre ce message d&rsquo;accueil avant tout envoi de commandes. </p>
<p>Note : Toutes les r&eacute;ponses de type accueil ont le nom officiel (le nom de domaine principal pleinement qualifi&eacute;) de l&rsquo;h&ocirc;te serveur comme premier mot suivant le code de r&eacute;ponse. Parfois l&rsquo;h&ocirc;te n&rsquo;a pas de nom significatif. Voir en 4.1.3 un expos&eacute; sur les solutions de remplacement dans ces situations. </p>
<p>Par exemple, <br>
  220 ISIF.USC.EDU Service pr&ecirc;t ou <br>
  220 mail.foo.com SuperSMTP v 6.1.2 Service pr&ecirc;t ou <br>
220 [10.0.0.1] Clueless h&ocirc;te service pr&ecirc;t </p>
<p>Le tableau ci-dessous fait la liste des r&eacute;ponses de succ&egrave;s et d&rsquo;&eacute;chec de remplacement pour chaque commande. Ces r&eacute;ponses DEVRAIENT &ecirc;tre strictement respect&eacute;es : un receveur peut substituer du texte dans les r&eacute;ponses, mais la signification et l&rsquo;action impliqu&eacute;es par les num&eacute;ros de code et par la s&eacute;quence sp&eacute;cifique de r&eacute;ponse &agrave; la commande ne peuvent pas &ecirc;tre alt&eacute;r&eacute;es. </p>
<p>&nbsp; </p>
<h3><a name="_Toc186287761"></a><a name="_Toc186079787"> 4.3.2 S&eacute;quences de commande-r&eacute;ponse</a></h3>
<p> Chaque commande figure avec ses r&eacute;ponses usuelles possibles. Les pr&eacute;fixes utilis&eacute;s devant les r&eacute;ponses possibles sont &quot;I&quot; pour interm&eacute;diaire, &quot;S&quot; pour succ&egrave;s, et &quot;E&quot; pour erreur. Comme certains serveurs peuvent g&eacute;n&eacute;rer d&rsquo;autres r&eacute;ponses dans des circonstances particuli&egrave;res, et pour permettre les extensions futures, les clients SMTP DEVRAIENT, quand c&rsquo;est possible, interpr&eacute;ter seulement le premier chiffre de la r&eacute;ponse et DOIVENT &ecirc;tre pr&ecirc;ts &agrave; traiter les codes de r&eacute;ponse inconnus en interpr&eacute;tant seulement le premier chiffre. Sauf &agrave; utiliser les m&eacute;canismes d&rsquo;extension d&eacute;crits au paragraphe 2.2, les serveurs SMTP NE DOIVENT PAS transmettre &agrave; un client SMT&uml;de codes de r&eacute;ponse autres qu&rsquo;&agrave; trois chiffres ou qui ne commencent pas par un chiffre compris entre 2 et 5 inclus. </p>
<p>Ces r&egrave;gles de s&eacute;quen&ccedil;age et, en principe, les codes eux-m&ecirc;mes, peuvent &ecirc;tre &eacute;tendus ou modifi&eacute;s par les extensions SMTP offertes par le serveur et accept&eacute;es (demand&eacute;es) par le client. </p>
<p>En plus des codes dont la liste figure ci-dessous, toute commande SMTP peut retourner un des codes suivants si les circonstances inhabituelles correspondantes se rencontrent : </p>
<p> 500 Pour le cas de la &quot;ligne de commande trop longue&quot; ou si le nom de la commande n&rsquo;est pas reconnu. Noter que produire une erreur &quot;commande non reconnue&quot; en r&eacute;ponse au sous-ensemble demand&eacute; de ces commandes est une violation de la pr&eacute;sente sp&eacute;cification. </p>
<p> 501 Erreur de syntaxe des commandes ou des arguments. Afin de permettre des extensions futures, les commandes qui sont sp&eacute;cifi&eacute;es dans le pr&eacute;sent document comme n&rsquo;acceptant pas d&rsquo;arguments (DATA, RSET, QUIT) DEVRAIENT retourner un message 501 si des arguments sont fournis en l&rsquo;absence d&rsquo;extensions publi&eacute;es dans EHLO. </p>
<p> 421 Fermeture du service et cl&ocirc;ture du canal de transmission </p>
<p>Les s&eacute;quences sp&eacute;cifiques sont : <br>
&Eacute;TABLISSEMENT DE CONNEXION <br>
S: 220 <br>
E: 554 <br>
EHLO ou HELO <br>
S: 250 <br>
E: 504, 550 <br>
MAIL <br>
S: 250 <br>
E: 552, 451, 452, 550, 553, 503 <br>
RCPT <br>
S: 250, 251 (mais voir au paragraphe 3.4 la discussion sur 251 et 551) <br>
E: 550, 551, 552, 553, 450, 451, 452, 503, 550 <br>
DATA <br>
I: 354 -&gt; data -&gt; S: 250 <br>
E: 552, 554, 451, 452 <br>
E: 451, 554, 503 <br>
RSET <br>
S: 250 <br>
VRFY <br>
S: 250, 251, 252 <br>
E: 550, 551, 553, 502, 504 <br>
EXPN <br>
S: 250, 252 <br>
E: 550, 500, 502, 504 <br>
HELP <br>
S: 211, 214 <br>
E: 502, 504 <br>
NOOP <br>
S: 250 <br>
QUIT <br>
S: 221 </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287762"></a><a name="_Toc186079881"></a><a name="_Toc186079788"> 4.4 Informations de trace</a></h2>
<p> Lorsqu&rsquo;un serveur SMTP re&ccedil;oit un message &agrave; d&eacute;livrer ou pour traitement ult&eacute;rieur, il DOIT ins&eacute;rer des informations de trace (&quot;horodatage&quot; ou &quot;Re&ccedil;u&quot;) au d&eacute;but du contenu du message, comme indiqu&eacute; au paragraphe 4.1.1.4. </p>
<p>Cette ligne DOIT &ecirc;tre structur&eacute;e comme suit : <br>
- Le champ FROM, qui DOIT &ecirc;tre fourni dans un environnement SMTP, DEVRAIT contenir &agrave; la fois (1) le nom de l&rsquo;h&ocirc;te de source tel que pr&eacute;sent&eacute; dans la commande EHLO et (2) une adresse litt&eacute;rale contenant l&rsquo;adresse IP de la source, d&eacute;termin&eacute;e &agrave; partir de la connexion TCP. <br>
- Le champ ID PEUT contenir un &quot;@&quot; comme sugg&eacute;r&eacute; dans la RFC 822, mais ce n&rsquo;est pas oblig&eacute;. <br>
- Le champ FOR PEUT contenir une liste d&rsquo;entr&eacute;es &lt;chemin&gt; quand plusieurs commandes RCTP ont &eacute;t&eacute; donn&eacute;es. Cela peut poser quelques probl&egrave;mes de s&eacute;curit&eacute; et n&rsquo;est habituellement pas souhaitable&nbsp;; voir au paragraphe 7.2. </p>
<p>Un programme de messagerie Internet NE DOIT PAS changer une ligne Received: qui a &eacute;t&eacute; pr&eacute;c&eacute;demment ajout&eacute;e &agrave; l&rsquo;en-t&ecirc;te du message. Les serveurs SMTP DOIVENT ajouter des lignes Received aux messages ; ils NE DOIVENT PAS changer l&rsquo;ordre des lignes existantes ou ins&eacute;rer des lignes Received &agrave; tout autre endroit. </p>
<p>Avec la croissance de l&rsquo;Internet, la possibilit&eacute; de comparer les champs Received est importante pour d&eacute;tecter les probl&egrave;mes, particuli&egrave;rement de relais lents. Les serveurs SMTP qui cr&eacute;ent des champs Received DEVRAIENT utiliser des d&eacute;calages explicites dans les dates (par exemple, -0800), plut&ocirc;t que des noms de zone horaires de n&rsquo;importe quel type. L&rsquo;heure locale (avec un d&eacute;calage) est pr&eacute;f&eacute;r&eacute;e au temps universel (TU) quand c&rsquo;est faisable. Cette formulation permet de sp&eacute;cifier un peu plus d&rsquo;informations sur les circonstances locales. Si le TU est n&eacute;cessaire, le receveur a seulement besoin d&rsquo;un peu d&rsquo;arithm&eacute;tique simple pour convertir les valeurs. L&rsquo;utilisation du TU perd des informations sur la localisation de la zone horaire du serveur. Si il est souhait&eacute; de fournir un nom de zone horaire, il DEVRAIT &ecirc;tre inclus dans un commentaire. </p>
<p>Lorsque le serveur SMTP de livraison fait la &quot;livraison finale&quot; d&rsquo;un message, il ins&egrave;re une ligne de chemin de retour au d&eacute;but des donn&eacute;es de messagerie. Cette utilisation du chemin de retour est exig&eacute;e ; les syst&egrave;mes de messagerie DOIVENT la prendre en charge. La ligne chemin de retour pr&eacute;serve les informations dans le &lt;chemin inverse&gt; provenant de la commande MAIL. Ici, livraison finale signifie que le message a quitt&eacute; l&rsquo;environnement SMTP. Normalement, cela voudrait dire qu&rsquo;il a &eacute;t&eacute; livr&eacute; &agrave; l&rsquo;usager de destination ou &agrave; un point de chute de messagerie associ&eacute;, mais dans certains cas, il peut encore &ecirc;tre trait&eacute; et transmis par un autre syst&egrave;me de messagerie. </p>
<p>Il est possible que la bo&icirc;te &agrave; lettres dans le chemin de retour soit diff&eacute;rente de la bo&icirc;te &agrave; lettres de l&rsquo;envoyeur r&eacute;el, par exemple, si des r&eacute;ponses d&rsquo;erreur sont &agrave; livrer &agrave; une bo&icirc;te &agrave; lettres de traitement d&rsquo;erreur sp&eacute;ciale plut&ocirc;t qu&rsquo;&agrave; celle de l&rsquo;envoyeur du message. Lorsque des listes de diffusions sont impliqu&eacute;es, cet arrangement est courant et utile comme moyen de diriger les erreurs vers celui qui tient la liste &agrave; jour plut&ocirc;t que vers l&rsquo;origine du message. </p>
<p>Le texte ci-dessus implique que les donn&eacute;es de messagerie finales vont commencer par une ligne de chemin de retour, suivie par une ou plusieurs lignes d&rsquo;horodatage. Ces lignes seront suivies par les en-t&ecirc;tes des donn&eacute;es de messagerie et le corps [32]. </p>
<p>Il est parfois difficile &agrave; un serveur SMTP de d&eacute;terminer si il fait ou non la livraison finale car la transmission ou d&rsquo;autres op&eacute;rations peuvent survenir apr&egrave;s l&rsquo;acceptation de la livraison du message. Par cons&eacute;quent, tout syst&egrave;me post&eacute;rieur (transmission, passerelle, ou relais) PEUT retirer le chemin de retour et reconstruire la commande MAIL en tant que de besoin pour s&rsquo;assurer qu&rsquo;exactement une seule de ces lignes appara&icirc;t dans un message d&eacute;livr&eacute;. </p>
<p>Un syst&egrave;me SMTP g&eacute;n&eacute;rateur de message NE DEVRAIT PAS envoyer un message qui contient d&eacute;j&agrave; un en-t&ecirc;te Return-path. Les serveurs SMTP qui remplissent une fonction de relais NE DOIVENT PAS inspecter les donn&eacute;es du message, et en particulier pas au point de d&eacute;terminer si les en-t&ecirc;tes Return-path sont pr&eacute;sents. Les serveurs SMTP qui font la livraison finale PEUVENT retirer les en-t&ecirc;tes Return-path avant d&rsquo;ajouter le leur. </p>
<p>Le principal objet du chemin de retour est de d&eacute;signer l&rsquo;adresse &agrave; laquelle les messages indiquant la non d&eacute;livrance ou autres d&eacute;faillances du syst&egrave;me de messagerie sont &agrave; envoyer. Pour qu&rsquo;il n&rsquo;y ait pas d&rsquo;ambigu&iuml;t&eacute;, exactement un chemin de retour DEVRAIT &ecirc;tre pr&eacute;sent lorsque le message est d&eacute;livr&eacute;. Les syst&egrave;mes qui utilisent la syntaxe de la RFC 822 avec des transports non SMTP DEVRAIENT d&eacute;signer une adresse sans ambigu&iuml;t&eacute;, associ&eacute;e &agrave; l&rsquo;enveloppe de transport, &agrave; laquelle faire rapport des erreurs (par exemple, les messages de non livraison). </p>
<p>Note historique : Le texte de la RFC 822 qui para&icirc;t contredire l&rsquo;utilisation de l&rsquo;en-t&ecirc;te Return-path (ou l&rsquo;enveloppe d&rsquo;adresse de chemin inverse tir&eacute;e de la commande MAIL) comme destination des messages d&rsquo;erreur n&rsquo;est pas applicable sur l&rsquo;Internet. L&rsquo;adresse de chemin inverse (telle que copi&eacute;e dans Return-path) DOIT &ecirc;tre utilis&eacute;e comme cible de tout message contenant la livraison de messages d&rsquo;erreur. </p>
<p>En particulier : <br>
- une passerelle de SMTP vers ailleurs DEVRAIT ins&eacute;rer un en-t&ecirc;te de chemin de retour, sauf s&rsquo;il est connu que le transport &quot;d&rsquo;ailleurs&quot; utilise aussi les adresses de domaine Internet et conserve s&eacute;par&eacute;ment d&rsquo;adresse de l&rsquo;envoyeur de l&rsquo;enveloppe. <br>
- une passerelle de ailleurs vers SMTP DEVRAIT supprimer tout en-t&ecirc;te de chemin de retour pr&eacute;sent dans le message, et soit copier cette information dans l&rsquo;enveloppe SMTP, soit la combiner aux informations pr&eacute;sentes dans l&rsquo;enveloppe de l&rsquo;autre syst&egrave;me de transport pour construire l&rsquo;argument de chemin inverse pour la commande MAIL dans l&rsquo;enveloppe SMTP. </p>
<p>Le serveur doit r&eacute;server un traitement particulier aux cas dans lesquels le processus suivant l&rsquo;indication de fin des donn&eacute;es de messagerie n&rsquo;est que partiellement r&eacute;ussi. Cela peut arriver si, apr&egrave;s avoir accept&eacute; plusieurs receveurs et les donn&eacute;es de messagerie, le serveur SMTP trouve que les donn&eacute;es de messagerie pourraient &ecirc;tre livr&eacute;es avec succ&egrave;s &agrave; certains des receveurs, mais pas &agrave; tous. Dans un tel cas, la r&eacute;ponse &agrave; la commande DATA DOIT &ecirc;tre une r&eacute;ponse OK. Cependant, le serveur SMTP DOIT composer et envoyer un message de notification &quot;message non livrable&quot; &agrave; l&rsquo;origine du message. </p>
<p>Il DOIT envoyer une seule liste de notification de tous les receveurs pour lesquels il y a eu &eacute;chec ou bien des messages de notification s&eacute;par&eacute;s pour chaque receveur pour lequel il y a eu &eacute;chec. Pour &eacute;pargner la quantit&eacute; de traitement pour l&rsquo;envoyeur, la premi&egrave;re solution est pr&eacute;f&eacute;r&eacute;e lorsque possible. Tous les messages de notification de messagerie non livrable sont envoy&eacute;es en utilisant la commande MAIL (m&ecirc;me si ils r&eacute;sultent du traitement des commandes obsol&egrave;tes SEND, SOML, ou SAML) et un chemin de retour nul comme expos&eacute; au paragraphe 3.7. </p>
<p>La ligne d&rsquo;horodatage et la ligne de chemin de retour sont d&eacute;finies formellement comme suit : <br>
Ligne chemin de retour = &quot;Return-Path:&quot; FWS Chemin-inverse &lt;CRLF&gt; <br>
Ligne horodatage = &quot;Received:&quot; FWS Horodatage &lt;CRLF&gt; <br>
Horodatage = From-domaine By-domaine Opt-info &quot;;&quot; FWS horodatage <br>
; o&ugrave; &quot;horodatage&quot; est comme d&eacute;fini dans [32] mais les formes &quot;obs-&quot;, particuli&egrave;rement les ann&eacute;es<br>
  ; sur deux chiffres, sont interdites dans SMTP et NE DOIVENT PAS &ecirc;tre utilis&eacute;es. <br>
  From-domain = &quot;FROM&quot; FWS Extended-Domain CFWS <br>
  By-domain = &quot;BY&quot; FWS Extended-Domain CFWS <br>
  Extended-Domain = Domaine / ( Domaine FWS &quot;(&quot; TCP-info &quot;)&quot; ) / ( Adresse-litt&eacute;rale FWS &quot;(&quot; TCP-info &quot;)&quot; ) <br>
  TCP-info = Adresse-litt&eacute;rale / ( Domaine FWS Adresse-litt&eacute;rale ) <br>
  ; Information d&eacute;duite par le serveur de la connexion TCP et pas du EHLO du client. <br>
  Opt-info = [Via] [With] [ID] [For] <br>
  Via = &quot;VIA&quot; FWS Link CFWS <br>
  With = &quot;WITH&quot; FWS Protocol CFWS <br>
  ID = &quot;ID&quot; FWS String / msg-id CFWS <br>
  For = &quot;FOR&quot; FWS 1*( Path / Mailbox ) CFWS <br>
  Link = &quot;TCP&quot; / Addtl-Link <br>
  Addtl-Link = Atom <br>
  ; Des noms standard suppl&eacute;mentaires pour les liaisons sont enregistr&eacute;s aupr&egrave;s de l&rsquo;Autorit&eacute; d&rsquo;allocation de num&eacute;ros de l&rsquo;Internet (IANA). &quot;Via&quot; n&rsquo;a de valeur qu&rsquo;avec les transports non-Internet. Les serveurs SMTP NE DEVRAIENT PAS utiliser de noms non enregistr&eacute;s. <br>
  Protocol = &quot;ESMTP&quot; / &quot;SMTP&quot; / Attdl-Protocol <br>
  Attdl-Protocol = Atom <br>
  ; Des noms standard suppl&eacute;mentaires de protocoles sont enregistr&eacute;s aupr&egrave;s de l&rsquo;Autorit&eacute; d&rsquo;allocation de num&eacute;ros de l&rsquo;Internet (IANA). Les serveurs SMTP NE DEVRAIENT PAS utiliser de noms non enregistr&eacute;s. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287763"></a><a name="_Toc186079882"></a><a name="_Toc186079789"> 4.5 Questions de mise en &oelig;uvre suppl&eacute;mentaires</a></h2>
<h3><a name="_Toc186287764"></a><a name="_Toc186079790"> 4.5.1 Mise en &oelig;uvre minimum</a></h3>
<p> Pour rendre SMTP exploitable, la mise en &oelig;uvre minimum suivante est exig&eacute;e de tous les receveurs. Les commandes suivantes DOIVENT &ecirc;tre prises en charge pour la conformit&eacute; &agrave; la pr&eacute;sente sp&eacute;cification : <br>
EHLO <br>
HELO <br>
MAIL <br>
RCPT <br>
DATA <br>
RSET <br>
NOOP <br>
QUIT <br>
VRFY </p>
<p>Tout syst&egrave;me qui comporte un serveur SMTP qui prend en charge le relais ou la livraison de messagerie DOIT prendre en charge la bo&icirc;te &agrave; lettres r&eacute;serv&eacute;e &quot;postmaster&quot; comme un nom local insensible &agrave; la casse. Cette adresse de ma&icirc;tre de poste n&rsquo;est pas strictement n&eacute;cessaire si le serveur retourne toujours 554 &agrave; l&rsquo;ouverture de la connexion (comme d&eacute;crit au paragraphe 3.1). L&rsquo;exigence d&rsquo;acceptation de la messagerie pour le ma&icirc;tre de poste implique que les commandes RCTP qui sp&eacute;cifient une bo&icirc;te &agrave; lettres pour le ma&icirc;tre de poste &agrave; tous les domaines pour lesquels le serveur SMTP fournit un service de messagerie, aussi bien que le cas particulier de &quot;RCPT TO:&lt;Postmaster&gt;&quot; (sans sp&eacute;cification de domaine), DOIT &ecirc;tre satisfaite. </p>
<p>Les syst&egrave;mes SMTP sont suppos&eacute;s faire tous les efforts raisonnables pour accepter les messages dirig&eacute;s sur le ma&icirc;tre de poste provenant de tous les autres syst&egrave;mes sur l&rsquo;Internet. Dans les cas extr&ecirc;mes &ndash; comme de contenir une attaque de d&eacute;ni de service ou autre atteinte &agrave; la s&eacute;curit&eacute; -- un serveur SMTP peut bloquer les messages adress&eacute;s au ma&icirc;tre de poste. Cependant, de tels arrangements DEVRAIENT &ecirc;tre tr&egrave;s encadr&eacute;s de fa&ccedil;on &agrave; &eacute;viter de bloquer les messages qui n&rsquo;ont rien &agrave; voir avec l&rsquo;attaque. </p>
<h3><a name="_Toc186287765"></a><a name="_Toc186079791"> 4.5.2 Transparence</a></h3>
<p> En l&rsquo;absence de dispositions pour la transparence des donn&eacute;es, la s&eacute;quence de caract&egrave;res &quot;&lt;CRLF&gt;.&lt;CRLF&gt;&quot; termine le texte du message et ne peut pas &ecirc;tre envoy&eacute;e par l&rsquo;usager. En g&eacute;n&eacute;ral, les usagers ne sont pas au courant de ces s&eacute;quences &quot;interdites&quot;. Pour permettre que tous les textes compos&eacute;s par les usagers soient transmis de fa&ccedil;on transparente, les proc&eacute;dures suivantes sont utilis&eacute;es : </p>
<p> - Avant l&rsquo;envoi d&rsquo;une ligne du texte d&rsquo;un message, le client SMTP v&eacute;rifie le premier caract&egrave;re de la ligne. Si c&rsquo;est un point, un point suppl&eacute;mentaire est ins&eacute;r&eacute; au d&eacute;but de la ligne. </p>
<p> - Lorsqu&rsquo;une ligne du texte d&rsquo;un message est re&ccedil;ue par le serveur SMTP, il v&eacute;rifie la ligne. Si la ligne est compos&eacute;e d&rsquo;un seul point, elle est trait&eacute;e comme la fin de l&rsquo;indicateur de message. Si le premier caract&egrave;re est un point et qu&rsquo;il y a d&rsquo;autres caract&egrave;res sur la ligne, le premier caract&egrave;re est supprim&eacute;. </p>
<p>Les donn&eacute;es de messagerie peuvent contenir n&rsquo;importe lequel des 128 caract&egrave;res ASCII. Tous les caract&egrave;res sont &agrave; livrer &agrave; la bo&icirc;te &agrave; lettres du receveur, y compris les espaces, les tabulations verticales et horizontales, et autres caract&egrave;res de contr&ocirc;le. Si le canal de transmission fournit un flux de donn&eacute;es d&rsquo;octets de 8 bits, les codes ASCII &agrave; 7 bits sont transmis justifi&eacute;s &agrave; droite dans les octets, avec le bit de plus fort poids mis &agrave; z&eacute;ro. Voir au paragraphe 3.7 le traitement sp&eacute;cial de ces conditions dans les syst&egrave;mes SMTP qui remplissent une fonction de relais. </p>
<p>Dans certains syst&egrave;mes il peut &ecirc;tre n&eacute;cessaire de transformer les donn&eacute;es &agrave; mesure qu&rsquo;elles arrivent et sont m&eacute;moris&eacute;es. Cela peut &ecirc;tre n&eacute;cessaire pour les h&ocirc;tes qui utilisent un jeu de caract&egrave;res diff&eacute;rent de ASCII comme jeu de caract&egrave;res local, qui m&eacute;morisent les donn&eacute;es en enregistrements plut&ocirc;t qu&rsquo;en cha&icirc;nes, ou qui utilisent des s&eacute;quences de caract&egrave;res particuli&egrave;res comme d&eacute;limiteurs &agrave; l&rsquo;int&eacute;rieur des bo&icirc;tes &agrave; lettres. Si de telles transformations sont n&eacute;cessaires, elles DOIVENT &ecirc;tre r&eacute;versibles, particuli&egrave;rement si elles sont appliqu&eacute;es &agrave; de la messagerie &agrave; relayer. </p>
<p>&nbsp; </p>
<h3><a name="_Toc186287766"></a><a name="_Toc186079792"> 4.5.3 Tailles et fin de temporisation</a></h3>
<p><strong> 4.5.3.1 Limites de taille et minimums </strong></p>
<p> Il y a plusieurs objets qui ont des tailles minimum/maximum exig&eacute;es. Chaque mise en &oelig;uvre DOIT &ecirc;tre capable de recevoir des objets d&rsquo;au moins ces tailles. Les objets plus grands que ces tailles DEVRAIENT &ecirc;tre &eacute;vit&eacute;s autant que possible. Cependant, certaines constructions de messagerie Internet comme les adresse cod&eacute;es en adresses X.400 [16] vont souvent exiger des objets plus grands : les clients PEUVENT tenter de les transmettre, mais DOIVENT &ecirc;tre pr&ecirc;ts &agrave; ce qu&rsquo;un serveur les rejette si il ne peut pas les traiter. Dans toute la mesure du possible, les techniques de mise en &oelig;uvre qui n&rsquo;imposent pas de limites &agrave; la longueur de ces objets devraient &ecirc;tre utilis&eacute;es. </p>
<p>partie locale <br>
La longueur totale maximum d&rsquo;un nom d&rsquo;utilisateur ou autre partie locale est de 64 caract&egrave;res. </p>
<p>domaine <br>
La longueur totale maximum d&rsquo;un nom de domaine ou nombre est de 255 caract&egrave;res. </p>
<p>chemin <br>
La longueur totale maximum d&rsquo;un chemin inverse ou chemin de transmission est de 256 caract&egrave;res (y compris la ponctuation et les s&eacute;parateurs d&rsquo;&eacute;l&eacute;ment). </p>
<p>ligne de commande <br>
La longueur totale maximum d&rsquo;une ligne de commande y compris le mot de commande et le &lt;CRLF&gt; est de 512&nbsp;caract&egrave;res. Les extensions SMTP peuvent &ecirc;tre utilis&eacute;es pour augmenter cette limite. </p>
<p>ligne de r&eacute;ponse <br>
La longueur totale maximum d&rsquo;une ligne de r&eacute;ponse y compris le code de r&eacute;ponse et le &lt;CRLF&gt; est de 512&nbsp;caract&egrave;res. Plus d&rsquo;informations peuvent &ecirc;tre convoy&eacute;es au moyen de r&eacute;ponses multi lignes. </p>
<p>ligne de texte <br>
La longueur totale maximum d&rsquo;une ligne de texte y compris le &lt;CRLF&gt; est de 1000 caract&egrave;res (non compt&eacute; le point dupliqu&eacute; en t&ecirc;te pour la transparence). Ce nombre peut &ecirc;tre augment&eacute; par l&rsquo;utilisation d&rsquo;extensions de service SMTP. </p>
<p>contenu du message <br>
La longueur totale maximum d&rsquo;un contenu de message (incluant tous en-t&ecirc;tes de message et corps de message) DOIT &ecirc;tre au moins de 64 Koctets. Depuis l&rsquo;introduction des normes de l&rsquo;Internet pour la messagerie multim&eacute;dia [12], les longueurs de message sur l&rsquo;Internet ont consid&eacute;rablement grandi, et les restrictions de taille de message devraient &ecirc;tre &eacute;vit&eacute;es dans toute la mesure du possible. Les syst&egrave;mes serveur SMTP qui doivent imposer des restrictions DEVRAIENT mettre en &oelig;uvre l&rsquo;extension de service &quot;SIZE&quot; [18], et les syst&egrave;mes SMTP clients qui envoient de gros messages DEVRAIENT l&rsquo;utiliser chaque fois que possible. </p>
<p>m&eacute;moire tampon de r&eacute;ception <br>
Le nombre total minimum de receveurs qui doivent &ecirc;tre mis en m&eacute;moire tampon est de cent receveurs. Le rejet de messages (pour exc&egrave;s de receveurs) avec moins de 100 commandes RCTP est une violation de la pr&eacute;sente sp&eacute;cification. Le principe g&eacute;n&eacute;ral que les serveurs SMTP relais NE DOIVENT PAS, et les serveurs SMTP de livraison NE DEVRAIENT PAS, effectuer d&rsquo;essais de validation sur les en-t&ecirc;tes de message, sugg&egrave;re que rejeter un message sur la base du nombre total de receveurs d&rsquo;apr&egrave;s les champs d&rsquo;en-t&ecirc;te est &agrave; d&eacute;conseiller. Un serveur qui impose une limite au nombre de receveurs DOIT se comporter de fa&ccedil;on coh&eacute;rente, en rejetant les adresses qui d&eacute;passent sa limite plut&ocirc;t que d&rsquo;&eacute;liminer en silence des adresses pr&eacute;c&eacute;demment accept&eacute;es. Un client qui a besoin de d&eacute;livrer un message qui contient plus de cent commandes RCTP DEVRAIT &ecirc;tre pr&ecirc;t &agrave; le transmettre en &quot;tron&ccedil;ons&quot; de 100 receveurs si le serveur refuse d&rsquo;accepter plus de cent receveurs dans un seul message. </p>
<p>Les erreurs dues au d&eacute;passement de ces limites peuvent &ecirc;tre rapport&eacute;es en utilisant les codes de r&eacute;ponse. Quelques exemples de codes de r&eacute;ponse sont : </p>
<p>500 Ligne trop longue <br>
ou <br>
501 Chemin trop long <br>
ou <br>
452 Trop de receveurs (voir ci-dessous) <br>
ou <br>
552 Trop de donn&eacute;es de message. </p>
<p>La RFC 821 [30] faisait une liste incorrecte des erreurs en attribuant &agrave; un serveur SMTP qui d&eacute;passe sa limite de mise en &oelig;uvre sur le nombre de commandes RCTP (&quot;trop de receveurs&quot;) le code de r&eacute;ponse 552. Le code de r&eacute;ponse correct pour cette condition est 452. Les clients DEVRAIENT traiter dans ce cas un code 552 comme une d&eacute;faillance temporaire plut&ocirc;t que permanente selon la logique sous-jacente. </p>
<p>Lorsqu&rsquo;un serveur SMTP conforme rencontre cette condition, il a au moins cent commandes RCTP r&eacute;ussies dans sa m&eacute;moire tampon de r&eacute;ception. Si le serveur est capable d&rsquo;accepter le message, au moins ces cent adresses vont alors &ecirc;tre retir&eacute;es de la file d&rsquo;attente du client SMTP. Lorsque le client tente la retransmission de ces adresses qui ont re&ccedil;u des r&eacute;ponses 452, au moins cent d&rsquo;entre elles seront capables de convenir &agrave; la m&eacute;moire tampon de r&eacute;ception du serveur SMTP. Chaque tentative de retransmission qui est capable de livrer quelque chose sera capable de se d&eacute;barrasser d&rsquo;au moins cent de ces receveurs. </p>
<p>Si un serveur SMTP a une limite de mise en &oelig;uvre sur le nombre de commandes RCTP et si cette limite est atteinte, il DOIT utiliser un code de r&eacute;ponse de 452 (mais le client DEVRAIT aussi &ecirc;tre pr&ecirc;t pour un 552, comme not&eacute; ci-dessus). Si le serveur a une limitation configur&eacute;e par la politique du site sur le nombre de commandes RCTP, il PEUT utiliser &agrave; la place un code de r&eacute;ponse 5XX. Cela pourrait &ecirc;tre le plus appropri&eacute; si la limitation de politique &eacute;tait destin&eacute;e &agrave; s&rsquo;appliquer lorsque le compte total des receveurs pour un corps de message particulier devait &ecirc;tre appliqu&eacute; m&ecirc;me si ce corps de message est envoy&eacute; dans plusieurs transactions de messagerie. </p>
<p><strong> 4.5.3.2 Fins de temporisation </strong></p>
<p> Un client SMTP DOIT fournir un m&eacute;canisme de fin de temporisation. Il DOIT utiliser des fins de temporisation par commande plut&ocirc;t que d&rsquo;essayer de fixer une limite de temps &agrave; la transaction de messagerie enti&egrave;re. Les fins de temporisation DEVRAIENT &ecirc;tre facilement reconfigurables, de pr&eacute;f&eacute;rence sans recompiler le code SMTP. Pour mettre cela en &oelig;uvre, un temporisateur est &eacute;tabli pour chaque commande SMTP et pour chaque m&eacute;moire tampon du transfert de donn&eacute;es. Cette derni&egrave;re signifie qu&rsquo;une temporisation globale est par nature proportionnelle &agrave; la taille du message. </p>
<p>Sur la base d&rsquo;une exp&eacute;rience extensive des h&ocirc;tes actifs dans le relais de messagerie, les valeurs minimum de temporisation par commande DEVRAIENT &ecirc;tre les suivantes </p>
<p> Message 220 initial : 5 minutes <br>
Un processus de client SMTP a besoin de distinguer entre une d&eacute;faillance de connexion TCP et des d&eacute;lais dans la r&eacute;ception du message d&rsquo;accueil initial. Beaucoup des serveurs SMTP acceptent une connexion TCP mais retardent la livraison du message 220 jusqu&rsquo;&agrave; ce que la charge de leur syst&egrave;me permette le traitement de plus de messages. </p>
<p> Commande MAIL : 5 minutes </p>
<p> Commande RCPT : 5 minutes <br>
Une temporisation plus longue est n&eacute;cessaire si le traitement des listes de diffusion et des alias n&rsquo;est pas diff&eacute;r&eacute; jusqu&rsquo;&agrave; l&rsquo;acceptation du message. </p>
<p> Initiation de DATA : 2 minutes <br>
C&rsquo;est le d&eacute;lai d&rsquo;attente de la r&eacute;ponse &quot;354 D&eacute;but des entr&eacute;es&quot; &agrave; une commande DATA. </p>
<p> Bloc de donn&eacute;es : 3 minutes <br>
C&rsquo;est le d&eacute;lai d&rsquo;attente de l&rsquo;ach&egrave;vement de chaque appel TCP SEND qui transmet un tron&ccedil;on de donn&eacute;es. </p>
<p> Terminaison de DATA : 10 minutes. <br>
C&rsquo;est en attendant la r&eacute;ponse &quot;250 OK&quot;. Quand le receveur obtient le point final qui termine les donn&eacute;es du message, il effectue normalement le traitement pour la livraison du message &agrave; la bo&icirc;te &agrave; lettres d&rsquo;un usager. Une temporisation parasite &agrave; ce moment pourrait &ecirc;tre ruineuse et r&eacute;sulterait normalement en la livraison de plusieurs copies du message, car il a &eacute;t&eacute; envoy&eacute; avec succ&egrave;s et le serveur a accept&eacute; la responsabilit&eacute; de la livraison. Voir au paragraphe 6.1 un expos&eacute; suppl&eacute;mentaire. </p>
<p>Un serveur SMTP DEVRAIT avoir une temporisation d&rsquo;au moins 5 minutes lorsqu&rsquo;il attend la prochaine commande de l&rsquo;envoyeur. </p>
<p>&nbsp; </p>
<h3><a name="_Toc186287767"></a><a name="_Toc186079793"> 4.5.4 Strat&eacute;gies de recommencement</a></h3>
<p> La structure commune des mises en &oelig;uvre d&rsquo;h&ocirc;te SMTP comporte la bo&icirc;te &agrave; lettres d&rsquo;usager, une ou plusieurs zones pour mettre en file d&rsquo;attente les messages en transit, et une ou plusieurs routines pour envoyer et recevoir le courrier. La structure exacte va varier selon les besoins des usagers sur l&rsquo;h&ocirc;te et le nombre et la taille des listes de diffusion prises en charge par l&rsquo;h&ocirc;te. On d&eacute;crit plusieurs optimisations qui se sont r&eacute;v&eacute;l&eacute;es utiles, en particulier pour les messageurs qui soutiennent de hauts niveaux de trafic. </p>
<p>Toute strat&eacute;gie de mise en file d&rsquo;attente DOIT inclure des temporisations sur toutes les activit&eacute;s commande par commande. Une strat&eacute;gie de mise en file d&rsquo;attente NE DOIT envoyer en aucun cas de messages d&rsquo;erreur en r&eacute;ponse &agrave; des messages d&rsquo;erreur. </p>
<p><strong> 4.5.4.1 Strat&eacute;gie d&rsquo;envoi </strong></p>
<p> Le mod&egrave;le g&eacute;n&eacute;ral pour un client SMTP est d&rsquo;avoir un ou plusieurs processus qui essayent p&eacute;riodiquement de transmettre les messages sortants. Dans un syst&egrave;me normal, le programme qui compose un message a une m&eacute;thode pour demander une attention imm&eacute;diate &agrave; un nouvel &eacute;l&eacute;ment de courrier sortant, alors que le courrier qui ne peut &ecirc;tre transmis imm&eacute;diatement DOIT &ecirc;tre mis en file d&rsquo;attente et r&eacute;essay&eacute; p&eacute;riodiquement par l&rsquo;envoyeur. Une entr&eacute;e de file d&rsquo;attente de messagerie inclura non seulement le message lui-m&ecirc;me mais aussi les informations d&rsquo;enveloppe. </p>
<p>L&rsquo;envoyeur DOIT s&rsquo;imposer un d&eacute;lai avant de r&eacute;essayer une destination particuli&egrave;re apr&egrave;s l&rsquo;&eacute;chec d&rsquo;une tentative. En g&eacute;n&eacute;ral, l&rsquo;intervalle d&rsquo;essai DEVRAIT &ecirc;tre au moins de 30 minutes ; cependant, des strat&eacute;gies plus sophistiqu&eacute;es et variables seront b&eacute;n&eacute;fiques lorsque le client SMTP peut d&eacute;terminer la raison de la non livraison. </p>
<p>Les essais continuent jusqu&rsquo;&agrave; ce que le message soit transmis ou que l&rsquo;envoyeur abandonne ; le d&eacute;lai d&rsquo;abandon a g&eacute;n&eacute;ralement besoin d&rsquo;&ecirc;tre d&rsquo;au moins 4 &agrave; 5 jours. Les param&egrave;tres de l&rsquo;algorithme de r&eacute;essai DOIVENT &ecirc;tre configurables. </p>
<p>Un client DEVRAIT tenir une liste des h&ocirc;tes qu&rsquo;il ne peut pas joindre et les temporisations de connexion correspondantes, plut&ocirc;t que de simplement r&eacute;essayer les &eacute;l&eacute;ments de messagerie en file d&rsquo;attente. </p>
<p>L&rsquo;exp&eacute;rience sugg&egrave;re que les d&eacute;faillances sont normalement transitoires (le syst&egrave;me cible ou sa connexion sont en panne), et milite en faveur d&rsquo;une politique de deux tentatives de connexion dans la premi&egrave;re heure de mise en file d&rsquo;attente du message, puis de revenir &agrave; une tentative toutes les deux ou trois heures. </p>
<p>Le client SMTP peut raccourcir le d&eacute;lai de mise en file d&rsquo;attente en coop&eacute;ration avec le serveur SMTP. Par exemple, si du courrier est re&ccedil;u d&rsquo;une adresse particuli&egrave;re, il est vraisemblable que les messages en file d&rsquo;attente pour cet h&ocirc;te peuvent maintenant &ecirc;tre envoy&eacute;s. L&rsquo;application de ce principe peut, dans de nombreux cas, &eacute;liminer l&rsquo;exigence d&rsquo;une fonction explicite &quot;d&rsquo;envoi imm&eacute;diat de la file d&rsquo;attente&quot; telle que ETRN [9]. </p>
<p>La strat&eacute;gie peut &ecirc;tre encore modifi&eacute;e par l&rsquo;existence de plusieurs adresses par h&ocirc;te (voir ci-dessous) pour optimiser les temps de livraison par rapport &agrave; l&rsquo;utilisation des ressources. </p>
<p>Un client SMTP peut avoir une grosse file d&rsquo;attente de messages pour chaque h&ocirc;te de destination injoignable. Si tous ces messages devaient &ecirc;tre r&eacute;essay&eacute;s &agrave; chaque cycle d&rsquo;essais, cela cr&eacute;erait une redondance excessive pour l&rsquo;Internet et le syst&egrave;me d&rsquo;envoi pourrait &ecirc;tre bloqu&eacute; pour de longues p&eacute;riodes. Noter qu&rsquo;un client SMTP peut g&eacute;n&eacute;ralement d&eacute;terminer qu&rsquo;une tentative de livraison a &eacute;chou&eacute; apr&egrave;s seulement une temporisation de plusieurs minutes et m&ecirc;me d&rsquo;une temporisation d&rsquo;une minute par connexion r&eacute;sultera un tr&egrave;s fort d&eacute;lai si les essais sont r&eacute;p&eacute;t&eacute;s pour des douzaines, ou m&ecirc;me des centaines, de messages en file d&rsquo;attente pour le m&ecirc;me h&ocirc;te. </p>
<p>En m&ecirc;me temps, les clients SMTP DEVRAIENT veiller avec grand soin &agrave; mettre en m&eacute;moire cache les r&eacute;ponses n&eacute;gatives provenant des serveurs. Dans un cas extr&ecirc;me, si EHLO est produit plusieurs fois durant la m&ecirc;me connexion SMTP, des r&eacute;ponses diff&eacute;rentes peuvent &ecirc;tre retourn&eacute;es par le serveur. Plus significatif, les r&eacute;ponses 5yz &agrave; la commande MAIL NE DOIVENT PAS &ecirc;tre mises en m&eacute;moire cache. </p>
<p>Lorsqu&rsquo;un message &eacute;lectronique est &agrave; livrer &agrave; plusieurs receveurs, et que le serveur SMTP auquel une copie du message est &agrave; envoyer est le m&ecirc;me pour plusieurs receveurs, une seule copie du message DEVRAIT alors &ecirc;tre transmise. C&rsquo;est &agrave; dire que le client SMTP DEVRAIT utiliser la s&eacute;quence de commandes : MAIL, RCPT, RCPT,... RCPT, DATA au lieu de la s&eacute;quence : MAIL, RCPT, DATA, ..., MAIL, RCPT, DATA. Cependant, si il y a de tr&egrave;s nombreuses adresses, une limite au nombre de commandes RCTP par commande MAIL PEUT &ecirc;tre impos&eacute;e. La mise en &oelig;uvre de ce dispositif efficace est vivement encourag&eacute;e. </p>
<p>De m&ecirc;me, pour r&eacute;aliser une livraison en temps et en heure, le client SMTP PEUT accepter plusieurs transactions de messagerie sortantes concurrentes. Cependant, des limites peuvent &ecirc;tre appropri&eacute;es pour prot&eacute;ger l&rsquo;h&ocirc;te contre le fait de consacrer toutes ses ressources &agrave; la messagerie. </p>
<p><strong> 4.5.4.2 Strat&eacute;gie de r&eacute;ception </strong></p>
<p> Le serveur SMTP DEVRAIT tenter de garder l&rsquo;&eacute;coute &agrave; tout moment sur tous les acc&egrave;s SMTP. Cela exige la prise en charge de plusieurs connexions TCP pour SMTP. Certaines limites PEUVENT &ecirc;tre impos&eacute;es mais les serveurs qui ne peuvent traiter plus d&rsquo;une transaction SMTP &agrave; la fois ne sont pas conformes aux intentions de la pr&eacute;sente sp&eacute;cification. </p>
<p>Comme expos&eacute; plus haut, lorsque le serveur SMTP re&ccedil;oit du courrier provenant d&rsquo;une adresse d&rsquo;h&ocirc;te particuli&egrave;re, il pourrait activer ses propres m&eacute;canismes SMTP de mise en file d&rsquo;attente pour r&eacute;essayer tous les messages en cours pour cette adresse. </p>
<p>&nbsp; </p>
<h3><a name="_Toc186287768"></a><a name="_Toc186079794"> 4.5.5 Messages avec un chemin inverse nul</a></h3>
<p> Il y a plusieurs types de messages de notification dont il est exig&eacute; par les normes existantes et propos&eacute;es qu&rsquo;ils soient envoy&eacute;s avec un chemin inverse nul, &agrave; savoir les notifications de non livraison expos&eacute;es au paragraphe 3.7, d&rsquo;autres sortes de notifications d&rsquo;&eacute;tat de livraison (DSN, <em>Delivery Status Notification</em>) [24], et aussi les notifications de disposition de message (MDN, <em>Message Disposition Notification</em>) [10]. Toutes ces sortes de messages sont des notifications au sujet de messages pr&eacute;c&eacute;dents, et elles sont envoy&eacute;es sur le chemin inverse du message &eacute;lectronique pr&eacute;c&eacute;dent. (Si la livraison d&rsquo;un tel message de notification &eacute;choue, cela indique habituellement un probl&egrave;me du syst&egrave;me de messagerie de l&rsquo;h&ocirc;te auquel le message de notification est adress&eacute;. Pour cette raison, sur certains h&ocirc;tes le MTA est r&eacute;gl&eacute; pour transmettre de tels messages de notification en &eacute;chec &agrave; quelqu&rsquo;un qui est capable de r&eacute;gler les probl&egrave;mes du syst&egrave;me de messagerie, par exemple, via l&rsquo;alias du ma&icirc;tre de poste.) </p>
<p>Tous les autres types de messages (c&rsquo;est-&agrave;-dire, tout message dont il n&rsquo;est pas exig&eacute; par une RFC en cours de normalisation d&rsquo;avoir un chemin inverse nul) DEVRAIENT &ecirc;tre envoy&eacute;s avec un chemin inverse valide, non nul. </p>
<p>Les d&eacute;veloppeurs de processeur automatique de messagerie &eacute;lectronique devraient veiller &agrave; s&rsquo;assurer que les diverses sortes de messages de chemin inverse nul sont trait&eacute;s correctement. En particulier, de tels syst&egrave;mes NE DEVRAIENT PAS r&eacute;pondre aux messages &agrave; chemin inverse nul. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287769"></a><a name="_Toc186079883"></a><a name="_Toc186079795"> 5 R&eacute;solution d&rsquo;adresse et traitement de messagerie</a></h1>
<p>Une fois qu&rsquo;un client SMTP a identifi&eacute; lexicalement un domaine auquel du courrier sera livr&eacute; pour traitement (comme d&eacute;crit aux paragraphes 3.6 et 3.7), une recherche DNS DOIT &ecirc;tre effectu&eacute;e pour r&eacute;soudre le nom de domaine [22]. Les noms sont suppos&eacute;s &ecirc;tre des noms de domaine pleinement qualifi&eacute;s (FQDN) : les m&eacute;canismes pour d&eacute;duire les FQDN des noms partiels ou d&rsquo;alias locaux sortent du domaine d&rsquo;application de la pr&eacute;sente sp&eacute;cification et, du fait de nombreux probl&egrave;mes, sont g&eacute;n&eacute;ralement d&eacute;conseill&eacute;s. La recherche vise d&rsquo;abord &agrave; localiser un enregistrement MX associ&eacute; au nom. Si un enregistrement CNAME est trouv&eacute; &agrave; la place, le nom r&eacute;sultant est trait&eacute; comme s&rsquo;il &eacute;tait le nom initial. Si aucun enregistrement MX n&rsquo;est trouv&eacute;, mais qu&rsquo;un RR A est trouv&eacute;, le RR A est trait&eacute; comme s&rsquo;il &eacute;tait associ&eacute; &agrave; un RR MX implicite, avec une pr&eacute;f&eacute;rence de 0, pointant sur cet h&ocirc;te. Si un ou plusieurs RR MX sont trouv&eacute;s pour un nom donn&eacute;, les syst&egrave;mes SMTP NE DOIVENT utiliser aucun RR A associ&eacute; &agrave; ce nom &agrave; moins qu&rsquo;il soit localis&eacute; en utilisant les RR MX&nbsp;; la r&egrave;gle &quot;MX implicite&quot; donn&eacute;e plus haut ne s&rsquo;applique que si aucun enregistrement MX n&rsquo;est pr&eacute;sent. Si des enregistrements MX sont pr&eacute;sents, mais qu&rsquo;aucun d&rsquo;eux n&rsquo;est utilisable, cette situation DOIT &ecirc;tre rapport&eacute;e comme erreur. </p>
<p>Lorsque la recherche r&eacute;ussit, la transposition peut r&eacute;sulter en une liste d&rsquo;adresses de livraison de remplacement plut&ocirc;t qu&rsquo;en une seule adresse, &agrave; cause de plusieurs enregistrements MX, d&rsquo;une origine multiple, ou des deux. Pour fournir une transmission de messagerie fiable, le client SMTP DOIT &ecirc;tre capable d&rsquo;essayer (et r&eacute;essayer) chacune des adresses pertinentes dans l&rsquo;ordre de cette liste, jusqu&rsquo;&agrave; la r&eacute;ussite d&rsquo;une tentative de livraison. Cependant, il PEUT aussi y avoir une limite configurable du nombre d&rsquo;adresses de remplacement qui peuvent &ecirc;tre essay&eacute;es. Dans tous les cas, le client SMTP DEVRAIT essayer au moins deux adresses. </p>
<p>Deux types d&rsquo;informations sont utilis&eacute;s pour ordonner les adresses d&rsquo;h&ocirc;te&nbsp;: les enregistrements MX multiples, et les h&ocirc;tes &agrave; origine multiple. </p>
<p>Les enregistrements MX multiples contiennent une indication de pr&eacute;f&eacute;rence qui DOIT &ecirc;tre utilis&eacute;e pour le tri (voir ci-dessous). Les nombres inf&eacute;rieurs sont pr&eacute;f&eacute;r&eacute;s aux nombres sup&eacute;rieurs. Si il y a plusieurs destinations avec la m&ecirc;me pr&eacute;f&eacute;rence et qu&rsquo;il n&rsquo;y a pas de raison pr&eacute;cise en faveur de l&rsquo;une (par exemple, par reconnaissance d&rsquo;une adresse facile &agrave; atteindre), l&rsquo;envoyeur SMTP DOIT alors faire un choix al&eacute;atoire entre elles pour &eacute;taler la charge sur plusieurs &eacute;changeurs de messagerie pour une organisation sp&eacute;cifique. </p>
<p>L&rsquo;h&ocirc;te de destination (peut-&ecirc;tre tir&eacute; de l&rsquo;enregistrement MX pr&eacute;f&eacute;r&eacute;) peut &ecirc;tre &agrave; origine multiple, auquel cas le r&eacute;solveur de nom de domaine retournera une liste d&rsquo;adresses IP de remplacement. Il est de la responsabilit&eacute; de l&rsquo;interface de r&eacute;solveur de nom de domaine d&rsquo;ordonner cette liste par ordre de pr&eacute;f&eacute;rence d&eacute;croissante si n&eacute;cessaire, et SMTP DOIT les essayer dans l&rsquo;ordre pr&eacute;sent&eacute;. </p>
<p> Bien que la capacit&eacute; &agrave; essayer plusieurs adresses de remplacement soit exig&eacute;e, des installations sp&eacute;cifiques peuvent vouloir limiter ou d&eacute;sactiver l&rsquo;utilisation d&rsquo;adresses de remplacement. La question de savoir si un envoyeur devrait faire des essais utilisant les diff&eacute;rentes adresses d&rsquo;un h&ocirc;te &agrave; origines multiples a &eacute;t&eacute; controvers&eacute;e. Le principal argument en faveur de l&rsquo;utilisation de plusieurs adresses est que cela maximise la probabilit&eacute; de livraison en temps et en heure, et bien s&ucirc;r quelquefois la probabilit&eacute; de livraison tout court ; le contre argument est qu&rsquo;il peut en r&eacute;sulter une consommation inutile de ressources. Noter que l&rsquo;utilisation des ressources est aussi fortement d&eacute;termin&eacute; par la strat&eacute;gie d&rsquo;envoi discut&eacute;e au paragraphe 4.5.4.1. </p>
<p>Si un serveur SMTP re&ccedil;oit un message avec une destination pour laquelle il y a un &eacute;changeur de messagerie (MX, <em>Mail eXchanger</em>) d&eacute;sign&eacute; , il PEUT relayer le message (&eacute;ventuellement apr&egrave;s avoir r&eacute;&eacute;crit les adresses de MAIL FROM et/ou RCPT TO), faire la livraison finale du message, ou l&rsquo;&eacute;carter en utilisant un m&eacute;canisme ext&eacute;rieur &agrave; l&rsquo;environnement de transport fourni par SMTP. Bien s&ucirc;r, aucun de ces derniers ne requiert que la liste des enregistrements MX soit examin&eacute;e plus avant. </p>
<p>Si il d&eacute;termine qu&rsquo;il devrait relayer le message sans r&eacute;&eacute;crire l&rsquo;adresse, il DOIT trier les enregistrements MX pour d&eacute;terminer les candidats &agrave; la livraison. Les enregistrements sont d&rsquo;abord class&eacute;s par pr&eacute;f&eacute;rence, avec la pr&eacute;f&eacute;rence aux enregistrements de plus faible num&eacute;ro. L&rsquo;h&ocirc;te relais DOIT ensuite inspecter la liste pour chercher des noms ou adresses qui pourraient &ecirc;tre connus dans des transactions de messagerie. Si un enregistrement correspondant &agrave; ces crit&egrave;res est trouv&eacute;, tous les enregistrements &agrave; ce niveau de pr&eacute;f&eacute;rence et ceux de num&eacute;ro de pr&eacute;f&eacute;rence plus &eacute;lev&eacute; DOIVENT &ecirc;tre &eacute;limin&eacute;s de la recherche. Si il ne reste aucun enregistrement &agrave; ce point, c&rsquo;est une condition d&rsquo;erreur, et le message DOIT &ecirc;tre retourn&eacute; comme non livrable. Si des enregistrements subsistent, ils DEVRAIENT &ecirc;tre essay&eacute;s, le pr&eacute;f&eacute;r&eacute; en premier, comme d&eacute;crit ci-dessus. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287770"></a><a name="_Toc186079884"></a><a name="_Toc186079796"> 6 D&eacute;tection de probl&egrave;me et traitement</a></h1>
<h2><a name="_Toc186287771"></a><a name="_Toc186079885"></a><a name="_Toc186079797"> 6.1 Livraison fiable et r&eacute;ponses par messagerie &eacute;lectronique</a></h2>
<p> Quand le receveur SMTP accepte de la messagerie (en envoyant un message &quot;250 OK&quot; en r&eacute;ponse &agrave; DATA), il accepte la responsabilit&eacute; de livrer ou relayer le message. Il doit prendre cette responsabilit&eacute; au s&eacute;rieux. Il NE DOIT PAS perdre le message pour des raisons frivoles, comme une d&eacute;faillance ult&eacute;rieure de l&rsquo;h&ocirc;te ou &agrave; cause d&rsquo;un manque de ressources pr&eacute;visible. </p>
<p>Si il y a un &eacute;chec de la livraison apr&egrave;s l&rsquo;acceptation d&rsquo;un message, le receveur SMTP DOIT formuler un message de notification et l&rsquo;envoyer. Cette notification DOIT &ecirc;tre envoy&eacute;e en utilisant un chemin inverse nul (&quot;&lt;&gt;&quot;) dans l&rsquo;enveloppe. Le receveur de cette notification DOIT &ecirc;tre l&rsquo;adresse tir&eacute;e du chemin de retour de l&rsquo;enveloppe (ou la ligne Return-Path:). Cependant, si cette adresse est nul (&quot;&lt;&gt;&quot;), le receveur&nbsp;SMTP NE DOIT PAS envoyer de notification. Visiblement, rien dans cette section ne peut ou ne devrait interdire des d&eacute;cisions locales (c&rsquo;est-&agrave;-dire, au titre du m&ecirc;me environnement syst&egrave;me que le receveur SMTP) d&rsquo;enregistrer ou autrement transmettre localement des informations sur des &eacute;v&eacute;nements d&rsquo;adresse nulle si cela est souhait&eacute;. Si l&rsquo;adresse est une route de source explicite, elle DOIT &ecirc;tre effac&eacute;e lors du bond final. </p>
<p>Par exemple, supposons qu&rsquo;une notification d&rsquo;erreur doive &ecirc;tre envoy&eacute;e pour un message arriv&eacute; avec : </p>
<p> MAIL FROM:&lt;@a,@b:user@d&gt; </p>
<p> Le message de notification DOIT &ecirc;tre envoy&eacute; en utilisant : </p>
<p> RCPT TO:&lt;user@d&gt; </p>
<p>Certains &eacute;checs de livraison apr&egrave;s l&rsquo;acceptation du message par SMTP vont &ecirc;tre in&eacute;vitables. Par exemple, il peut &ecirc;tre impossible au serveur SMTP receveur de valider toutes les adresses de livraison dans la ou les commandes RCTP &agrave; cause d&rsquo;une erreur syst&egrave;me du domaine du &quot;logiciel&quot;, parce que la cible est une liste de diffusion (voir plus haut la discussion de RCPT), ou parce que le serveur agit comme relais et n&rsquo;a pas d&rsquo;acc&egrave;s imm&eacute;diat au syst&egrave;me de livraison. </p>
<p>Pour &eacute;viter de recevoir des messages dupliqu&eacute;s par suite de d&eacute;passements de temporisations, un receveur&nbsp;SMTP DOIT chercher &agrave; minimiser le d&eacute;lai n&eacute;cessaire pour r&eacute;pondre &agrave; l&rsquo;indicateur &lt;CRLF&gt;.&lt;CRLF&gt; de fin de donn&eacute;es. Voir &agrave; la RFC&nbsp;1047 [28] la discussion de ce probl&egrave;me. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287772"></a><a name="_Toc186079886"></a><a name="_Toc186079798"> 6.2 D&eacute;tection de boucle</a></h2>
<p> Le simple comptage du nombre d&rsquo;en-t&ecirc;tes &quot;Received:&quot; dans un message s&rsquo;est r&eacute;v&eacute;l&eacute; &ecirc;tre une m&eacute;thode efficace, bien que rarement optimale, pour d&eacute;tecter les boucles dans les syst&egrave;mes de messagerie. Les serveurs SMTP qui utilisent cette technique DEVRAIENT avoir un seuil de rejet &eacute;lev&eacute;, normalement d&rsquo;au moins cent entr&eacute;es re&ccedil;ues. Quel que soit le m&eacute;canisme utilis&eacute;, les serveurs DOIVENT contenir des dispositions pour d&eacute;tecter et arr&ecirc;ter les boucles &eacute;videntes. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287773"></a><a name="_Toc186079887"></a><a name="_Toc186079799"> 6.3 Compensation des irr&eacute;gularit&eacute;s</a></h2>
<p> Malheureusement, des variations, des interpr&eacute;tations cr&eacute;atives, et des violations flagrantes des protocoles de messagerie Internet apparaissent effectivement ; certains sugg&egrave;rent m&ecirc;me qu&rsquo;elles surviennent assez fr&eacute;quemment. Le d&eacute;bat sur la question de savoir si un receveur ou relais SMTP bien conform&eacute; devrait rejeter un message mal form&eacute;, tenter de le passer inchang&eacute;, ou tenter de le r&eacute;parer pour accro&icirc;tre le score des succ&egrave;s de livraison (ou de r&eacute;ponses subs&eacute;quentes) a commenc&eacute; presque &agrave; l&rsquo;aube de la messagerie sur les r&eacute;seaux structur&eacute;s et ne donne pas le moindre signe d&rsquo;apaisement. Les avocats du rejet font valoir que les tentatives de r&eacute;paration sont rarement parfaitement ad&eacute;quates et que le rejet des mauvais messages est la seule fa&ccedil;on d&rsquo;obtenir la r&eacute;paration du logiciel d&eacute;fectueux. Les avocats de la r&eacute;paration ou de la livraison &agrave; tout va argumentent que l&rsquo;usager pr&eacute;f&egrave;re que les messages passent quoi qu&rsquo;il arrive et qu&rsquo;il y a une pression significative du march&eacute; dans cette direction. En pratique, ces pressions du march&eacute; peuvent &ecirc;tre plus importantes sur les fabricants que la stricte conformit&eacute; aux normes, quelles que soient les pr&eacute;f&eacute;rences des d&eacute;veloppeurs r&eacute;els. </p>
<p>Les probl&egrave;mes associ&eacute;s aux messages mal form&eacute;s ont &eacute;t&eacute; exacerb&eacute;s par l&rsquo;introduction des protocoles de lecture de messagerie &agrave; agent d&rsquo;usager divis&eacute; [3, 26, 5, 21]. Ces protocoles ont encourag&eacute; l&rsquo;utilisation de SMTP comme protocole de courrier, et les serveurs SMTP comme syst&egrave;mes de relais pour ces h&ocirc;tes client (qui sont souvent connect&eacute;s de fa&ccedil;on seulement intermittente &agrave; l&rsquo;Internet). Historiquement, il manquait &agrave; nombre de ces machines clientes les m&eacute;canismes et les informations assum&eacute;s par SMTP (et bien s&ucirc;r, par le protocole de format de messagerie [7]). Certains d&rsquo;entre eux ne pouvaient m&ecirc;me pas garder une trace ad&eacute;quate de l&rsquo;heure ; d&rsquo;autres n&rsquo;avaient aucune id&eacute;e du concept de zone horaire ; d&rsquo;autres encore ne pouvaient pas identifier leur propre nom ou adresse ; et, bien s&ucirc;r, aucun ne pouvait satisfaire aux hypoth&egrave;ses qui sous-tendent la conception de la RFC 822 sur les adresses authentifi&eacute;es. </p>
<p>En r&eacute;ponse &agrave; ces clients SMTP faibles, de nombreux syst&egrave;mes SMTP compl&egrave;tent maintenant les messages qui leur sont livr&eacute;s en une forme incompl&egrave;te ou incorrecte. Cette strat&eacute;gie est g&eacute;n&eacute;ralement consid&eacute;r&eacute;e comme appropri&eacute;e lorsque le serveur peut identifier ou authentifier le client, et qu&rsquo;il y a un accord pr&eacute;alable entre eux. &Agrave; l&rsquo;oppos&eacute;, il y a beaucoup de souci &agrave; ce faire au sujet des corrections faites par un serveur SMTP de relais ou de livraison qui n&rsquo;a que peu ou pas du tout de connaissances sur la machine cliente ou de l&rsquo;usager. </p>
<p>Les changements suivants PEUVENT &ecirc;tre appliqu&eacute;s &agrave; un message en cours de traitement, quand n&eacute;cessaire, par un serveur SMTP d&rsquo;origine, ou un serveur utilis&eacute; comme cible de SMTP comme protocole de messagerie initial : <br>
  - Ajout d&rsquo;un champ identifiant de message lorsqu&rsquo;il n&rsquo;en appara&icirc;t aucun <br>
- Ajout d&rsquo;une date, heure ou zone horaire lorsqu&rsquo;il n&rsquo;y en a pas <br>
- Correction des adresses au format FQDN appropri&eacute;. </p>
<p>Moins le serveur a d&rsquo;informations sur le client, moins ces changements auront de chances d&rsquo;&ecirc;tre corrects et la plus grande prudence devrait &ecirc;tre observ&eacute;e lorsqu&rsquo;on se demande s&rsquo;il faut ou nom effectuer des r&eacute;parations et comment les faire. Ces changements NE DOIVENT PAS &ecirc;tre appliqu&eacute;s par un serveur SMTP qui fournit une fonction de relais interm&eacute;diaire. </p>
<p>Dans tous les cas, des clients qui fonctionnent de fa&ccedil;on appropri&eacute;e en fournissant des informations correctes sont pr&eacute;f&eacute;r&eacute;s &agrave; des corrections par le serveur SMTP. Dans tous les cas, la documentation des actions effectu&eacute;es par les serveurs (dans les champs de trace et/ou les commentaires d&rsquo;en-t&ecirc;te) est vivement encourag&eacute;e. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287774"></a><a name="_Toc186079888"></a><a name="_Toc186079800"> 7 Consid&eacute;rations pour la s&eacute;curit&eacute;</a></h1>
<h2><a name="_Toc186287775"></a><a name="_Toc186079889"></a><a name="_Toc186079801"> 7.1 S&eacute;curit&eacute; de la messagerie et usurpation d&rsquo;identit&eacute;</a></h2>
<p> La messagerie SMTP n&rsquo;est par nature pas s&ucirc;re en ce qu&rsquo;il est parfaitement faisable m&ecirc;me pour un usager tr&egrave;s ordinaire de n&eacute;gocier directement avec les serveurs SMTP de r&eacute;ception et de relais et de cr&eacute;er des messages qui tromperont un receveur innocent en lui faisant croire qu&rsquo;ils viennent d&rsquo;autre part. La construction d&rsquo;un message tel que le comportement &quot;d&rsquo;usurpation&quot; ne puisse &ecirc;tre d&eacute;tect&eacute; par un expert est un peu plus difficile, mais pas suffisamment pour &ecirc;tre une dissuasion envers quelqu&rsquo;un de d&eacute;termin&eacute; et comp&eacute;tent. Par cons&eacute;quent, comme les connaissances en mati&egrave;re de messagerie Internet augmentent, il est de plus en plus connu que la messagerie SMTP ne peut, par nature, &ecirc;tre authentifi&eacute;e, et que des v&eacute;rifications d&rsquo;int&eacute;grit&eacute; ne peuvent pas &ecirc;tre fournies, au niveau transport. La s&eacute;curit&eacute; r&eacute;elle de la messagerie repose seulement sur des m&eacute;thodes de bout en bout qui impliquent les corps de message, comme celles qui utilisent les signatures num&eacute;riques (voir [14] et, par exemple, PGP [4] ou S/MIME [31]). </p>
<p>Diverses extensions de protocole et options de configuration qui fournissent l&rsquo;authentification au niveau transport (par exemple, d&rsquo;un client SMTP &agrave; un serveur SMTP) am&eacute;liorent quelque peu la situation traditionnelle d&eacute;crite ci-dessus. Cependant, sauf si elles sont accompagn&eacute;es de transferts prudents de responsabilit&eacute; dans un environnement de confiance con&ccedil;u avec soin, elles restent par nature plus faibles que des m&eacute;canismes de bout en bout qui utilisent des messages &agrave; signature num&eacute;rique plut&ocirc;t que de d&eacute;pendre de l&rsquo;int&eacute;grit&eacute; du syst&egrave;me de transport. </p>
<p>Les efforts pour rendre plus difficile aux usagers un r&eacute;glage des champs &quot;From&quot; d&rsquo;en-t&ecirc;te et chemin de retour de l&rsquo;enveloppe pointant sur des adresses valides autres que la leur s&rsquo;&eacute;garent dans une grande mesure : ils frustrent des applications l&eacute;gitimes dans lesquelles le courrier est envoy&eacute; par un usager au nom d&rsquo;un autre, ou dans lesquelles des r&eacute;ponses d&rsquo;erreur (ou normales) devraient &ecirc;tre dirig&eacute;es sur une adresse sp&eacute;ciale. (Les syst&egrave;mes qui donnent aux utilisateurs des moyens convenables pour alt&eacute;rer ces champs message par message devraient essayer d&rsquo;&eacute;tablir une adresse de bo&icirc;te &agrave; lettre principale et permanente pour l&rsquo;utilisateur de telle sorte que les champs Sender au sein des donn&eacute;es de message puissent &ecirc;tre g&eacute;n&eacute;r&eacute;s de fa&ccedil;on raisonnable.) </p>
<p>La pr&eacute;sente sp&eacute;cification ne creusera pas plus loin les questions d&rsquo;authentification associ&eacute;es &agrave; SMTP tout en plaidant qu&rsquo;une fonctionnalit&eacute; utile ne doit pas &ecirc;tre d&eacute;sactiv&eacute;e dans l&rsquo;espoir de fournir une maigre marge de protection contre un usager ignorant qui essaye de trafiquer la messagerie. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287776"></a><a name="_Toc186079890"></a><a name="_Toc186079802"> 7.2 Copies &quot;aveugles&quot;</a></h2>
<p> Les adresses qui n&rsquo;apparaissent pas dans les en-t&ecirc;tes de message peuvent appara&icirc;tre dans les commandes RCTP &agrave; un serveur SMTP pour un certain nombre de raisons. Les deux plus courantes impliquent l&rsquo;utilisation d&rsquo;une adresse de messagerie comme d&rsquo;un &quot;diffuseur de courrier&quot; (une seule adresse qui se r&eacute;sout en plusieurs adresses) et l&rsquo;apparition de &quot;copies aveugles&quot;. Particuli&egrave;rement lorsque plus d&rsquo;une commande RCTP est pr&eacute;sente, et afin d&rsquo;&eacute;viter de contrecarrer certains des objets de ces m&eacute;canismes, les clients et les serveurs SMTP NE DEVRAIENT PAS copier tout l&rsquo;ensemble des arguments de la commande RCTP dans les en-t&ecirc;tes, soit au titre des en-t&ecirc;tes de trace soit pour des en-t&ecirc;tes d&rsquo;information ou d&rsquo;extension priv&eacute;e. Comme cette r&egrave;gle est souvent viol&eacute;e en pratique, et ne peut pas &ecirc;tre mise en application, les syst&egrave;mes SMTP d&rsquo;envoi qui sont au fait de l&rsquo;utilisation &quot;bcc&quot; PEUVENT trouver utile d&rsquo;envoyer chaque copie aveugle comme une transaction de message s&eacute;par&eacute;e contenant seulement une commande RCTP. </p>
<p>Il n&rsquo;y a pas de relation inh&eacute;rente entre l&rsquo;adresse &quot;inverse&quot; (des commandes MAIL, SAML, etc.,) ou &quot;de transmission&quot; (RCPT) dans la transaction SMTP (&quot;enveloppe&quot;) et l&rsquo;adresse dans l&rsquo;en-t&ecirc;te. Les syst&egrave;mes receveurs NE DEVRAIENT PAS tenter de d&eacute;duire de telles relations et de les utiliser pour alt&eacute;rer les en-t&ecirc;tes de message pour la livraison. L&rsquo;en-t&ecirc;te populaire &quot;Apparamment-pour&quot; est une violation de ce principe ainsi qu&rsquo;une source fr&eacute;quence de divulgation involontaire d&rsquo;informations et NE DEVRAIT PAS &ecirc;tre utilis&eacute;. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287777"></a><a name="_Toc186079891"></a><a name="_Toc186079803"> 7.3 VRFY, EXPN, et la s&eacute;curit&eacute;</a></h2>
<p> Comme expos&eacute; au paragraphe 3.5, les sites individuels peuvent vouloir d&eacute;sactiver VRFY ou/et EXPN pour des raisons de s&eacute;curit&eacute;. En corollaire de ci-dessus, les mises en &oelig;uvre qui permettent cela NE DOIVENT PAS para&icirc;tre avoir v&eacute;rifi&eacute; des adresses qui ne sont pas, en fait, v&eacute;rifi&eacute;es. Si un site d&eacute;sactive ces commandes pour des raisons de s&eacute;curit&eacute;, le serveur SMTP DOIT retourner une r&eacute;ponse 252, plut&ocirc;t qu&rsquo;un code qui pourrait &ecirc;tre confondu avec une v&eacute;rification r&eacute;ussie ou non. </p>
<p>Le retour d&rsquo;un code de r&eacute;ponse 250 avec l&rsquo;adresse figurant dans la commande VRFY apr&egrave;s avoir seulement v&eacute;rifi&eacute; la syntaxe viole cette r&egrave;gle. Bien s&ucirc;r, une mise en &oelig;uvre qui &quot;prend en charge&quot; VRFY en retournant toujours 550 que l&rsquo;adresse soit valide ou non est &eacute;galement non conforme. </p>
<p>Durant ces derni&egrave;res ann&eacute;es, le contenu des listes de diffusion est devenu populaire comme source d&rsquo;informations d&rsquo;adresses pour ce qu&rsquo;on appelle les &quot;spammeurs&quot;. L&rsquo;utilisation de EXPN pour &quot;engranger&quot; des adresses a augment&eacute; lorsque les administrateurs de listes ont install&eacute; des protections contre les usages inappropri&eacute;s des listes elles-m&ecirc;mes. Les mises en &oelig;uvre DEVRAIENT encore prendre en charge EXPN, mais les sites DEVRAIENT &eacute;valuer avec soin les avantages et inconv&eacute;nients. Comme des m&eacute;canismes d&rsquo;authentification sont introduits dans SMTP, certains sites pourraient choisir de ne rendre EXPN disponible qu&rsquo;aux demandeurs authentifi&eacute;e. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287778"></a><a name="_Toc186079892"></a><a name="_Toc186079804"> 7.4 Divulgation d&rsquo;informations dans les annonces</a></h2>
<p> Il y a eu un d&eacute;bat sur les avantages et les inconv&eacute;nients pour la correction d&rsquo;erreurs d&rsquo;annoncer le type et la version du serveur (et parfois m&ecirc;me du nom de domaine du serveur) dans la r&eacute;ponse d&rsquo;accueil ou en r&eacute;ponse &agrave; la commande HELP et des d&eacute;savantages de l&rsquo;exposition d&rsquo;informations qui pourraient &ecirc;tre utiles &agrave; une potentielle attaque hostile. L&rsquo;utilit&eacute; des informations de correction d&rsquo;erreurs ne fait aucun doute. Ceux qui plaident en faveur de les rendre disponibles soulignent qu&rsquo;il vaut bien mieux s&eacute;curiser r&eacute;ellement un serveur SMTP plut&ocirc;t que d&rsquo;esp&eacute;rer que dissimuler des faiblesses connues en cachant l&rsquo;identit&eacute; pr&eacute;cise du serveur fournira une meilleure protection. Les sites sont encourag&eacute;s &agrave; &eacute;valuer le compromis en gardant cette question pr&eacute;sente &agrave; l&rsquo;esprit ; les mises en &oelig;uvre sont fortement encourag&eacute;es &agrave; rendre disponibles au minimum les informations de type et de version de quelque fa&ccedil;on que ce soit aux autres h&ocirc;tes du r&eacute;seau. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287779"></a><a name="_Toc186079893"></a><a name="_Toc186079805"> 7.5 Divulgation d&rsquo;informations dans les champs Trace</a></h2>
<p> Dans certaines circonstances, telles que lorsque le message prend sa source au sein d&rsquo;un LAN dont les h&ocirc;tes ne sont pas directement sur l&rsquo;Internet public, les champs de trace (&quot;Received&quot;) produits en conformit&eacute; avec la pr&eacute;sente sp&eacute;cification peuvent divulguer des noms d&rsquo;h&ocirc;te et informations similaires qui ne seraient pas normalement disponibles. Ceci ne pose ordinairement pas de probl&egrave;me, mais des sites avec des pr&eacute;occupations particuli&egrave;res en mati&egrave;re de divulgation de nom devraient en &ecirc;tre averties. Aussi, la clause FOR facultative devrait &ecirc;tre fournie avec prudence ou pas du tout quand plusieurs receveurs sont impliqu&eacute;s de peur qu&rsquo;elle ne divulgue par inadvertance les identit&eacute;s de receveurs en &quot;copie aveugle&quot; aux autres receveurs. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287780"></a><a name="_Toc186079894"></a><a name="_Toc186079806"> 7.6 Divulgation d&rsquo;informations dans la transmission des messages</a></h2>
<p> Comme expos&eacute; au paragraphe 3.4, l&rsquo;utilisation des codes de r&eacute;ponse 251 ou 551 pour identifier les remplacements d&rsquo;adresse associ&eacute;s &agrave; une bo&icirc;te &agrave; lettres peuvent divulguer par inadvertance des informations sensibles. Les sites qui sont concern&eacute;s par ces questions devraient s&rsquo;assurer qu&rsquo;ils choisissent et configurent les serveurs de fa&ccedil;on appropri&eacute;e. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287781"></a><a name="_Toc186079895"></a><a name="_Toc186079807"> 7.7 Port&eacute;e du fonctionnement des serveurs SMTP</a></h2>
<p> Il est un principe bien &eacute;tabli qu&rsquo;un serveur SMTP peut refuser d&rsquo;accepter des messages pour toute raison op&eacute;rationnelle ou technique qui a un sens pour le site qui fournit le serveur. Cependant, c&rsquo;est la coop&eacute;ration entre les sites et les installations qui rend l&rsquo;Internet possible. Si les sites tirent un avantage excessif du droit de rejeter le trafic, l&rsquo;universalit&eacute; de la disponibilit&eacute; de la messagerie &eacute;lectronique (une des forces de l&rsquo; Internet) sera menac&eacute;e ; il faut bien r&eacute;fl&eacute;chir aux cons&eacute;quences et veiller &agrave; un &eacute;quilibre lorsqu&rsquo;un site d&eacute;cide d&rsquo;&ecirc;tre s&eacute;lectif quant au trafic qu&rsquo;il va accepter et traiter. </p>
<p>Dans les ann&eacute;es r&eacute;centes, l&rsquo;utilisation de la fonction de relais &agrave; travers des sites choisis de fa&ccedil;on arbitraire a &eacute;t&eacute; mise &agrave; profit au titre d&rsquo;efforts hostiles pour cacher les origines r&eacute;elles de messages. Certains sites ont d&eacute;cid&eacute; de limiter l&rsquo;utilisation de la fonction relais &agrave; des sources connues ou identifiables, et les mises en &oelig;uvre DEVRAIENT fournir la capacit&eacute; d&rsquo;effectuer ce type de filtrage. Lorsque des messages sont rejet&eacute;s pour cela ou pour d&rsquo;autres raisons de politique, un code 550 DEVRAIT &ecirc;tre utilis&eacute; en r&eacute;ponse &agrave;, selon le cas, EHLO, MAIL, ou RCPT. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287782"></a><a name="_Toc186079896"></a><a name="_Toc186079808"> 8 Consid&eacute;rations relatives &agrave; l&rsquo;IANA</a></h1>
<p>IANA entretiendra trois registres &agrave; l&rsquo;appui de la pr&eacute;sente sp&eacute;cification. Le premier comporte les extensions de service SMTP avec les mots cl&eacute;s associ&eacute;s, et, en tant que de besoin, les param&egrave;tres et verbes. Comme sp&eacute;cifi&eacute; au paragraphe 2.2.2, aucune entr&eacute;e ne peut &ecirc;tre faite dans ce registre qui commence par un &quot;X&quot;. Les entr&eacute;es ne peuvent &ecirc;tre faites que pour les extensions de service (et les mots cl&eacute;s, param&egrave;tres ou verbes associ&eacute;s) qui sont d&eacute;finies dans les RFC en cours de normalisation ou exp&eacute;rimentales sp&eacute;cifiquement approuv&eacute;es par l&rsquo;IESG &agrave; cette fin. </p>
<p>Le second registre comporte les &quot;marqueurs&quot; qui identifient les formes de domaines litt&eacute;raux autres que ceux pour les adresses IPv4 (sp&eacute;cifi&eacute;s dans la RFC 821 et dans le pr&eacute;sent document) et pour les adresses IPv6 (sp&eacute;cifi&eacute;s dans le pr&eacute;sent document). Des types litt&eacute;raux suppl&eacute;mentaires devront &ecirc;tre normalis&eacute;s avant utilisation&nbsp;; aucun n&rsquo;est pr&eacute;vu pour l&rsquo;instant. </p>
<p>Le troisi&egrave;me, &eacute;tabli par la RFC 821 et renouvel&eacute; par la pr&eacute;sente sp&eacute;cification, est un registre des identifiants de lien et de protocoles &agrave; utiliser avec les sous paragraphes &quot;via&quot; et &quot;with&quot; de l&rsquo;horodatage (en-t&ecirc;te &quot;Received:&quot;) d&eacute;crits au paragraphe&nbsp;4.4. Les identifiants de lien et de protocole s&rsquo;ajoutant &agrave; ceux sp&eacute;cifi&eacute;s dans le pr&eacute;sent document ne peuvent &ecirc;tre enregistr&eacute;s que par normalisation ou au moyen d&rsquo;une extension de protocole exp&eacute;rimental document&eacute; dans une RFC et approuv&eacute;e par l&rsquo;IESG. </p>
<h1><a name="_Toc186287783"></a><a name="_Toc186079897"></a><a name="_Toc186079809"> 9 R&eacute;f&eacute;rences</a></h1>
<p>[1] American National Standards Institute (anciennement United States of America Standards Institute), X3.4, 1968, &quot;USA Code for Information Interchange&quot;. ANSI X3.4-1968 a &eacute;t&eacute; remplac&eacute; par de nouvelles versions avec de l&eacute;g&egrave;res modifications, mais la version de 1968 reste d&rsquo;actualit&eacute; pour l&rsquo;Internet. </p>
<p>[2] R. Braden, &quot;Exigenges pour les h&ocirc;tes Internet - application et prise en charge&quot;, STD 3, RFC 1123, octobre 1989. </p>
<p>[3] M. Butler, D. Chase, J. Goldberger, J. Postel et J. Reynolds, &quot;Protocole Post Office - version 2&quot;, RFC 937, f&eacute;vrier&nbsp;1985. </p>
<p>[4] J. Callas, L. Donnerhacke, H. Finney et R. Thayer, &quot;Format de message OpenPGP&quot;, RFC 2440, novembre 1998. </p>
<p>[5] M. Crispin, &quot;Protocole d&rsquo;acc&egrave;s de messagerie interactive - version 2&quot;, RFC 1176, ao&ucirc;t 1990. </p>
<p>[6] M. Crispin, &quot;Protocole d&rsquo;acc&egrave;s aux messages Internet - version 4&quot;, RFC 2060, d&eacute;cembre 1996. </p>
<p>[7] D. Crocker, &quot;Norme pour le format des messages de texte ARPA&quot;, RFC 822, ao&ucirc;t 1982. </p>
<p>[8] D. Crocker et P. Overell, &eacute;d., &quot;BNF augment&eacute; pour les sp&eacute;cifications de syntaxe : ABNF&quot;, RFC 2234, novembre 1997. </p>
<p>[9] J. De Winter, &quot;Extension de service SMTP pour le d&eacute;but de file d&rsquo;attente de message distant&quot;, RFC 1985, ao&ucirc;t 1996. </p>
<p>[10] R. Fajman, &quot;Format de message extensible pour les notifications de disposition de message &quot;, RFC 2298, mars 1998. </p>
<p>[11] N. Freed, &quot;Comportement des pare-feu Internet et exigences&quot;, RFC 2979, octobre 2000. </p>
<p>[12] N. Freed et N. Borenstein, &quot;Extensions multi usages de messagerie Internet (MIME) Partie une : Format des corps de message Internet&quot;, RFC 2045, d&eacute;cembre 1996. </p>
<p>[13] N. Freed, &quot;Extension de service SMTP pour la commande Pipelining <em>(intubation)</em>&quot;, RFC 2920, septembre 2000. </p>
<p>[14] J. Galvin, S. Murphy, S. Crocker et N. Freed, &quot;S&eacute;curit&eacute; de Multiparts pour MIME: Multipart/Signed et Multipart/Encrypted&quot;, RFC 1847, octobre 1995. </p>
<p>[15] R. Gellens et J. Klensin, &quot;Pr&eacute;sentation de message&quot;, RFC 2476, d&eacute;cembre 1998. </p>
<p>[16] S. Kille, &quot;Transposition entre X.400 et RFC822/MIME&quot;, RFC 2156, janvier 1998. </p>
<p>[17] R. Hinden et S. Deering, &eacute;d. &quot;Architecture d&rsquo;adressage de IP version 6&quot;, RFC 2373, juillet 1998. </p>
<p>[18] J. Klensin, N. Freed et K. Moore, &quot;Extension de service SMTP pour la d&eacute;claration de taille de message&quot;, STD 10, RFC&nbsp;1870, novembre 1995. </p>
<p>[19] J. Klensin, N. Freed, M. Rose, E. Stefferud et D. Crocker, &quot;Extensions de service SMTP&quot;, STD 10, RFC 1869, novembre 1995. </p>
<p>[20] J. Klensin, N. Freed, M. Rose, E. Stefferud et D. Crocker, &quot;Extension de service SMTP pour transport MIME &agrave; 8 bits&quot;, RFC 1652, juillet 1994. </p>
<p>[21] M. Lambert, &quot;PCMAIL : syst&egrave;me de messagerie r&eacute;partie pour ordinateurs personnels&quot;, RFC 1056, juillet 1988. </p>
<p>[22] P. Mockapetris, &quot;Noms de domaine &ndash; mise en &oelig;uvre et sp&eacute;cification&quot;, STD 13, RFC 1035, novembre 1987. </p>
<p> P. Mockapetris, &quot;Noms de domaine - concepts et facilit&eacute;s&quot;, STD 13, RFC 1034, novembre 1987. </p>
<p>[23] K. Moore, &quot;MIME (Extensions multi-usages de messagerie Internet) Partie 3 : Extensions d&rsquo;en-t&ecirc;te de message pour texte non ASCII&quot;, RFC 2047, d&eacute;cembre 1996. </p>
<p>[24] K. Moore, &quot;Extension de service SMTP pour notifications d&rsquo;&eacute;tat de livraison&quot;, RFC 1891, janvier 1996. </p>
<p>[25] K. Moore et G. Vaudreuil, &quot;Format de message extensible pour notifications d&rsquo;&eacute;tat de livraison&quot;, RFC 1894, janvier&nbsp;1996. </p>
<p>[26] J. Myers et M. Rose, &quot;Protocole Post Office - version 3&quot;, STD 53, RFC 1939, mai 1996. </p>
<p>[27] C. Partridge, &quot;L&rsquo;acheminement de la messagerie et le syst&egrave;me des domaines&quot;, RFC 974, janvier 1986. </p>
<p>[28] C. Partridge, &quot;Messages dupliqu&eacute;s et SMTP&quot;, RFC 1047, f&eacute;vrier 1988. </p>
<p>[29] J. Postel, &quot;Protocole de contr&ocirc;le de transmission &ndash; sp&eacute;cification du protocole du programme DARPA Internet&quot;, STD 7, RFC 793, septembre 1981. </p>
<p>[30] J. Postel, &quot;Protocole simple de transfert de messagerie&quot;, RFC 821, Ao&ucirc;t 1982. </p>
<p>[31] B. Ramsdell, &eacute;d., &quot;S/MIME version 3 Sp&eacute;cification de message&quot;, RFC 2633, juin 1999. </p>
<p>[32] P. Resnick, &eacute;d., &quot;Format des messages Internet&quot;, RFC 2822, avril 2001. </p>
<p>[33] G. Vaudreuil, &quot;Extensions de service SMTP pour la transmission de grands messages MIME binaires&quot;, RFC 1830, ao&ucirc;t&nbsp;1995. </p>
<p>[34] G. Vaudreuil, &quot;Codes d&rsquo;&eacute;tat du syst&egrave;me de messagerie am&eacute;lior&eacute;e&quot;, RFC 1893, janvier 1996. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287784"></a><a name="_Toc186079898"></a><a name="_Toc186079810"> 10 Adresse de l&rsquo;&eacute;diteur</a></h1>
<p>John C. Klensin <br>
AT&amp;T Laboratories <br>
99 Bedford St <br>
Boston, MA 02111 USA <br>
Phone: 617-574-3076 <br>
m&eacute;l : klensin@research.att.com </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287785"></a><a name="_Toc186079899"></a><a name="_Toc186079811"> 11 Remerciements</a></h1>
<p>De nombreuse personne ont travaill&eacute; dur et longtemps sur les nombreuses versions du pr&eacute;sent document. Il y a eu de larges d&eacute;bats au sein du groupe de travail DRUMS de l&rsquo;IETF, &agrave; la fois sur sa liste de diffusion et dans des discussions face &agrave; face, sur de nombreuses questions techniques et sur le r&ocirc;le d&rsquo;une norme r&eacute;vis&eacute;e pour le transport de la messagerie Internet, et de nombreux contributeurs ont aid&eacute; &agrave; formuler le texte de la pr&eacute;sente sp&eacute;cification. Les centaines de participants &agrave; ces nombreuses discussions depuis la production de la RFC 821 sont trop nombreux pour qu&rsquo;on les mentionne, mais ils ont tous aid&eacute; &agrave; faire de ce document ce qu&rsquo;il est devenu. </p>
<p>&nbsp; </p>
<p>&nbsp; </p>
<h1 align="center"><a name="_Toc186287786"></a><a name="_Toc186079900"></a><a name="_Toc186079812"> APPENDICES</a></h1>
<p>&nbsp; </p>
<h1><a name="_Toc186287787"></a><a name="_Toc186079901"></a><a name="_Toc186079813"> A Service</a> de transport TCP </h1>
<p>La connexion TCP prend en charge la transmission d&rsquo;octets de 8 bits. Les donn&eacute;es SMTP sont en caract&egrave;res ASCII &agrave; 7 bits. Chaque caract&egrave;re est transmis comme un octet de 8 bits avec le bit de plus fort poids mis &agrave; z&eacute;ro. Les extensions de service peuvent modifier cette r&egrave;gle pour permettre la transmission d&rsquo;octets de donn&eacute;es &agrave; 8 bits pleins au titre du corps de message, mais pas pour les commandes ou r&eacute;ponses SMTP. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287788"></a><a name="_Toc186079902"></a><a name="_Toc186079814"> B G&eacute;n&eacute;rer les commandes SMTP &agrave; partir des en-t&ecirc;tes de la RFC 822</a></h1>
<p>Certains syst&egrave;mes utilisent les en-t&ecirc;tes de la RFC 822 (uniquement) dans un protocole de pr&eacute;sentation de message, ou autrement g&eacute;n&egrave;rent les commandes SMTP &agrave; partir des en-t&ecirc;tes de la RFC 822 lorsqu&rsquo;un tel message est pass&eacute; &agrave; un MTA &agrave; partir d&rsquo;un agent d&rsquo;utilisateur. Bien que le protocole MTA-UA soit une affaire priv&eacute;e, qui n&rsquo;est couverte par aucune des normes de l&rsquo;Internet, cette approche pose des probl&egrave;mes. Par exemple, il y a eu des probl&egrave;mes r&eacute;p&eacute;t&eacute;s avec le traitement appropri&eacute; des copies &quot;bcc&quot; et des listes de redistribution lorsque des informations qui appartiennent conceptuellement &agrave; une enveloppe de message ne onst pas s&eacute;par&eacute;es (et gard&eacute;es s&eacute;par&eacute;es) t&ocirc;t dans le traitement des informations d&rsquo;en-t&ecirc;te. </p>
<p>Il est recommand&eacute; que l&rsquo;agent d&rsquo;utilisateur fournisse son MTA initial (&quot;client de pr&eacute;sentation&quot;) avec une enveloppe s&eacute;par&eacute;e du message lui-m&ecirc;me. Cependant, si l&rsquo;enveloppe n&rsquo;est pas fournie, les commandes SMTP DEVRAIENT &ecirc;tre g&eacute;n&eacute;r&eacute;es comme suit : </p>
<p> 1. Chaque adresse de receveur provenant d&rsquo;un champ d&rsquo;en-t&ecirc;te TO, CC, ou BCC DEVRAIT &ecirc;tre copi&eacute;e dans la commande RCTP (g&eacute;n&eacute;rant plusieurs copies de message si c&rsquo;est n&eacute;cessaire pour la mise en file d&rsquo;attente ou la livraison). Cela inclut toute adresse figurant dans un &quot;groupe&quot; de la RFC 822. Tout champ BCC DEVRAIT alors &ecirc;tre retir&eacute; de l&rsquo;en-t&ecirc;te. Une fois ce processus achev&eacute;, il DEVRAIT &ecirc;tre v&eacute;rifi&eacute; que les en-t&ecirc;tes restants ont au moins un en-t&ecirc;te To:, Cc:, ou Bcc:. Si aucun n&rsquo;y est, un en-t&ecirc;te bcc: sans information suppl&eacute;mentaire DEVRAIT &ecirc;tre ins&eacute;r&eacute; comme sp&eacute;cifi&eacute; en [32]. </p>
<p> 2. L&rsquo;adresse de retour dans la commande MAIL DEVRAIT, si possible, &ecirc;tre d&eacute;duite de l&rsquo;identit&eacute; du syst&egrave;me pour l&rsquo;usager (local) qui pr&eacute;sente, et autrement le champ d&rsquo;en-t&ecirc;te &quot;From:&quot;. Si une identit&eacute; de syst&egrave;me est disponible, elle DEVRAIT aussi &ecirc;tre copi&eacute;e dans le champ d&rsquo;en-t&ecirc;te Sender si il est diff&eacute;rent de l&rsquo;adresse du champ d&rsquo;en-t&ecirc;te From. (Tout champ Sender qui se trouverait d&eacute;j&agrave; l&agrave; DEVRAIT &ecirc;tre retir&eacute;.) Les syst&egrave;mes peuvent fournir un moyen pour que le pr&eacute;sentateur outrepasse l&rsquo;adresse de retour d&rsquo;enveloppe, mais peuvent vouloir restreindre son utilisation &agrave; des usagers privil&eacute;gi&eacute;s. Cela n&rsquo;emp&ecirc;chera pas les messages frauduleux, mais peut diminuer l&rsquo;incidence ; voir le paragraphe 7.1. </p>
<p>Lorsqu&rsquo;un MTA est utilis&eacute; de cette fa&ccedil;on, il porte la responsabilit&eacute; de s&rsquo;assurer que le message transmis est valide. Les m&eacute;canismes de v&eacute;rification de cette validit&eacute;, et du traitement (ou du retour) des messages qui ne sont pas valides au moment de l&rsquo;arriv&eacute;e, font partie de l&rsquo;interface MUA-MTA et ne sont pas trait&eacute;s par la pr&eacute;sente sp&eacute;cification. </p>
<p>Un protocole de pr&eacute;sentation fond&eacute; sur les seules informations de la RFC 822 NE DOIT PAS &ecirc;tre utilis&eacute; comme passerelle pour un message provenant d&rsquo;un syst&egrave;me de messagerie &eacute;tranger (non SMTP) dans un environnement SMTP. Des informations suppl&eacute;mentaires pour construire une enveloppe doivent d&rsquo;abord venir d&rsquo;une source dans l&rsquo;autre environnement, d&rsquo;en-t&ecirc;tes suppl&eacute;mentaires ou de l&rsquo;enveloppe du syst&egrave;me &eacute;tranger. </p>
<p>Les tentatives pour passer des messages en utilisant seulement leurs champs d&rsquo;en-t&ecirc;te &quot;to&quot; et &quot;cc&quot; ont caus&eacute; de fa&ccedil;on r&eacute;p&eacute;t&eacute;e des boucles de messagerie et autres comportements nocifs au bon fonctionnement de l&rsquo;environnement de la messagerie Internet. Ces probl&egrave;mes ont &eacute;t&eacute; particuli&egrave;rement courants lorsque le message a pour origine une liste de diffusion Internet et est distribu&eacute; dans l&rsquo;environnement &eacute;tranger en utilisant les informations d&rsquo;enveloppe. Lorsque ces messages sont alors trait&eacute;s par un retraitement de messagerie qui se fonde uniquement sur les en-t&ecirc;tes, les boucles en retour sur l&rsquo;environnement Internet (et la liste de diffusion) sont presque in&eacute;vitables. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287789"></a><a name="_Toc186079903"></a><a name="_Toc186079815"> C Routes</a> de source </h1>
<p>Historiquement, le &lt;chemin inverse&gt; &eacute;tait une liste d&rsquo;acheminement de source invers&eacute;e des h&ocirc;tes et une bo&icirc;te &agrave; lettres de source. Le premier h&ocirc;te dans le &lt;chemin inverse&gt; DEVRAIT &ecirc;tre l&rsquo;h&ocirc;te qui envoie la commande MAIL. De m&ecirc;me, le &lt;chemin-de-transmission&gt; peut &ecirc;tre une liste des acheminements de source des h&ocirc;tes et une bo&icirc;te &agrave; lettres de destination. Cependant, en g&eacute;n&eacute;ral, le &lt;chemin-de-transmission&gt; DEVRAIT contenir seulement une bo&icirc;te &agrave; lettres et un nom de domaine, s&rsquo;appuyant sur le syst&egrave;me de nom de domaine pour fournir si n&eacute;cessaire les informations d&rsquo;acheminement. L&rsquo;utilisation des routes de source est d&eacute;conseill&eacute;e ; alors que les serveurs DOIVENT &ecirc;tre pr&eacute;par&eacute;s &agrave; les recevoir et les traiter comme expos&eacute; aux paragraphes 3.3 et F.2, les clients NE DEVRAIENT PAS les transmettre et ce paragraphe n&rsquo;est inclus que pour d&eacute;crire le contexte. </p>
<p>Pour les besoins du relais, le chemin de transmission peut &ecirc;tre une route de source de la forme &quot;@UN,@DEUX:JOE@TROIS&quot;, o&ugrave; UN, DEUX, et TROIS DOIVENT &ecirc;tre des noms de domaine pleinement qualifi&eacute;s. Cette forme est utilis&eacute;e pour souligner la distinction entre une adresse et une route. La bo&icirc;te &agrave; lettres est une adresse absolue, et la route est l&rsquo;information sur la fa&ccedil;on de s&rsquo;y rendre. Les deux concepts ne devraient pas &ecirc;tre confondus. </p>
<p>Si les routes de source sont utilis&eacute;es, la RFC 821 et le texte ci-dessous devraient &ecirc;tre consult&eacute;s pour les m&eacute;canismes de construction et de mise &agrave; jour des chemins de transmission et des chemins inverses. </p>
<p>Le serveur SMTP transforme les arguments de commande en d&eacute;pla&ccedil;ant son propre identifiant (son nom de domaine ou celui de tout domaine pour lequel il agit comme &eacute;changeur de messagerie), si il appara&icirc;t, du chemin de transmission au d&eacute;but du chemin inverse. </p>
<p>Remarquer que le chemin de transmission et le chemin inverse apparaissent dans les commandes et les r&eacute;ponses SMTP, mais pas n&eacute;cessairement dans le message. C&rsquo;est-&agrave;-dire qu&rsquo;il n&rsquo;est pas n&eacute;cessaire que ces chemins et particuli&egrave;rement cette syntaxe apparaisse dans les champs &quot;To:&quot;, &quot;From:&quot;, &quot;CC:&quot;, etc. des en-t&ecirc;tes de message. &Agrave; l&rsquo;inverse, les serveurs SMTP NE DOIVENT PAS d&eacute;duire des informations de livraison finale du message des champs d&rsquo;en-t&ecirc;te du message. </p>
<p>Lorsque la liste des h&ocirc;tes est pr&eacute;sente, c&rsquo;est un chemin de source &quot;inverse&quot; et elle indique que le message a &eacute;t&eacute; relay&eacute; &agrave; travers chaque h&ocirc;te de la liste (le premier h&ocirc;te de la liste a &eacute;t&eacute; le relais le plus r&eacute;cent). Cette liste est utilis&eacute;e comme route de source pour retourner les avis de non livraison &agrave; l&rsquo;envoyeur. Comme chaque h&ocirc;te relais s&rsquo;ajoute lui-m&ecirc;me au d&eacute;but de la liste, il DOIT utiliser son nom tel que connu dans l&rsquo;environnement de transport auquel il relaie le message plut&ocirc;t que dans l&rsquo;environnement de transport d&rsquo;o&ugrave; provient le message (s&rsquo;il sont diff&eacute;rents). </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287790"></a><a name="_Toc186079904"></a><a name="_Toc186079816"> D Sc&eacute;narios</a></h1>
<p>Cette section pr&eacute;sente des sc&eacute;narios complets de plusieurs types de sessions SMTP. Dans les exemples, &quot;C:&quot; indique ce qui est dit par le client SMTP, et &quot;S:&quot; indique ce qui est dit par le serveur SMTP. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287791"></a><a name="_Toc186079905"></a><a name="_Toc186079817"> D.1 Sc&eacute;nario de transaction SMTP typique</a></h2>
<p> Cet exemple SMTP montre un message envoy&eacute; par Smith de l&rsquo;h&ocirc;te bar.com, &agrave; Jones, Green, et Brown &agrave; l&rsquo;h&ocirc;te foo.com. On suppose ici que l&rsquo;h&ocirc;te bar.com contacte directement l&rsquo;h&ocirc;te foo.com. Le message est accept&eacute; pour Jones et Brown. Green n&rsquo;a pas de bo&icirc;te &agrave; lettres &agrave; h&ocirc;te foo.com. </p>
<p>S: 220 foo.com Simple Mail Transfer Service Ready <br>
C: EHLO bar.com <br>
S: 250-foo.com greets bar.com <br>
S: 250-8BITMIME <br>
S: 250-SIZE <br>
S: 250-DSN <br>
S: 250 HELP <br>
C: MAIL FROM:&lt;Smith@bar.com&gt; <br>
S: 250 OK <br>
C: RCPT TO:&lt;Jones@foo.com&gt; <br>
S: 250 OK <br>
C: RCPT TO:&lt;Green@foo.com&gt; <br>
S: 550 Nom d&rsquo;utilisateur inconnu <br>
C: RCPT TO:&lt;Brown@foo.com&gt; <br>
S: 250 OK <br>
C: DATA <br>
S: 354 D&eacute;but des entr&eacute;es du message ; fin avec &lt;CRLF&gt;.&lt;CRLF&gt; <br>
C: Blah blah blah... <br>
C: ...etc. etc. etc. <br>
C: . <br>
S: 250 OK <br>
C: QUIT <br>
S: 221 foo.com Cl&ocirc;ture du canal de transmission du service </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287792"></a><a name="_Toc186079906"></a><a name="_Toc186079818"> D.2 Sc&eacute;nario de transaction SMTP interrompue</a></h2>
<p> S: 220 foo.com Simple Mail Transfer Service Ready <br>
C: EHLO bar.com <br>
S: 250-foo.com greets bar.com <br>
S: 250-8BITMIME <br>
S: 250-SIZE <br>
S: 250-DSN <br>
S: 250 HELP <br>
C: MAIL FROM:&lt;Smith@bar.com&gt; <br>
S: 250 OK <br>
C: RCPT TO:&lt;Jones@foo.com&gt; <br>
S: 250 OK <br>
C: RCPT TO:&lt;Green@foo.com&gt; <br>
S: 550 Nom d&rsquo;utilisateur inconnu <br>
C: RSET <br>
S: 250 OK <br>
C: QUIT <br>
S: 221 foo.com Cl&ocirc;ture du canal de transmission du service </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287793"></a><a name="_Toc186079907"></a><a name="_Toc186079819"> D.3 Sc&eacute;nario de messagerie relay&eacute;e</a></h2>
<p> &Eacute;tape 1 -- H&ocirc;te de source &agrave; h&ocirc;te relais </p>
<p>S: 220 foo.com Simple Mail Transfer Service Ready <br>
C: EHLO bar.com <br>
S: 250-foo.com greets bar.com <br>
S: 250-8BITMIME <br>
S: 250-SIZE <br>
S: 250-DSN <br>
S: 250 HELP <br>
C: MAIL FROM:&lt;JQP@bar.com&gt; <br>
S: 250 OK <br>
C: RCPT TO:&lt;@foo.com:Jones@XYZ.COM&gt; <br>
S: 250 OK <br>
C: DATA <br>
S: 354 D&eacute;but des entr&eacute;es du message ; fin avec &lt;CRLF&gt;.&lt;CRLF&gt; <br>
C: Date: Thu, 21 May 1998 05:33:29 -0700 <br>
C: From: John Q. Public &lt;JQP@bar.com&gt; <br>
C: Sujet: Prochaine r&eacute;union du conseil d&rsquo;administration <br>
C: To: Jones@xyz.com <br>
C: <br>
C: Bill: <br>
C: La prochaine r&eacute;union du conseil des directeurs sera <br>
C: mardi. <br>
C: John. <br>
C: . <br>
S: 250 OK <br>
C: QUIT <br>
S: 221 foo.com Cl&ocirc;ture du canal de transmission du service </p>
<p>&Eacute;tape 2 -- H&ocirc;te relais &agrave; h&ocirc;te de destination </p>
<p>S: 220 xyz.com Simple Mail Transfer Service Ready <br>
C: EHLO foo.com <br>
S: 250 xyz.com est en ligne <br>
C: MAIL FROM:&lt;@foo.com:JQP@bar.com&gt; <br>
S: 250 OK <br>
C: RCPT TO:&lt;Jones@XYZ.COM&gt; <br>
S: 250 OK <br>
C: DATA <br>
S: 354 D&eacute;but des entr&eacute;es du message ; fin avec &lt;CRLF&gt;.&lt;CRLF&gt; <br>
C: Received: from bar.com by foo.com ; Thu, 21 May 1998 <br>
C: 05:33:29 -0700 <br>
C: Date: Thu, 21 May 1998 05:33:22 -0700 <br>
C: From: John Q. Public &lt;JQP@bar.com&gt; <br>
C: Sujet: Prochaine r&eacute;union du conseil d&rsquo;administration <br>
C: To: Jones@xyz.com <br>
C: <br>
C: Bill: <br>
C: La prochaine r&eacute;union du bureau des directeurs sera <br>
C: mardi. <br>
C: John. <br>
C: . <br>
S: 250 OK <br>
C: QUIT <br>
S: 221 foo.com Cl&ocirc;ture du canal de transmission du service </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287794"></a><a name="_Toc186079908"></a><a name="_Toc186079820"> D.4 Sc&eacute;nario de v&eacute;rification et d&rsquo;envoi</a></h2>
<p> S: 220 foo.com Simple Mail Transfer Service Ready <br>
C: EHLO bar.com <br>
S: 250-foo.com greets bar.com <br>
S: 250-8BITMIME <br>
S: 250-SIZE <br>
S: 250-DSN <br>
S: 250-VRFY <br>
S: 250 HELP <br>
C: VRFY Crispin <br>
S: 250 Mark Crispin &lt;Admin.MRC@foo.com&gt; <br>
C: SEND FROM:&lt;EAK@bar.com&gt; <br>
S: 250 OK <br>
C: RCPT TO:&lt;Admin.MRC@foo.com&gt; <br>
S: 250 OK <br>
C: DATA <br>
S: 354 D&eacute;but des entr&eacute;es du message ; fin avec &lt;CRLF&gt;.&lt;CRLF&gt; <br>
  C: Blah blah blah... <br>
  C: ...etc. etc. etc. <br>
  C: . <br>
  S: 250 OK <br>
  C: QUIT <br>
  S: 221 foo.com Cl&ocirc;ture du canal de transmission du service </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287795"></a><a name="_Toc186079909"></a><a name="_Toc186079821"> E Autres questions de passerelles</a></h1>
<p>En g&eacute;n&eacute;ral, les passerelles entre l&rsquo;Internet et les autres syst&egrave;mes de messagerie DEVRAIENT essayer de pr&eacute;server toute la s&eacute;mantique de stratification &agrave; travers les fronti&egrave;res entre les deux syst&egrave;mes de messagerie impliqu&eacute;s. Les approches de traduction de passerelle qui essayent de prendre des raccourcis par des transpositions, (comme celle des informations d&rsquo;enveloppe d&rsquo;un syst&egrave;me en en-t&ecirc;tes de message ou corps de message de l&rsquo;autre) se sont g&eacute;n&eacute;ralement r&eacute;v&eacute;l&eacute;es &ecirc;tre inad&eacute;quates de fa&ccedil;on importante. Les traductions de syst&egrave;mes entre des environnements qui ne prennent en charge ni les enveloppes ni les en-t&ecirc;tes et la messagerie Internet doivent &ecirc;tre r&eacute;dig&eacute;es en comprenant que des pertes d&rsquo;information sont presque in&eacute;vitables. </p>
<p>&nbsp; </p>
<h1><a name="_Toc186287796"></a><a name="_Toc186079910"></a><a name="_Toc186079822"> F Dispositifs d&eacute;conseill&eacute;s de la RFC 821</a></h1>
<p>Quelques dispositifs de la RFC 821 se sont r&eacute;v&eacute;l&eacute;s &ecirc;tre probl&eacute;matiques et NE DEVRAIENT PAS &ecirc;tre utilis&eacute;s dans la messagerie Internet. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287797"></a><a name="_Toc186079911"></a><a name="_Toc186079823"> F.1 TURN</a></h2>
<p> Cette commande, d&eacute;crite dans la RFC 821, soul&egrave;ve d&rsquo;importantes questions de s&eacute;curit&eacute; car, en l&rsquo;absence de forte authentification de l&rsquo;h&ocirc;te demandant que client et serveur intervertissent leur r&ocirc;les, elle peut ais&eacute;ment &ecirc;tre utilis&eacute;e pour d&eacute;tourner des messages de leur destination correcte. Son utilisation est d&eacute;conseill&eacute;s ; les syst&egrave;mes SMTP NE DEVRAIENT PAS l&rsquo;utiliser &agrave; moins que le serveur puisse authentifier le client. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287798"></a><a name="_Toc186079912"></a><a name="_Toc186079824"> F.2 Acheminement de source</a></h2>
<p> La RFC 821 utilisait le concept d&rsquo;acheminement explicite de source pour obtenir du courrier d&rsquo;un h&ocirc;te &agrave; un autre via une s&eacute;rie de relais. L&rsquo;exigence d&rsquo;utiliser les routes de source dans le trafic r&eacute;gulier de messagerie a &eacute;t&eacute; &eacute;limin&eacute;e par l&rsquo;introduction de l&rsquo;enregistrement &quot;MX&quot; du syst&egrave;me de nom de domaine et sa derni&egrave;re justification significative a &eacute;t&eacute; &eacute;limin&eacute;e par l&rsquo;introduction, dans la RFC 1123, d&rsquo;une exigence claire que les adresses suivant un &quot;@&quot; soient toutes un nom de domaine pleinement qualifi&eacute;. Par cons&eacute;quent, les seules justifications restantes pour l&rsquo;utilisation des routes de source sont leur soutien par de tr&egrave;s vieux clients SMTP ou MUA et dans la correction d&rsquo;erreur des syst&egrave;mes de messagerie. Il peut, cependant, &ecirc;tre encore utile dans ce dernier cas et pour acheminer des messages lors de probl&egrave;mes s&eacute;rieux mais temporaires, tels que des probl&egrave;mes avec les enregistrements DNS pertinents. </p>
<p>Les serveurs SMTP DOIVENT continue d&rsquo;accepter la syntaxe de route de source comme sp&eacute;cifi&eacute; dans le corps principal de ce document et dans la RFC 1123. Ils PEUVENT, si n&eacute;cessaire, ignorer les routes et n&rsquo;utiliser que le domaine cible dans l&rsquo;adresse. Si ils utilisent quand m&ecirc;me la route de source, le message DOIT &ecirc;tre envoy&eacute; dans le premier domaine indiqu&eacute; dans l&rsquo;adresse. En particulier, un serveur NE DOIT PAS penser &agrave; des raccourcis au sein de la route de source. </p>
<p>Les clients NE DEVRAIENT PAS utiliser d&rsquo;acheminement de source explicite except&eacute; dans des circonstances exceptionnelles, comme la correction d&rsquo;erreurs ou un relais potentiel autour d&rsquo;un pare-feu ou d&rsquo;erreurs de configuration du syst&egrave;me de messagerie. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287799"></a><a name="_Toc186079913"></a><a name="_Toc186079825"> F.3 HELO</a></h2>
<p> Comme expos&eacute; aux paragraphes 3.1 et 4.1.1, EHLO est fortement pr&eacute;f&eacute;r&eacute; &agrave; HELO quand le serveur accepte le premier. Les serveurs doivent continuer d&rsquo;accepter et traiter HELO afin de prendre en charge les plus vieux clients. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287800"></a><a name="_Toc186079914"></a><a name="_Toc186079826"> F.4 Caract&egrave;re #</a></h2>
<p> La RFC 821 pr&eacute;voyait la sp&eacute;cification d&rsquo;une adresse Internet par un num&eacute;ro d&rsquo;h&ocirc;te en entier d&eacute;cimal pr&eacute;fix&eacute; d&rsquo;un signe di&egrave;se, &quot;#&quot;. En pratique, cette forme est obsol&egrave;te depuis l&rsquo;introduction de TCP/IP. Elle est d&eacute;conseill&eacute;e et NE DOIT PAS &ecirc;tre utilis&eacute;e. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287801"></a><a name="_Toc186079915"></a><a name="_Toc186079827"> F.5 Dates et ans</a></h2>
<p> Lorsque des dates sont ins&eacute;r&eacute;e dans les messages par les clients ou les serveurs SMTP (par exemple, dans les champs de trace), l&rsquo;ann&eacute;e en quatre chiffres DOIT &ecirc;tre utilis&eacute;e. les ann&eacute;es &agrave; deux chiffres sont d&eacute;conseill&eacute;es&nbsp;; les ann&eacute;es &agrave; trois chiffres n&rsquo;ont jamais &eacute;t&eacute; permises dans le syst&egrave;me de messagerie Internet. </p>
<p>&nbsp; </p>
<h2><a name="_Toc186287802"></a><a name="_Toc186079916"></a><a name="_Toc186079828"> F.6 Envoi direct contre messagerie</a></h2>
<p> En plus de la sp&eacute;cification d&rsquo;un m&eacute;canisme de livraison des messages &agrave; la bo&icirc;te &agrave; lettres des usagers, la RFC 821 pr&eacute;voyait des commandes suppl&eacute;mentaires facultatives pour d&eacute;livrer les messages directement &agrave; l&rsquo;&eacute;cran du terminal de l&rsquo;usager. Ces commandes (SEND, SAML, SOML) ont rarement &eacute;t&eacute; mises en &oelig;uvre, et les changements de la technologie des postes de travail et l&rsquo;introduction d&rsquo;autres protocoles les auraient rendues obsol&egrave;tes m&ecirc;me si elles avaient &eacute;t&eacute; mises en &oelig;uvre. </p>
<p>Les clients NE DEVRAIT PAS fournir les services SEND, SAML, ou SOML. Les serveurs PEUVENT les mettre en &oelig;uvre. Si ils sont mis en &oelig;uvre par les serveurs, le mod&egrave;le de mise en &oelig;uvre sp&eacute;cifi&eacute; dans la RFC 821 DOIT &ecirc;tre utilis&eacute; et les noms des commandes DOIVENT &ecirc;tre publi&eacute;s dans la r&eacute;ponse &agrave; la commande EHLO. </p>
<p>&nbsp; </p>
<p>&nbsp; </p>
<p><strong> D&eacute;claration de copyright </strong></p>
<p> Copyright (C) The Internet Society (2001). Tous droits r&eacute;serv&eacute;s </p>
<p>Le pr&eacute;sent document et ses traductions peuvent &ecirc;tre copi&eacute;s et fournis &agrave; des tiers, et les travaux d&eacute;riv&eacute;s qui le commentent ou l&rsquo;expliquent ou aident &agrave; sa mise en &oelig;uvre peuvent &ecirc;tre pr&eacute;par&eacute;s, copi&eacute;s, publi&eacute;s et distribu&eacute;s, en tout ou en partie, sans restriction d&rsquo;aucune sorte, pourvu que la d&eacute;claration de copyright et le pr&eacute;sent paragraphe soient inclus dans de telles copies et travaux d&eacute;riv&eacute;s. Cependant, le pr&eacute;sent document lui-m&ecirc;me ne doit &ecirc;tre modifi&eacute; d&rsquo;aucune fa&ccedil;on, ni en retirant la d&eacute;claration de copyright ni les r&eacute;f&eacute;rences &agrave; la Internet Society ou autres organisations de l&rsquo;Internet, except&eacute; en tant que de besoin dans le but de d&eacute;velopper les normes de l&rsquo;Internet auquel cas les proc&eacute;dures de copyright d&eacute;finies dans le traitement des normes de l&rsquo;Internet doivent &ecirc;tre suivies, ou selon les besoins de la traduction dans d&rsquo;autres langues que l&rsquo;anglais. </p>
<p>Les permissions limit&eacute;es accord&eacute;es ci-dessus sont perp&eacute;tuelles et ne seront pas r&eacute;voqu&eacute;es par la Internet Society ou ses successeurs ou ayant droits. </p>
<p>Le pr&eacute;sent document et les informations y contenues sont fournies sur une base &quot;EN L&rsquo;&Eacute;TAT&quot; et LE CONTRIBUTEUR, L&rsquo;ORGANISATION QU&rsquo;IL OU ELLE REPR&Eacute;SENTE OU QUI LE/LA FINANCE (S&rsquo;IL EN EST), LA INTERNET SOCIETY ET LA INTERNET ENGINEERING TASK FORCE D&Eacute;CLINENT TOUTES GARANTIES, EXPRIM&Eacute;ES OU IMPLICITES, Y COMPRIS MAIS NON LIMIT&Eacute;ES &Agrave; TOUTE GARANTIE QUE L&rsquo;UTILISATION DES INFORMATIONS CI-ENCLOSES NE VIOLENT AUCUN DROIT OU AUCUNE GARANTIE IMPLICITE DE COMMERCIALISATION OU D&rsquo;APTITUDE &Agrave; UN OBJET PARTICULIER. </p>
<p> <strong>Remerciement </strong><br>
Le financement de la fonction d&rsquo;&eacute;dition des RFC est actuellement fourni par la Internet Society. </p>
<p>&nbsp; </p>
<p>&nbsp;</p>
</body>
</html>